[
  {
    "idMeal": "53049",
    "strMeal": "Apam balik",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Malaysian",
    "strInstructions": "Süt, yağ ve yumurtayı karıştırın. Unu, kabartma tozunu ve tuzu karışıma eleyin. Tüm malzemeler eşit şekilde birleşene kadar iyice karıştırın.\r\n\r\nTavaya biraz hamur yayın. Tavanın kenarına ince bir hamur tabakası yayın. Küçük hava kabarcıkları görünene kadar tavayı 30-60 saniye örtün.\r\n\r\nTereyağı, krema mısır, ezilmiş fıstık ve şekeri krepin üzerine ekleyin. Alt yüzeyi kızardığında krepi ikiye katlayın.\r\n\r\nDilimlere kesin ve ılıkken yenmesi en iyisidir.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=6R8ffRRJcrg",
    "strIngredient1": "Süt",
    "strIngredient2": "Yağ",
    "strIngredient3": "Yumurta",
    "strIngredient4": "Un",
    "strIngredient5": "Kabartma Tozu",
    "strIngredient6": "Tuz",
    "strIngredient7": "Tuzsuz Tereyağı",
    "strIngredient8": "Şeker",
    "strIngredient9": "Fıstık Ezmesi",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "200ml",
    "strMeasure2": "60ml",
    "strMeasure3": "2",
    "strMeasure4": "1600g",
    "strMeasure5": "3 çay kaşığı",
    "strMeasure6": "1/2 çay kaşığı",
    "strMeasure7": "25g",
    "strMeasure8": "45g",
    "strMeasure9": "3 yemek kaşığı",
    "strMeasure10": " ",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.nyonyacooking.com/recipes/apam-balik~SJ5WuvsDf9WQ",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53050",
    "strMeal": "Ayam Percik",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Malaysian",
    "strInstructions": "Bir blender'da baharat ezmesi için malzemeleri ekleyin ve pürüzsüz olana kadar karıştırın.\r\nOrta ateşte baharat ezmesini bir tavaya veya tavaya dökün ve hoş bir koku gelene kadar 10 dakika kızartın. Macun çok kurursa her seferinde 1 yemek kaşığı su veya yağ ekleyin. Macunu yakmayın. Gerekirse ateşi biraz kısın.\r\nKaranfilleri, kakuleyi, demirhindi posasını, hindistan cevizi sütünü, suyu, şekeri ve tuzu ekleyin. Ateşi açın ve karışımı kaynatın. Ateşi orta kısığa getirin ve 10 dakika pişirin. Ara sıra karıştırın. Biraz azalacaktır. Bu marine sosu/sosudur, bu nedenle tadına bakın ve gerekirse baharatı ayarlayın Gerekli. Hafif acı olsa bile endişelenmeyin. Kızartırken geçecektir.\r\nMarinasyon/sos soğuduğunda, her şeyi tavuğun üzerine dökün ve bir gece ila iki gün marine edin.\r\nFırını 425 F'ye önceden ısıtın.\r\nTavukları marine soslarından çıkarın. Marine sosunu yağlanmış (veya alüminyum kaplı) bir fırın tepsisine dökün. Tavuğu sosun üzerine koyun (tavuğun sosu örttüğünden ve sosun açıkta olmadığından emin olun, aksi takdirde yanar) ve kalan marine sosunu tavuğun üzerine yayın. 35-45 dakika veya tavuğun en kalın kısmının iç sıcaklığı en az 175 F olana kadar kızartın.\r\nTavuğu 5 dakika dinlendirin. Tavuğu biraz yağla fırçalayın. Tavuğu sosla birlikte buharda pişirilmiş pilavın (veya Hindistan cevizi pilavının) üzerine servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=9ytR28QK6I8",
    "strIngredient1": "Tavuk Butları",
    "strIngredient2": "Çaylak Soğan",
    "strIngredient3": "Zencefil",
    "strIngredient4": "Sarımsak Dişi",
    "strIngredient5": "Acı Biber",
    "strIngredient6": "Zerdeçal",
    "strIngredient7": "Kimyon",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Rezene",
    "strIngredient10": "Tamarind Macunu",
    "strIngredient11": "Hindistan Cevizi Sütü",
    "strIngredient12": "Şeker",
    "strIngredient13": "Su",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "6",
    "strMeasure2": "16",
    "strMeasure3": "1 1/2",
    "strMeasure4": "6",
    "strMeasure5": "8",
    "strMeasure6": "2 yemek kaşığı",
    "strMeasure7": "1 1/2",
    "strMeasure8": "1 1/2",
    "strMeasure9": "1 1/2",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "1 kutu",
    "strMeasure12": "1 çay kaşığı",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "http://www.curiousnut.com/roasted-spiced-chicken-ayam-percik/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52873",
    "strMeal": "Dana Köfte Güveci",
    "strDrinkAlternate": null,
    "strCategory": "Dana",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 180C/350F/Gaz 4'e önceden ısıtın.\r\n\r\nDana güveci için, fırına dayanıklı bir güveçte yağı ve tereyağını ısıtın ve dana etini her tarafı kızarana kadar kızartın.\r\n\r\nUnun üzerine serpin ve 2-3 dakika daha pişirin.\r\n\r\nSarımsağı ve tüm sebzeleri ekleyin ve 1-2 dakika kızartın.\r\n\r\nŞarap, et suyu ve otları karıştırın, ardından Worcestershire sosu ve balzamik sirkeyi damak tadınıza göre ekleyin. Tuz ve taze çekilmiş siyah biber.\r\n\r\nKapağını kapatıp fırına koyun ve yaklaşık iki saat veya et yumuşayana kadar pişirin.\r\n\r\nKöfteler için unu, kabartma tozunu ve tuzu bir kaseye eleyin.\r\nYağı ve kalın bir hamur elde edene kadar yeterli suyu ekleyin.\r\n\r\nUnlanmış ellerle hamurdan kaşık kaşık küçük toplar yapın.\r\n\r\nİki saat sonra güveçten kapağı çıkarın ve topları güvecin üzerine yerleştirin. Üzerini kapatın, fırına geri koyun ve 20 dakika daha veya köfteler şişip yumuşayana kadar pişirin. (Köftelerinizin üstünün altın rengi olmasını istiyorsanız fırına geri koyarken kapağı açık bırakın.)\r\n\r\nServis etmek için dört servis tabağının her birine bir kaşık patates püresi koyun ve güveç ve köftelerle üstünü kapatın. Üzerine kıyılmış maydanoz serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg",
    "strTags": "Güveç,Pişirme",
    "strYoutube": "https://www.youtube.com/watch?v=6NgheY-r5t0",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Sığır Eti",
    "strIngredient4": "Sade Un",
    "strIngredient5": "Sarımsak",
    "strIngredient6": "Soğan",
    "strIngredient7": "Kereviz",
    "strIngredient8": "Havuç",
    "strIngredient9": "Pırasa",
    "strIngredient10": "İsveç",
    "strIngredient11": "Kırmızı Şarap",
    "strIngredient12": "Sığır Suyu",
    "strIngredient13": "Defne Yaprağı",
    "strIngredient14": "Kekik",
    "strIngredient15": "Maydanoz",
    "strIngredient16": "Düz Un",
    "strIngredient17": "Kabartma Tozu",
    "strIngredient18": "Suet",
    "strIngredient19": "Su",
    "strIngredient20": null,
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "25g",
    "strMeasure3": "750g",
    "strMeasure4": "2 yemek kaşığı ",
    "strMeasure5": "2 diş kıyılmış",
    "strMeasure6": "175g",
    "strMeasure7": "150g",
    "strMeasure8": "150g",
    "strMeasure9": "2 doğranmış",
    "strMeasure10": "200g",
    "strMeasure11": "150ml",
    "strMeasure12": "500g",
    "strMeasure13": "2",
    "strMeasure14": "3 yemek kaşığı",
    "strMeasure15": "3 yemek kaşığı doğranmış",
    "strMeasure16": "125g",
    "strMeasure17": "1 çay kaşığı ",
    "strMeasure18": "60g",
    "strMeasure19": "Sıçrama",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/beefstewwithdumpling_87333",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52891",
    "strMeal": "Blackberry Fool",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Bisküviler için fırını 200C/180C (fan)/Gaz 6'ya önceden ısıtın ve iki büyük fırın tepsisini pişirme kağıdıyla kaplayın. Fındıkları bir fırın tepsisine dağıtın ve fırında 6-8 dakika veya kızarana kadar kızartın. Yanma şansları olmaması için dikkatlice izleyin. Fırından çıkarın, bir tahtaya dökün ve soğumaya bırakın.\r\nTereyağı ve şekeri büyük bir kaseye koyun ve tahta bir kaşıkla açık renk ve krema kıvamına gelene kadar çırpın. Soğuyan fındıkları iri kıyın ve krema kıvamına gelene kadar tereyağı ve şekere, limon kabuğu rendesi, un ve kabartma tozuyla birlikte ekleyin. Karışım bir araya gelip bir top oluşturur – ellerinizi kullanmanız gerekebilir.\r\nBisküvi hamurunu 24 eşit parçaya bölün ve küçük toplar haline getirin. Topları, yayılmalarına izin verecek şekilde aralıklı olarak hazırlanmış fırın tepsilerine yerleştirin.\r\nBisküvileri yaklaşık 1 cm/½ inç kalınlığında düzleştirmek için bastırın. Bisküvileri, her seferinde bir tepsi olmak üzere, 12 dakika veya çok soluk altın-kahverengi olana kadar pişirin. Tepside soğumaya bırakın. Fırından çıkardığınızda çok yumuşak olacaklar, ancak soğudukça çıtır çıtır olacaklar.\r\nHava geçirmez bir tenekede saklayın ve beş gün içinde yiyin.\r İçin, böğürtlenleri bir süzgeçte yıkayarak toz veya kiri temizleyin. Böğürtlenleri yapışmaz bir tencereye koyun ve üzerine pudra şekeri serpin.\r\nLimon suyunu karıştırın ve böğürtlenler yumuşamaya ve suyunu bırakmaya başlayana kadar iki dakika boyunca hafifçe ısıtın. 12 böğürtleni süsleme için ayırın ve geri kalanını pişirmeye devam edin.\r\nBöğürtlenleri çok yumuşak ve yumuşak olana kadar düzenli olarak karıştırarak 15 dakika boyunca çok kısık ateşte pişirin. Ateşten alın ve meyveleri ve suyunu bir kase üzerinde bir elekten geçirin, kepçenin altını kullanarak mümkün olduğunca fazla püreyi çıkarın. Püreyi soğumaya bırakın ve çekirdeklerini atın. Yaklaşık 325 ml/11 fl oz püre elde etmelisiniz.\r\nKremayı ve yoğurdu büyük bir kaseye koyun ve çırpıcı kaseden çıkarıldığında yumuşak tepecikler oluşana kadar elektrikli çırpıcıyla çırpın - meyvenin asiditesi kremayı daha da koyulaştıracaktır, bu yüzden çok ileri götürmeyin.\r\nPüre tamamen soğuduğunda, gerekirse daha fazla şeker ekleyerek tatlılığını damak tadınıza göre ayarlayın. Çırpılmış krema ve yoğurtla birlikte kaseye dökün ve çok hafifçe birleşene kadar sadece bir veya iki kez karıştırın.\r\nBöğürtlenli keki geniş, cam tabaklara veya tek bir büyük, tek kaseye kaşıkla koyun. Oldukça mermer gibi görünmelidir, bu yüzden fazla karıştırmayın. Üzerine birkaç küçük nane yaprağı serpin ve ayırdığınız böğürtlenlerle süsleyin. İsterseniz biraz şeker serpin ve fındıklı bisküvilerle servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg",
    "strTags": "Çöl,Yaz,Meyveli,Süt",
    "strYoutube": "https://www.youtube.com/watch?v=kniRGjDLFrQ",
    "strIngredient1": "Fındık",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Pudra Şekeri",
    "strIngredient4": "Limon",
    "strIngredient5": "Düz Un",
    "strIngredient6": "Kabartma Tozu",
    "strIngredient7": "Blackberrys",
    "strIngredient8": "Şeker",
    "strIngredient9": "Toz Şeker",
    "strIngredient10": "Limon Suyu",
    "strIngredient11": "Çift Krema",
    "strIngredient12": "Yoğurt",
    "strIngredient13": "Nane",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "125g",
    "strMeasure3": "150g",
    "strMeasure4": "Rendelenmiş",
    "strMeasure5": "150g",
    "strMeasure6": "½ çay kaşığı",
    "strMeasure7": "600g",
    "strMeasure8": "75g",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "300ml ",
    "strMeasure12": "100ml",
    "strMeasure13": "Şununla süsleyin",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/blackberry_fool_with_11859",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52904",
    "strMeal": "Sığır Bourguignon",
    "strDrinkAlternate": null,
    "strCategory": "Sığır",
    "strArea": "Fransız",
    "strInstructions": "Büyük bir güveç tavasını ısıtın ve 1 yemek kaşığı kaz yağı ekleyin. Eti baharatlayın ve altın rengi kahverengi olana kadar yaklaşık 3-5 dakika kızartın, sonra çevirin ve etin her tarafı kızarana kadar diğer tarafını kızartın, gerekirse daha fazla yağ ekleyin. Bunu 2-3 parti halinde yapın, kızardığında eti bir kase üzerine yerleştirilmiş bir süzgece aktarın.\r\nAynı tavada pastırmayı, arpacık soğanını veya inci soğanını, mantarı, sarımsağı ve buket garniyi hafifçe kızarana kadar kızartın. Domates püresini ekleyin ve karışıma karıştırarak birkaç dakika pişirin. Bu, bourguignon'u zenginleştirir ve güveç. Sonra eti ve süzülmüş suyu tavaya geri koyun ve karıştırın.\r\nEt sıvıdan sıçrayacak ancak tamamen kaplanmayacak şekilde şarap ve yaklaşık 100 ml su dökün. Kaynatın ve bir kaşık kullanarak karamelize olmuş pişirme suyunu tavanın dibinden kazıyın - bu güvece daha fazla lezzet katacaktır.\r\nFırını 150C/fan 130C/gaz 2'ye ısıtın. Bir kartuş yapın: güveçten biraz daha büyük bir folyo karesi koparın, güvecin üstünü kaplayacak şekilde tavaya yerleştirin ve fazla folyoyu kesin. Sonra 3 saat pişirin. Sos sulu görünüyorsa, eti ve sebzeleri delikli bir kaşıkla çıkarın ve bir kenara koyun. Sos biraz koyulaşana kadar sosu yüksek ateşte birkaç dakika pişirin, ardından eti ve sebzeleri tavaya geri koyun.\r\nKereviz püresi yapmak için kerevizi soyun ve küpler halinde kesin. Büyük bir tavada zeytinyağını ısıtın. Kerevizi ekleyin ve altın rengi olana kadar 5 dakika kızartın. Tuz ve karabiberle iyice tatlandırın. Biberiye, kekik, defne ve kakule kabuklarını ekleyin, ardından kerevizi neredeyse kaplayacak kadar 200 ml su dökün. Ateşi kısın, tavayı kısmen kapatın ve 25-30 dakika kısık ateşte pişirin.\r\n25-30 dakika sonra kereviz yumuşamış ve suyun çoğu buharlaşmış olmalıdır. Kalan suyu süzün, ardından ot dallarını, defne ve kakule kabuklarını çıkarın. Patates ezici ile hafifçe ezin, ardından bir yudum zeytinyağı ile tamamlayın ve damak tadınıza göre baharatlayın. Sığır eti bourguignon'u servis kaselerine koyun ve üzerine büyük bir kaşık kereviz püresi koyun. İsterseniz defne yapraklarından biriyle süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=SQnr4Z-7rok",
    "strIngredient1": "Kaz Yağı",
    "strIngredient2": "Dana İncik",
    "strIngredient3": "Pastırma",
    "strIngredient4": "Çaylak",
    "strIngredient5": "Kestane Mantarı",
    "strIngredient6": "Sarımsak Dişi",
    "strIngredient7": "Buket Garni",
    "strIngredient8": "Domates Püresi",
    "strIngredient9": "Kırmızı Şarap",
    "strIngredient10": "Kereviz",
    "strIngredient11": "Zeytinyağı",
    "strIngredient12": "Kekik",
    "strIngredient13": "Biberiye",
    "strIngredient14": "Defne Yaprağı",
    "strIngredient15": "Kakule",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "3 çay kaşığı",
    "strMeasure2": "600g",
    "strMeasure3": "100g",
    "strMeasure4": "350g",
    "strMeasure5": "250g",
    "strMeasure6": "2 dilimlenmiş",
    "strMeasure7": "1",
    "strMeasure8": "1 yemek kaşığı",
    "strMeasure9": "750 ml",
    "strMeasure10": "600g",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "taze dal",
    "strMeasure13": "taze dal",
    "strMeasure14": "2",
    "strMeasure15": "4",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/5032/beef-bourguignon",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52782",
    "strMeal": "Kuzu domates ve tatlı baharatlar",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "Fas",
    "strInstructions": "Burada salamurada saklanan turşu yaprakları kullanın. Küçük narin yapraklar büyük kıllı olanlardan daha iyidir ancak elinizde yalnızca büyük yapraklar varsa, dolgunun etrafında çok fazla yaprak tabakası olmaması için bunları yaklaşık 12 x 12 cm olacak şekilde kesin. Ve tüm sapları çıkarın. Korunmuş yaprakları süzün, 10 dakika kaynar suda bekletin ve kullanmadan önce bir çay havlusu üzerinde kurumaya bırakın. \r\nTereyağlı ve çam fıstıklı basmati pirinci ideal bir eşlikçidir. Kuskus da harikadır. Dört kişiliktir.\r\nÖnce dolguyu yapın. Domatesler hariç tüm malzemeleri bir kase. Domatesleri ikiye kesin, kaba rendeleyin ve kabuklarını çıkarın. Yarım çay kaşığı tuz ve biraz karabiber ekleyin ve karıştırın. Bir kenara veya buzdolabında bir güne kadar bekletin. Kullanmadan önce, ellerinizle hafifçe sıkın ve çıkan suyu süzün.\r\nSosu yapmak için, orta boy bir tavada yağı ısıtın. Zencefil ve sarımsağı ekleyin, yakmamaya dikkat ederek bir veya iki dakika pişirin, ardından domatesi, limon suyunu ve şekeri ekleyin. Baharatlayın ve 20 dakika pişirin.\r\nSos fokurdarken, asma yapraklarını hazırlayın. Yırtık veya kırık yaprakları geniş ve ağır bir tencerenin tabanını kaplamak için kullanın. Rezene yapraklarını kesin, dikey olarak 0,5 cm kalınlığında dilimler halinde kesin ve tencerenin tabanını tamamen kaplayacak şekilde yayın.\r\nHazırlanmış bir asma yaprağını (girişe bakın) damarlı tarafı yukarı bakacak şekilde bir çalışma yüzeyine koyun. Yaprağın tabanına 2 cm uzunluğunda ve 1 cm genişliğinde bir şerit halinde iki tatlı kaşığı iç harcı koyun. Yaprağın kenarlarını iç harcın üzerine katlayın, sonra alttan üste doğru sıkıca puro şeklinde sarın. Tavaya yerleştirin, dikişlerini aşağı doğru yapın ve kalan yapraklarla tekrarlayın, onları sıkıca yan yana çizgiler veya daireler halinde yerleştirin (gerekirse iki kat halinde).\r\nSosu yaprakların üzerine dökün (ve gerekirse sadece örtecek kadar su ekleyin). Yaprakları aşağı bastırmak için üstüne bir tabak koyun, sonra bir kapakla örtün. Kaynatın, ateşi kısın ve kısık ateşte 70 dakika pişirin. Sıvının çoğu buharlaşmalıdır. Ateşten alın ve biraz soğumaya bırakın - sıcak servis edilmesi en iyisidir. Servis ederken, tavada masaya getirin - harika görünüyor. Sıcak pilavla birkaç asma yaprağı ve rezene dilimi servis edin. Üzerine haşlama suyunu dökün ve kişnişle süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
    "strTags": "",
    "strYoutube": "https://www.youtube.com/watch?v=vaZb1MnFBgA",
    "strIngredient1": "zeytinyağı",
    "strIngredient2": "zencefil",
    "strIngredient3": "sarımsak",
    "strIngredient4": "domates",
    "strIngredient5": "limon suyu",
    "strIngredient6": "pudra şekeri",
    "strIngredient7": "asma yaprakları",
    "strIngredient8": "rezene bulb",
    "strIngredient9": "kuzu kıyması",
    "strIngredient10": "soğan",
    "strIngredient11": "patates",
    "strIngredient12": "basmati pirinci",
    "strIngredient13": "kıyılmış maydanoz",
    "strIngredient14": "kişniş",
    "strIngredient15": "limon suyu",
    "strIngredient16": "sarımsak",
    "strIngredient17": "karanfil",
    "strIngredient18": "tarçın",
    "strIngredient19": "domates",
    "strIngredient20": "",
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "4 cm parça ince kıyılmış",
    "strMeasure3": "2 diş soyulmuş ve doğranmış",
    "strMeasure4": "800g soyulmuş ve doğranmış",
    "strMeasure5": "2 yemek kaşığı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "50",
    "strMeasure8": "1 büyük",
    "strMeasure9": "400g",
    "strMeasure10": "1 orta",
    "strMeasure11": "1 küçük soyulmuş ve iri rendelenmiş",
    "strMeasure12": "2 yemek kaşığı",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "2 yemek kaşığı doğranmış",
    "strMeasure15": "1 yemek kaşığı",
    "strMeasure16": "2 diş",
    "strMeasure17": "½ çay kaşığı öğütülmüş",
    "strMeasure18": "½ çay kaşığı öğütülmüş ",
    "strMeasure19": "2 orta",
    "strMeasure20": "",
    "strSource": "http://www.ottolenghi.co.uk/recipes/meat/lamb-tomato-and-sweet-spices-shop",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52805",
    "strMeal": "Kuzu Biryani",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "Hint",
    "strInstructions": "Mümkün olduğunca az su kullanarak kajuyu, haşhaş tohumlarını ve kimyon tohumlarını pürüzsüz bir macun haline getirin. Bir kenara koyun. \r\n\r\nSıcakken dilimlenmiş soğanları derin yağda kızartın. Yağı aşırı doldurmayın. Soğanlar hafifçe kahverengiye döndüğünde yağdan alın ve kağıt havlu üzerinde süzün. Kızarmış soğan süzülürken çıtır çıtır olacaktır. Ayrıca kaju fıstıklarını da kızarana kadar kızartın. Bir kenara koyun.\r\n\r\nPirinci yıkayın ve yirmi dakika suda bekletin.\r\nBu arada büyük ve geniş bir tava alın, orta ateşte yağı ekleyin, dilimlenmiş soğanları ekleyin, karıştırılmış macunu ekleyin, üzerine yeşil biberleri, zencefil sarımsak ezmesini ekleyin ve sarımsakları ekleyip bir dakika kızartın.\r\nSonra domatesleri ekleyin ve pişene ve lapa olmayana kadar iyice soteleyin.\r\n\r\nSonra kırmızı toz biber, biryani tozu, nane, kişniş yapraklarını ekleyin ve iyice soteleyin.\r\nYoğurdu ekleyin ve iyice karıştırın. Yoğurt eklerken tavayı her zaman ocaktan uzaklaştırırım, böylece kesilmesini önler.\r\n\r\nŞimdi tavayı tekrar ocağa koyduktan sonra, yıkanmış kuzuyu, tuzu ve ½ su bardağı suyu ekleyin ve iyice karıştırın. 1 saat pişirin ve orta düşük ateşte kapalı olarak pişirin veya düdüklü tencereye 6 düdük sesi gelene kadar pişirin. Su tamamen boşalmamışsa, açık tutarak ısıtın.\r\n\r\nBaşka bir büyük tava alın, kullandığınız pirincin üç katı su bardağını ekleyin ve kaynatın. Yüksek kaynamaya başladığında pirinci, tuzu ve kimyonu ekleyin ve iyice karıştırın. Tam 7 dakika sonra veya pirinç %80 piştiğinde. Kapatın ve pirinci süzün.\r\n\r\nŞimdi katmanlama başlıyor. Kuzuya, hafifçe vurun ve düzeltin. Üzerine süzülmüş sıcak pirinci ekleyin. Kızarmış soğan, ghee, nane, kişniş yaprakları ve sütte eritilmiş safranla süsleyin.\r\n\r\nKabın üzerini kapatın ve 350f fırında 15 dakika veya pişene kadar ancak lapa olmayana kadar pişirin. Veya orta ateşte 12 dakika ve en düşük ateşte 5 dakika pişirin. Ve kapatın. Karıştırın ve sıcak servis edin!\r\nNotlar\r\n1. Fırında pişiriyorsanız, büyük fırına dayanıklı bir tavada pişirdiğinizden ve sıkıca kapattığınızdan ve ardından son adım için fırında tuttuğunuzdan emin olun.\r\n2. Eğer yoksa biryani masala'yı atlayabilir ve sadece garam masala ekleyebilirsiniz (1 çay kaşığı ve kırmızı biber tozu - 1 çay kaşığı yerine 3 çay kaşığı)\r\n3. Sonunda baharatlı olursa, biraz limon sıkın, bu acıyı azaltacak ve lezzetleri de artıracaktır.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
    "strTags": "Köri,Et",
    "strYoutube": "https://www.youtube.com/watch?v=r7SYVSG5nxo",
    "strIngredient1": "Kaju fıstığı",
    "strIngredient2": "Khus khus",
    "strIngredient3": "Kimyon tohumları",
    "strIngredient4": "Soğan",
    "strIngredient5": "Zencefilli sarımsak ezmesi",
    "strIngredient6": "Sarımsak",
    "strIngredient7": "Nane",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Safran",
    "strIngredient10": "Ghee",
    "strIngredient11": "Basmati pirinci",
    "strIngredient12": "Tam yağlı yoğurt",
    "strIngredient13": "Kimyon tohumları",
    "strIngredient14": "Defne yaprağı",
    "strIngredient15": "Tarçın",
    "strIngredient16": "Karanfil",
    "strIngredient17": "Kakule",
    "strIngredient18": "Kuzu eti",
    "strIngredient19": "Kırmızı biber tozu",
    "strIngredient20": "Biryani masala",
    "strMeasure1": "12",
    "strMeasure2": "½ yemek kaşığı",
    "strMeasure3": "½ yemek kaşığı",
    "strMeasure4": "3 ince dilimlenmiş",
    "strMeasure5": "2 çay kaşığı",
    "strMeasure6": "4 bütün",
    "strMeasure7": "Yapraklar",
    "strMeasure8": "Yapraklar",
    "strMeasure9": "½ çay kaşığı ½ su bardağı ılık sütte çözülmüş",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "2 Su Bardağı",
    "strMeasure12": "½ su bardağı",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "½",
    "strMeasure15": "1 ince parça",
    "strMeasure16": "3",
    "strMeasure17": "2",
    "strMeasure18": "1 lb",
    "strMeasure19": "1 çay kaşığı",
    "strMeasure20": "1 yemek kaşığı",
    "strSource": "http://www.relishthebite.com/restaurant-style-lamb-biryani/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52844",
    "strMeal": "Lazanya",
    "strDrinkAlternate": null,
    "strCategory": "Makarna",
    "strArea": "İtalyan",
    "strInstructions": "Büyük bir tencerede yağı ısıtın. Pastırmayı küçük parçalara ayırmak için mutfak makası kullanın veya bir kesme tahtası üzerinde doğramak için keskin bir bıçak kullanın. Pastırmayı tavaya ekleyin ve altın rengine dönmeye başlayana kadar sadece birkaç dakika pişirin. Soğan, kereviz ve havucu ekleyin ve ara sıra karıştırarak yumuşayana kadar orta ateşte 5 dakika pişirin.\r\nSarımsağı ekleyin ve 1 dakika pişirin, ardından kıymayı ekleyin ve yaklaşık 6 dakika boyunca her tarafı kızarana kadar tahta bir kaşıkla karıştırarak ve parçalayarak pişirin.\r\nDomates püresini ekleyin ve 1 dakika pişirin, sığır eti ve sebzelerle iyice karıştırın. doğranmış domatesler. Her kutuyu yarıya kadar suyla doldurup kutuda kalan domatesleri yıkayın ve tavaya ekleyin. Balı ekleyin ve damak tadınıza göre baharatlayın. 20 dakika pişirin.\r\nFırını 200C/180C fan/gaz 6'ya ısıtın. Lazanyayı birleştirmek için, ragu sosundan bir kepçeyle fırın tepsisinin veya güveç kabının tabanına dökün ve sosu tüm tabana yayın. Sosun üzerine sığması için üst üste gelecek şekilde 2 lazanya yaprağı yerleştirin, ardından daha fazla sos ve bir kat daha makarna ile tekrarlayın. 2 kat daha sos ve makarna ile tekrarlayın ve bir kat makarna ile bitirin.\r\nCrème fraîche'i bir kaseye koyun ve 2 yemek kaşığı suyla karıştırarak gevşetin ve pürüzsüz, dökülebilir bir sos elde edin. Bunu makarnanın üzerine dökün, ardından mozzarella peyniri ile kaplayın. Üzerine Parmesan serpin ve altın rengi ve köpürene kadar 25-30 dakika pişirin. İsterseniz fesleğenle serpiştirerek servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=gfhfsBPt46s",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Pastırma",
    "strIngredient3": "Soğan",
    "strIngredient4": "Kereviz",
    "strIngredient5": "Havuç",
    "strIngredient6": "Sarımsak",
    "strIngredient7": "Kıyma",
    "strIngredient8": "Domates Püresi",
    "strIngredient9": "Doğranmış Domatesler",
    "strIngredient10": "Bal",
    "strIngredient11": "Lazanya Yaprakları",
    "strIngredient12": "Creme Fraiche",
    "strIngredient13": "Mozzarella Topları",
    "strIngredient14": "Parmesan Peyniri",
    "strIngredient15": "Fesleğen Yaprakları",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 yemek kaşığı ",
    "strMeasure2": "2",
    "strMeasure3": "1 ince kıyılmış",
    "strMeasure4": "1 Çubuk",
    "strMeasure5": "1 orta",
    "strMeasure6": "2 diş kıyılmış",
    "strMeasure7": "500g",
    "strMeasure8": "1 yemek kaşığı",
    "strMeasure9": "800g",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "500g",
    "strMeasure12": "400ml",
    "strMeasure13": "125g",
    "strMeasure14": "50g",
    "strMeasure15": "Üst sos",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/classic-lasagne",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52827",
    "strMeal": "Massaman Sığır Körisi",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Tayland",
    "strInstructions": "Fırını 200C/180C fan/gaz 6'ya ısıtın, ardından fıstıkları altın rengi kahverengi olana kadar 5 dakika fırın tepsisinde kavurun. Elle tutulabilecek kadar soğuduğunda, kabaca doğrayın. Fırını 180C/160C fan/gaz 4'e düşürün.\r\nKapaklı büyük bir güveç kabına 2 yemek kaşığı Hindistan cevizi kremasını ısıtın. Köri ezmesini ekleyin ve 1 dakika kızartın, ardından sığır etini ekleyin ve iyice kaplanana ve mühürlenene kadar kızartın. Hindistan cevizinin geri kalanını yarım kutu suyla, patates, soğan, limon yaprakları, tarçın, demirhindi, şeker, balık sosu ve fıstıkların çoğuyla karıştırın. Kaynamaya başlayınca kısık ateşte pişirin, sonra üzerini kapatın ve dana eti yumuşayana kadar fırında 2 saat pişirin.\r\nDilimlenmiş acı biber ve kalan fıstıkları serpin, ardından yasemin pirinciyle birlikte doğrudan tabaktan servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
    "strTags": "Köri",
    "strYoutube": "https://www.youtube.com/watch?v=mVxgZSCU9_g",
    "strIngredient1": "Fıstık",
    "strIngredient2": "Hindistan cevizi kreması",
    "strIngredient3": "Massaman köri ezmesi",
    "strIngredient4": "Dana eti",
    "strIngredient5": "Patates",
    "strIngredient6": "Soğan",
    "strIngredient7": "Limon",
    "strIngredient8": "Tarçın çubuğu",
    "strIngredient9": "Tamarind ezmesi",
    "strIngredient10": "Esmer şeker",
    "strIngredient11": "Balık sosu",
    "strIngredient12": "acı biber",
    "strIngredient13": "Yasemin pirinci",
    "strIngredient14": null,
    "strIngredient15": null,
    "strIngredient16": null,
    "strIngredient17": null,
    "strIngredient18": null,
    "strIngredient19": null,
    "strIngredient20": null,
    "strMeasure1": "85g",
    "strMeasure2": "400ml kutu",
    "strMeasure3": "4 yemek kaşığı",
    "strMeasure4": "600g haşlanmış şeritler halinde kesilmiş",
    "strMeasure5": "450g mumsu",
    "strMeasure6": "1 ince dilimler halinde kesilmiş",
    "strMeasure7": "4 yaprak",
    "strMeasure8": "1",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı hurma veya yumuşak ışık",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "1 kırmızı çekirdekleri çıkarılmış ve ince dilimlenmiş, servis için",
    "strMeasure13": "servis için",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/420631/beef-massaman-curry",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52864",
    "strMeal": "Mantar ve Kestane Rotolo",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İngiliz",
    "strInstructions": "Kurutulmuş mantarları 350 ml kaynar suda bekletin ve ihtiyaç duyana kadar bir kenara koyun. Kestanelerin ¾'ünü krema kıvamına gelene kadar 150 ml suyla karıştırın. Kalan kestaneleri kabaca doğrayın.\r\nBüyük yapışmaz bir tavada 2 yemek kaşığı zeytinyağını ısıtın. Arpacık soğanlarını bir tutam tuzla yumuşayana kadar kızartın, ardından sarımsağı, doğranmış kestaneleri ve biberiye ekleyin ve 2 dakika daha kızartın. Yabani mantarları, 2 yemek kaşığı yağı ve biraz baharat ekleyin. Yumuşamaya başlayana kadar 3 dakika pişirin. Kurutulmuş mantarları süzün ve kabaca doğrayın ( ıslatma sıvısı), sonra bunları da soya sosuyla birlikte ekleyin ve 2 dakika daha kızartın.\r\nŞarabı, ayrılmış mantar sıvısını ve kestane kremasını bir sos oluşturmak için çırpın. Baharatlayın, sonra yarısını tavadaki mantar karışımına ekleyin ve sos parlaklaşana kadar 1 dakika pişirin. Biberiye dallarını çıkarın ve atın, sonra karışımı bir kenara koyun.\r\nFırını 180C/160C fan/gaz 4'e ısıtın. Büyük bir tencerede tuzlu suyu kaynatın ve büyük bir kase buzlu su hazırlayın. Lazanya yapraklarını kaynar suya 2 dakika veya yumuşayana ve biraz pişene kadar bırakın, sonra hemen soğuk suya daldırın. Parmaklarınızı kullanarak yaprakları dikkatlice ayırın ve temiz bir çay havlusuna aktarın. Her yaprağın alt üçte ikisine bir kaşık sos sürün, sonra kendinizden uzağa doğru yuvarlayarak kısa uçları yuvarlayın. Her ruloyu ikiye kesin, sonra makarna rulolarını masada servis etmekten mutluluk duyacağınız bir turta tabağına kesik tarafı yukarı bakacak şekilde yerleştirin. Tüm yufkaları sardıktan sonra mantar sosunuz kaldıysa, bunu sadece makarna rulolarından bazılarının açıkta kalan kısımlarına itin.\r\nSosun geri kalanını makarnanın üstüne dökün, sonra 10 dakika veya makarna şişle test edildiğinde artık direnç göstermeyene kadar pişirin.\r\nBu arada, galeta ununu, son 2 yemek kaşığı zeytinyağını, adaçayı yapraklarını ve biraz baharatı bir kaseye koyun ve her şeyi karıştırın. Rotoloyu kırıntılar ve adaçayı ile serpin, sonra üstü altın rengi olana ve adaçayı yaprakları çıtır çıtır olana kadar 10 dakika daha pişirin. Makarnanın sosu emmesi için 10 dakika soğumaya bırakın, ardından isterseniz yemeğinizi masaya koymadan önce üzerine biraz trüf yağı gezdirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg",
    "strTags": "Vejetaryen, Fındık",
    "strYoutube": "https://www.youtube.com/watch?v=GNN7_ZSJ5YE",
    "strIngredient1": "Mantar",
    "strIngredient2": "Kestane",
    "strIngredient3": "Çaylak",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Biberiye",
    "strIngredient6": "Vahşi Mantarlar",
    "strIngredient7": "Soya Sosu",
    "strIngredient8": "Beyaz Şarap",
    "strIngredient9": "Lazanya Yaprakları",
    "strIngredient10": "Ekmek Kırıntıları",
    "strIngredient11": "Adaçayı",
    "strIngredient12": "Trüf Yağı",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "30g",
    "strMeasure2": "240g",
    "strMeasure3": "3",
    "strMeasure4": "3 karanfil",
    "strMeasure5": "3 dal",
    "strMeasure6": "500g",
    "strMeasure7": "2 yemek kaşığı ",
    "strMeasure8": "125ml ",
    "strMeasure9": "350g",
    "strMeasure10": "4 yemek kaşığı",
    "strMeasure11": "1/2 avuç ",
    "strMeasure12": "servis etmek için",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/mushroom-chestnut-rotolo",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52876",
    "strMeal": "Kıymalı Turta",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 200C/400F/Gaz 6'ya önceden ısıtın.\r\nDerin bir tavada yağı ısıtın ve kıymayı 4-5 dakika kızartın, kızarırken tahta bir kaşıkla parçalayın.\r\nSoğanı ekleyin ve 2-3 dakika pişirin, ardından domates püresini ekleyin ve 2-3 dakika daha pişirin. Unu ekleyin ve bir dakika daha pişirin, ardından doğranmış mantarları, stout veya dana suyunu ve birkaç damla Worcestershire sosunu ekleyin. Kaynama noktasına getirin, ardından ateşi kısın, tavayı bir kapakla kapatın ve 20 dakika kısık ateşte pişirin. kenara koyun ve soğumaya bırakın, sonra et karışımını bir litrelik turta tabağına alın.\r\nHamuru unlanmış bir çalışma yüzeyinde turta tabağından biraz daha büyük olana kadar açın. Hamuru tabağın üzerine yavaşça örtün, kenarlarına sıkıca bastırın. Kenarlarını kesin, sonra yivli bir şekil verin.\r\nHamur artıklarından birkaç yaprak şekli kesin ve turtanın üstünü süsleyin, çırpılmış yumurta sarısı ile hamura yapıştırın.\r\nBuharın çıkması için hamurda üç veya dört kesik açın, sonra turtayı çırpılmış yumurta sarısının geri kalanıyla fırçalayın ve fırında 20-25 dakika veya kızarana kadar pişirin.\r\nServis etmek için dilimler halinde kesin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
    "strTags": "Turta, Et",
    "strYoutube": "https://www.youtube.com/watch?v=QY47h-uqq5g",
    "strIngredient1": "Bitkisel Yağ",
    "strIngredient2": "Kıyma",
    "strIngredient3": "Soğan",
    "strIngredient4": "Domates Püresi",
    "strIngredient5": "Sade Un",
    "strIngredient6": "Mantar",
    "strIngredient7": "Dana Suyu",
    "strIngredient8": "Worcestershire Sosu",
    "strIngredient9": "Kısa Hamur",
    "strIngredient10": "Yumurta Sarısı",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "500g",
    "strMeasure3": "1 doğranmış",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "1 ½ yemek kaşığı",
    "strMeasure6": "75g",
    "strMeasure7": "250ml",
    "strMeasure8": "Tire",
    "strMeasure9": "400g",
    "strMeasure10": "1",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/mincedbeefpie_89198",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52880",
    "strMeal": "McSinghs İskoç Böreği",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "İngiliz",
    "strInstructions": "Büyük bir tavayı ısıtın ve kimyon tohumlarını birkaç dakika kavurun, ardından bir kenara koyun. Aynı tavada yağı ısıtın ve soğan, sarımsak, biber, kırmızı biber ve bir tutam tuzu yaklaşık sekiz dakika, nem kalmayana kadar kızartın. Tavadan alın, kavrulmuş kimyon tohumlarını, toz hint cevizi (veya muskat) ve toz kişnişi ekleyin. Soğumaya bırakın.\r\nBüyük bir kasede kıyma kuzu, beyaz biber, taze kişniş ve soğutulmuş baharatlı soğan karışımını karıştırın. Üzerini örtün ve buzdolabında bekletin.\r\nFırını 200C/400F/Gaz 6'ya ısıtın ve 20cm/8in çapında kelepçeli yuvarlak kek kalıbını cömertçe iç yağı ile yağlayın.\r\nHamuru yapmak için un ve tuzu büyük bir kaseye eleyin ve ortasına bir kuyu açın.\r\nSüt, iç yağı ve 90ml/3fl oz suyu bir tencerede nazikçe ısıtın. İç yağı eridiğinde, ısıyı artırın ve kaynatın.\r\nKaynar sıvıyı una dökün ve tahta kaşıkla karıştırarak soğuyana kadar karıştırın. Bir top haline getirin.\r\nUn serpilmiş bir yüzeyde hızlıca çalışarak hamuru kısa süre yoğurun – hamur yumuşak ve nemli olacaktır. Hamurun üçte birini ayırın ve kalan kısmını iyice unlanmış bir yüzeyde açın. Pasta kabını hamurla kaplayın, yanlara doğru bastırın ve kalıbın tepesinden biraz yukarı çıkana kadar bastırın.\r\nİç harcı hamurlu kalıba azar azar ekleyin. Üst kısma ulaştığınızda hafif bir tepe oluşturun. Ayrılan hamuru açın ve pastanın üstünü kaplayın. Kenarlarını sıkıştırarak mühürleyin ve fazlalıkları kesin. Pastanın üst kısmında bir delik açın ve buharın çıkması için küçük bir alüminyum folyo tüpü yerleştirin.\r\nPastanın üstünü biraz çırpılmış yumurta sarısı ile fırçalayın ve önceden ısıtılmış fırında 30 dakika pişirin (alttaki rafta bir tepsi yerleştirerek damlayanları toplayın). Ardından sıcaklığı 160C/325F/Gaz 3'e düşürün ve 1¼ saat daha altın kahverengi olana kadar pişirin. Tamamen soğumaya bırakın ve iki saat veya bir gece buzdolabında bekletin.\r\nPastanın kenarını bir bıçakla gezdirin, kalıptan çıkarın ve chutney, salata veya turşularla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "strTags": "Börek",
    "strYoutube": "https://www.youtube.com/watch?v=1nArqhRyszw",
    "strIngredient1": "Kimyon",
    "strIngredient2": "Kanola Yağı",
    "strIngredient3": "Kırmızı Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Yeşil Biber",
    "strIngredient6": "Kırmızı Biber",
    "strIngredient7": "Muskat",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Kuzu Kıyma",
    "strIngredient10": "Karabiber",
    "strIngredient11": "Kişniş",
    "strIngredient12": "Un",
    "strIngredient13": "Tuz",
    "strIngredient14": "Süt",
    "strIngredient15": "İç Yağı",
    "strIngredient16": "Yumurta Sarısı",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 çay kaşığı",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "2 ince doğranmış",
    "strMeasure4": "6",
    "strMeasure5": "3 ince doğranmış",
    "strMeasure6": "1 ince doğranmış",
    "strMeasure7": "1 çay kaşığı",
    "strMeasure8": "2 çay kaşığı",
    "strMeasure9": "1kg",
    "strMeasure10": "1 çay kaşığı",
    "strMeasure11": "3 yemek kaşığı",
    "strMeasure12": "340g",
    "strMeasure13": "½ çay kaşığı",
    "strMeasure14": "90 ml",
    "strMeasure15": "150g",
    "strMeasure16": "Çırpılmış",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/mcsinghs_scotch_pie_98356",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52900",
    "strMeal": "Madeira Keki",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Fırını önceden 180C/350F/Gaz 4'e ısıtın. 18cm/7in yuvarlak kek kalıbını yağlayın, tabanını yağlı kağıt ile kaplayın ve kağıdı da yağlayın.\r\nBir kapta tereyağı ve şekeri birlikte krema kıvamına gelene kadar çırpın. Yumurtaları teker teker çırpın, her birini eklerken karışımı iyice çırpın ve karışımın kesilmemesi için son yumurtayla birlikte bir kaşık un ekleyin.\r\nUnu eleyin ve yavaşça karışıma katın, kaşıkla ağır bir şekilde düşen bir kıvama gelene kadar yeterli miktarda süt ekleyin. Limon kabuğu rendesini katın.\r\nKarışımı hazırlanan kalıba dökün ve üstünü hafifçe düzeltin. Kekin üstü altın kahverengiye dönene ve ortasına batırılan bir şiş temiz çıkana kadar fırının orta rafında 30-40 dakika pişirin.\r\nFırından çıkarın ve kalıpta 10 dakika soğumaya bırakın, ardından bir tel rafa çıkarın ve tamamen soğumaya bırakın.\r\nServis yapmak için keki şekerlenmiş kabuklarla süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/urtqut1511723591.jpg",
    "strTags": "Kek,Hafif,Fırın,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=-YDh4WEmK_E",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Toz Şeker",
    "strIngredient3": "Yumurta",
    "strIngredient4": "Kendinden Kabaran Un",
    "strIngredient5": "Süt",
    "strIngredient6": "Limon",
    "strIngredient7": "Karışık Kabuk",
    "strIngredient8": "",
    "strIngredient9": "",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "175g",
    "strMeasure2": "175g",
    "strMeasure3": "3",
    "strMeasure4": "250g",
    "strMeasure5": "3 yemek kaşığı",
    "strMeasure6": "1 limon kabuğu rendesi",
    "strMeasure7": "Süslemek İçin",
    "strMeasure8": "",
    "strMeasure9": "",
    "strMeasure10": "",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/madeiracake_73878",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52927",
    "strMeal": "Montreal Tütsülenmiş Et",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Kanadalı",
    "strInstructions": "Cilayı hazırlamak için küçük bir kasede tuz, pembe tuz, karabiber, kişniş, şeker, defne yaprağı ve karanfil karıştırın. Etin tamamını bu karışımla kaplayın ve büyük bir zipli plastik torbaya koyun. Buzdolabının en soğuk bölümüne yerleştirin ve 4 gün boyunca, günde iki kez etin yönünü değiştirerek bekletin.\r\nEti torbadan çıkarın ve soğuk su altında cilayı mümkün olduğunca yıkayın. Eti büyük bir kaba koyun, su ile doldurun ve 2 saat bekletin, her 30 dakikada bir suyu değiştirin. Suyu boşaltın ve kağıt havlularla iyice kurulayın.\r\nKarıştırıcı bir kasede karabiber, kişniş, paprika, sarımsak tozu, soğan tozu, dereotu, hardal, kereviz tohumu ve pul biberi karıştırın. Etin tamamını bu karışımla kaplayın.\r\nIzgarayı veya tütsüleyiciyi 225 dereceye ısıtın, ısındığında tütsüleme odunları ekleyin. Odunlar yanmaya başlayıp duman üretmeye başladığında, eti yağı yukarı gelecek şekilde yerleştirin ve kalın kısmına bir anlık sıcaklık ölçer yerleştirildiğinde 165 dereceye ulaşana kadar yaklaşık 6 saat tütsüleyin.\r\nEti büyük bir kavrulma tepsisine yerleştirin, tepsiyi iki ocak üzerinde yerleştirin ve içine 2,5 cm su ekleyin. Su kaynamaya başlayınca ısısını orta seviyeye düşürün, tepsiyi alüminyum folyo ile kapatın ve etin kalın kısmına bir anlık sıcaklık ölçer yerleştirildiğinde 180 dereceye ulaşana kadar 1-2 saat buharda pişirin. Gerekirse sıcak su ekleyin.\r\nEti kesme tahtasına alıp biraz soğumasını bekleyin. Dilimleyin ve tercihen çavdar ekmeği ve hardalla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
    "strTags": "Özel,Atıştırmalık,Güçlü Tatlar",
    "strYoutube": "https://www.youtube.com/watch?v=g5oCDoyxbBk",
    "strIngredient1": "Sığır Göğsü",
    "strIngredient2": "Tuz",
    "strIngredient3": "Karabiber",
    "strIngredient4": "Kişniş",
    "strIngredient5": "Şeker",
    "strIngredient6": "Defne Yaprağı",
    "strIngredient7": "Karanfil",
    "strIngredient8": "Karabiber",
    "strIngredient9": "Kişniş",
    "strIngredient10": "Paprika",
    "strIngredient11": "Sarımsak",
    "strIngredient12": "Soğan",
    "strIngredient13": "Dereotu",
    "strIngredient14": "İngiliz Hardalı",
    "strIngredient15": "Kereviz Tuzu",
    "strIngredient16": "Kırmızı Biber Pul",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1",
    "strMeasure2": "3 yemek kaşığı",
    "strMeasure3": "3 yemek kaşığı",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "1 yemek kaşığı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "1 çay kaşığı",
    "strMeasure8": "3 yemek kaşığı",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "1 yemek kaşığı",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "1 çay kaşığı",
    "strMeasure15": "1 yemek kaşığı",
    "strMeasure16": "1 çay kaşığı",
    "strSource": "http://www.meatwave.com/blog/montreal-smoked-meat-recipe",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52947",
    "strMeal": "Ma Po Tofu",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Çin",
    "strInstructions": "Minik bir tutam tuz ve susam yağı ekleyin ve kıyma etini iyice karıştırın, bir kenara bırakın.\r\nBir kasede 1 yemek kaşığı mısır nişastasını 2,5 yemek kaşığı su ile karıştırarak su nişastası hazırlayın.\r\nTofuyu kare küpler halinde kesin (yaklaşık 2 cm). Büyük bir tencereyi kaynamaya getirin, bir tutam tuz ekleyin ve tofu ekleyin, 1 dakika pişirin. Tofuyu çıkarın ve süzün.\r\nWok'u alın, 2 yemek kaşığı yağ ısıtın ve kıyma etini gevrekleşene kadar kızartın. Kıyma eti dışarı alın ve yağı wok'ta bırakın.\r\nDoubanjiang'ı 1 dakika boyunca düşük ateşte kızartın, ardından sarımsak, soğan beyazı, zencefil ve fermente siyah fasulyeyi ekleyin ve 30 saniye pişirin, sonra pul biberi ekleyin.\r\nBaharatlara su ekleyin ve yüksek ateşte kaynamaya getirin. Tofuyu dikkatlice ekleyin. Hafif soya sosu ve kıyma ekleyin. Kaynadıktan sonra ısıyı düşürün ve 6-8 dakika pişirin. Ardından doğranmış yeşil sarımsağı ekleyin.\r\nSuyu nişastasını karıştırın ve karışımın yarısını kaynayan tencereye ekleyin. Yaklaşık 30 saniye bekledikten sonra kalan yarısını ekleyin. Tofu tadına bakın, eğer yeterince tuzlu değilse biraz tuz ekleyebilirsiniz. Ayrıca, eğer fazla baharatlı olduğunu düşünüyorsanız, tadını yumuşatmak için biraz şeker ekleyebilirsiniz. Ancak dikkatli olun, çünkü bu noktada sıvı oldukça sıcak olacaktır.\r\nBaharatların neredeyse tamamı tofunun üzerine yapıştığında, üzerine Szechuan karabiberi (isteğe bağlı) ve doğranmış sarımsak yeşillikleri serpin.\r\nHemen buharda pişirilmiş pirinç ile servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1525874812.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=IhwPQL9dFYc",
    "strIngredient1": "Tofu",
    "strIngredient2": "Kıyma",
    "strIngredient3": "Susam Yağı",
    "strIngredient4": "Doubanjiang",
    "strIngredient5": "Fermente Siyah Fasulye",
    "strIngredient6": "Karabiber",
    "strIngredient7": "Tuz",
    "strIngredient8": "Sichuan Biberi",
    "strIngredient9": "Soya Sosu",
    "strIngredient10": "Su",
    "strIngredient11": "Zeytinyağı",
    "strIngredient12": "Soğanlar",
    "strIngredient13": "Yeşil Soğanlar",
    "strIngredient14": "Sarımsak",
    "strIngredient15": "Zencefil",
    "strIngredient16": "Su",
    "strIngredient17": "Mısır Nişastası",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "450g",
    "strMeasure2": "100g",
    "strMeasure3": "1/2 yemek kaşığı",
    "strMeasure4": "1 1/2 çay kaşığı",
    "strMeasure5": "1/2 çay kaşığı",
    "strMeasure6": "1 yemek kaşığı",
    "strMeasure7": "1/2 çay kaşığı",
    "strMeasure8": "1/2 çay kaşığı",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "400ml",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "2 doğranmış",
    "strMeasure13": "4",
    "strMeasure14": "2 diş doğranmış",
    "strMeasure15": "4 dilimlenmiş",
    "strMeasure16": "2 1/2 yemek kaşığı",
    "strMeasure17": "1 yemek kaşığı",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.chinasichuanfood.com/mapo-tofu-recipe/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53048",
    "strMeal": "Mee goreng mamak",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Malaysian",
    "strInstructions": "Orta ateşte bir tavada yağı ısıtın. Sonra, fıstıkları, kurutulmuş biberleri, kurutulmuş karidesleri ve mercimeği ekleyin. Aromatikleri güzel kokana kadar kızartın. Tavadan alın ve bir kenara koyun.\r\n\r\nKızarmış malzemeleri tamarind ezmesi ve suyla incecik olana kadar karıştırın. Sonra, karıştırılmış malzemeleri düşük ateşte ısıtılmış yağda soteleyin. Yağ ezmeden ayrılıp daha koyu bir renge dönene kadar pişirmeye devam edin.\r\n\r\nPatatesleri soyun ve küçük parçalara kesin ve bıçakla yumuşayana kadar bir tencerede suda kaynatın. Hazır olduğunda, tencereden alın ve bir kenara koyun. su.\r\n\r\nSoğanı ve kızarmış tofuyu dilimleyin, sarımsağı kıyın, biraz lahana ve Çin lahanası (choi sam) doğrayın. Karides kızartması hazırlayın ve doğrayın. Kurutulmuş olarak satın aldıysanız erişteleri yumuşaması için haşlayın. Ayrıca siyah soya sosunu suyla karıştırın.\r\n\r\nBir porsiyon mee goreng mamak'ı kızartmak için yağı ısıtın ve aşağıdaki malzemelerin 1/4'ünü şu sırayla ekleyin: sarımsak, soğan, salça. Güzel kokana kadar soteleyin. İsteğe bağlı olarak karides ekleyin.\r\n\r\n1/4 miktarda tofu, haşlanmış patates, lahana, Çin lahanası ve karides kızartması ekleyin. 30 saniye daha soteleyin.\r\n\r\nWok'a erişteleri ekleyin. 3 yemek kaşığı koyu soya sosu karışımını ekleyin. Sonraki 1 dakika boyunca eşit şekilde karıştırın. Ardından erişteleri wok'un kenarına alın. Bir yumurtayı karıştırın. Bir dilim limon ve yeşil biber dilimleriyle süsleyin. Başka bir erişte tabağı pişirmek için 5. adımdan itibaren tekrarlayın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
    "strIngredient1": "Fıstık",
    "strIngredient2": "Acı Biber",
    "strIngredient3": "Karides",
    "strIngredient4": "Yağ",
    "strIngredient5": "Su",
    "strIngredient6": "Tamarind Macunu",
    "strIngredient7": "Patates",
    "strIngredient8": "Kırmızı Soğan",
    "strIngredient9": "Sarımsak Dişi",
    "strIngredient10": "Lahana",
    "strIngredient11": "Çin Brokolisi",
    "strIngredient12": "Tofu",
    "strIngredient13": "Soya Sosu",
    "strIngredient14": "Erişte",
    "strIngredient15": "Yumurta",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "15g",
    "strMeasure3": "10g",
    "strMeasure4": "5 yemek kaşığı",
    "strMeasure5": "750 ml ",
    "strMeasure6": "1/2 yemek kaşığı",
    "strMeasure7": "250g",
    "strMeasure8": "2",
    "strMeasure9": "4",
    "strMeasure10": "30g",
    "strMeasure11": "30g",
    "strMeasure12": "1",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "4",
    "strMeasure15": "1",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.nyonyacooking.com/recipes/mee-goreng-mamak~BkTLRjTuX",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52858",
    "strMeal": "New York Cheesecake",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Fırın rafını fırının ortasına yerleştirin. Fırını fanlı 160C/konvansiyonel 180C/gaz 4'te ısıtın. 23 cm'lik bir kelepçeli kek kalıbının tabanını yağlı kağıtla kaplayın. Tabandaki hamur için, tereyağını orta boy bir tavada eritin. Bisküvi kırıntıları ve şekeri karıştırarak karışımın iyice nemlenmesini sağlayın. Karışımı kalıbın tabanına bastırarak yerleştirin ve 10 dakika pişirin. Bir tel ızgarada soğumaya bırakın, dolgu malzemesini hazırlarken.\r\nDolgu için, fırın sıcaklığını fanlı 200C/konvansiyonel 240C/gaz 9'a çıkarın. Masa üstü mikserine paddle aparatı takarak yumuşak peyniri orta-düşük hızda 2 dakika kadar çırpın. Mikseri düşük hızda tutarak şekeri, ardından unu ve tuzu ekleyin, kasesinin ve paddle'ın kenarlarını iki kez sıyırarak karıştırın.\r\nPaddle aparatı yerine çırpıcı aparatı takın. Vanilya, limon kabuğu ve suyunu ekleyerek çırpmaya devam edin. Yumurtaları ve yumurta sarısını birer birer ekleyin, karıştırma kabını ve çırpıcıyı en az iki kez sıyırın. 284 ml'lik ekşi kremayı ekleyin ve karıştırın, ardından 200 ml (paketin 3/4'ü) ekşi kremayı ölçün ve düşük hızda ekleyin. Karışımın pürüzsüz, hafif ve havadar olmasına dikkat ederek çırpın, aşırı çırpmayın.\r\nKelepçeli kalıbın yanlarını erimiş tereyağı ile fırçalayın ve üzerine bir pişirme tepsisi koyun. Karışımı dökün - eğer topaklar varsa, bir bıçakla batırarak düzeltebilirsiniz - üstü olabildiğince pürüzsüz olmalıdır. 10 dakika pişirin. Fırın sıcaklığını fanlı 90C/konvansiyonel 110C/gaz 1/4'e düşürün ve 25 dakika daha pişirin. Kalıbı hafifçe salladığınızda dolgunun hafifçe sarsılması gerekir. Fırını kapatın ve kapıyı açın, cheesecake'in merkezinin kremamsı olmasını istiyorsanız; kapalı tutun, daha kuru bir doku isterseniz. Fırında 2 saat soğumaya bırakın. Cheesecake'in üstü, soğurken hafifçe çatlayabilir.\r\nKalan ekşi kremayı, 142 ml'lik ekşi kremayı, şekeri ve limon suyunu karıştırarak üst sosu hazırlayın. Cheesecake'in üzerine kenarlara kadar yayın. Üstünü gevşekçe alüminyum folyo ile kapatın ve en az 8 saat veya bir gece buzdolabında soğutun.\r\nKelepçeli kalıbın kenarlarına yuvarlak uçlu bir bıçakla dokunun ve kenarlarda sıkışan kenarları gevşetmek için dikkatlice çözün. Yan tarafı açın, cheesecake'i kalıbın altından tabağa kaydırın ve yağlı kağıdı dikkatlice çıkarın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
    "strTags": "Tatlı,Sütlü,Puding,Kek,Kahvaltı",
    "strYoutube": "https://www.youtube.com/watch?v=tspdJ6hxqnc",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Ekşi Krema",
    "strIngredient3": "Şeker",
    "strIngredient4": "Krem Peynir",
    "strIngredient5": "Toz Şeker",
    "strIngredient6": "Un",
    "strIngredient7": "Limon Suyu",
    "strIngredient8": "Yumurtalar",
    "strIngredient9": "Ekşi Krema",
    "strIngredient10": "Ekşi Krema",
    "strIngredient11": "Toz Şeker",
    "strIngredient12": "Limon Suyu",
    "strMeasure1": "85g",
    "strMeasure2": "140g",
    "strMeasure3": "1 yemek kaşığı",
    "strMeasure4": "900g",
    "strMeasure5": "250g",
    "strMeasure6": "3 yemek kaşığı",
    "strMeasure7": "1 ½ tatlı kaşığı",
    "strMeasure8": "3 Büyük",
    "strMeasure9": "250ml",
    "strMeasure10": "150ml",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "2 tatlı kaşığı",
    "strSource": "https://www.bbcgoodfood.com/recipes/2869/new-york-cheesecake",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52924",
    "strMeal": "Nanaimo Barları",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Kanada",
    "strInstructions": "Bisküvi tabanını yapmaya başlamak için, bir kaba, kaynayan suyun üzerine tereyağını, şekeri ve kakao tozunu ekleyin, ara sıra karıştırarak karışımın pürüzsüz olmasını sağlayın. Yumurtayı 2-3 dakika kadar çırpın, karışım koyulaşıncaya kadar. Ocaktan alın ve bisküvi kırıntıları, hindistancevizi ve varsa bademleri ekleyin, sonra karışımı 20 cm'lik kare bir kalıba basarak yerleştirin. 10 dakika soğutun.\r\nOrta katman için, krema karışımını hazırlayın; tereyağını, kremayı ve krem şanti tozunu çırpın. Karışım hafif ve kabarık olduktan sonra, şeker ekleyin ve tamamen karıştırın. Karışımı bisküvi tabanının üzerine sürün ve buzdolabında 10 dakika kadar soğutun.\r\nÇikolatayı ve tereyağını mikrodalgada eritin, sonra karışımı soğutulmuş barların üzerine dökün ve tekrar buzdolabına koyun. Çikolata tamamen donana kadar (yaklaşık 2 saat) bekleyin. Karışımı kalıptan çıkarın ve kareler halinde dilimleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg",
    "strTags": "Atıştırmalık,Hafif,Yemek",
    "strYoutube": "https://www.youtube.com/watch?v=MMrE4I1ZtWo",
    "strIngredient1": "Krem Şanti",
    "strIngredient2": "Toz Şeker",
    "strIngredient3": "Kakao",
    "strIngredient4": "Yumurta",
    "strIngredient5": "Bisküvi Kırıntıları",
    "strIngredient6": "Hindistancevizi",
    "strIngredient7": "Badem",
    "strIngredient8": "Tereyağı",
    "strIngredient9": "Krema",
    "strIngredient10": "Krem Şanti Tozu",
    "strIngredient11": "Toz Şeker",
    "strIngredient12": "Bitter Çikolata",
    "strIngredient13": "Tereyağı",
    "strMeasure1": "125g",
    "strMeasure2": "50g",
    "strMeasure3": "5 yemek kaşığı",
    "strMeasure4": "1 çırpılmış",
    "strMeasure5": "200g doğranmış",
    "strMeasure6": "100g ",
    "strMeasure7": "50g",
    "strMeasure8": "100g ",
    "strMeasure9": "4 yemek kaşığı",
    "strMeasure10": "3 yemek kaşığı",
    "strMeasure11": "250g",
    "strMeasure12": "150g",
    "strMeasure13": "50g",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/nanaimo-bars",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53051",
    "strMeal": "Nasi lemak",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Malezya",
    "strInstructions": "Orta boy bir tencerede, orta ateşte hindistancevizi sütü, su, zencefil ezmesi, taze zencefil, tuz, defne yaprağı ve pirinci karıştırın. Kapağını kapatıp kaynamaya bırakın. Sıcaklık düşürülüp 20-30 dakika ya da pişene kadar kısık ateşte pişirin.\r\n\r\n Adım 2\r\nYumurtaları bir tencereye koyun ve üzerini soğuk su ile doldurun. Suyu kaynamaya bırakın, hemen ocaktan alın. Kapağını kapatın ve 10-12 dakika sıcak suda bekletin. Yumurtaları sudan çıkarın, soğutun, soyun ve ortadan ikiye kesin. Salatalığı dilimleyin.\r\n\r\n Adım 3\r\nBu arada, geniş bir tavada veya wokta, orta yüksek ateşte 1 su bardağı sıvı yağı ısıtın. Fıstıkları ekleyin ve hafifçe kahverengileşene kadar kısa süre pişirin. Fıstıkları delikli bir kepçe ile alın ve kağıt havluların üzerine koyarak fazla yağı emmesini sağlayın. Tavayı tekrar ocakta ısıtın. Bir paket hamsinin içeriğini ekleyin; kısa süre pişirin, karıştırarak, kıtır kıtır olana kadar pişirin. Delikli bir kepçe ile alın ve kağıt havluların üzerine koyun. Yağı dökün. Tavayı silin.\r\n\r\n Adım 4\r\nTavada 2 yemek kaşığı yağ ısıtın. Soğanı, sarımsağı ve arpacık soğanını ekleyin, 1-2 dakika kokusu çıkana kadar pişirin. Chilili karışımı ekleyin ve 10 dakika pişirin, ara sıra karıştırın. Eğer karışım kuru olursa, küçük bir miktar su ekleyin. Kalan hamsiyi ekleyin ve 5 dakika pişirin. Tuz, şeker ve asidik meyve suyu ekleyin; sos koyulaşana kadar 5 dakika pişirin.\r\n\r\n Adım 5\r\nSıcak pilavın üzerine soğan ve sarımsak sosunu dökün, üzerine fıstık, kızarmış hamsi, salatalık ve yumurta ekleyerek servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=IUIs4C86Ilo",
    "strIngredient1": "Hindistancevizi Sütü",
    "strIngredient2": "Su",
    "strIngredient3": "Zencefil Ezmesi",
    "strIngredient4": "Zencefil",
    "strIngredient5": "Defne Yaprağı",
    "strIngredient6": "Pirinç",
    "strIngredient7": "Yumurtalar",
    "strIngredient8": "Salatalık",
    "strIngredient9": "Fıstık",
    "strIngredient10": "Hamsi Filetosu",
    "strIngredient11": "Sıvı Yağ",
    "strIngredient12": "Soğan",
    "strIngredient13": "Sarımsak",
    "strIngredient14": "Arpacık Soğanı",
    "strIngredient15": "Acı Biber Tozu",
    "strIngredient16": "Hamsi Filetosu",
    "strIngredient17": "Şeker",
    "strIngredient18": "Asidik Meyve Püresi",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 su bardağı",
    "strMeasure2": "2 su bardağı",
    "strMeasure3": "1/4 çay kaşığı",
    "strMeasure4": "1",
    "strMeasure5": "1",
    "strMeasure6": "2 su bardağı",
    "strMeasure7": "4",
    "strMeasure8": "1",
    "strMeasure9": "1 su bardağı",
    "strMeasure10": "4 oz",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "1",
    "strMeasure13": "3 diş",
    "strMeasure14": "3",
    "strMeasure15": "2 çay kaşığı",
    "strMeasure16": "4 oz",
    "strMeasure17": "3 yemek kaşığı",
    "strMeasure18": "1/3 su bardağı",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.allrecipes.com/recipe/78938/malaysian-nasi-lemak/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52810",
    "strMeal": "Osso Buco alla Milanese",
    "strDrinkAlternate": null,
    "strCategory": "Çeşitli",
    "strArea": "İtalyan",
    "strInstructions": "Fırını 150 dereceye ısıtın.\r\nŞankları unla bulama: Unu geniş bir tabağa dökün (bir turta tabağı iyi olur). Şankları tuz ve karabiberle her iki tarafını da iyice baharatlayın. Şankları tek tek una bulayıp fazla unu silkeleyin ve tabağa geri koyun.\r\nŞankları kızartma: Bir geniş dutch oven veya ağır bir pişirme tenceresinde, 1 yemek kaşığı tereyağını ve sıvı yağı orta-yüksek ateşte ısıtın. Yağ sıçramaya başladığında şankları ekleyin ve her iki tarafını 5 dakika kadar kızartın. Tüm şanklar sığmıyorsa, onları grup halinde kızartabilirsiniz. Yağ yanarsa, ateşi biraz kısın. Şankları büyük bir tabağa alın ve kenara koyun.\r\nAromatikler: Tencereye fazla yağı boşaltın ve yakalanmış yağ parçalarını silin. 2 yemek kaşığı tereyağını tencereye ekleyin ve orta ateşte eritin. Yağ köpürmeyi durdurduğunda, soğanı, havucu, kerevizi ve rezene ekleyin. Tuz ve karabiberle tatlandırın, karıştırarak 6 dakika kadar pişirin. Ardından sarımsak, portakal kabuğu, kekik ve defne yaprağını ekleyin ve 1-2 dakika daha pişirin.\r\nBrahma sıvısı: Şarap ekleyin, ateşi yüksek yapın ve kaynamaya bırakın. Şarabı yaklaşık yarıya kadar buharlaştırın, 5 dakika kadar kaynatın. Stok ve domatesi suyu ile ekleyin, kaynamaya devam ederek sıvıyı 1 su bardağına kadar indirin, yaklaşık 10 dakika.\r\nBrahma: Şankları tencereye yerleştirin ve kemik kısmı yukarı bakacak şekilde, üzerine biriken tüm suyu da dökün. Üzerine yağlı kağıt koyun ve kenarlarını katlayın. Üstünü iyice kapatıp, fırına verin. İlk 15 dakikada karışımın çok kaynamadığından emin olun. 40 dakikadan sonra şankları çevirin ve suyu üzerine dökün, yaklaşık 2 saat boyunca pişirin.\r\nGremolata: Şanklar pişerken, sarımsak, maydanoz ve limon kabuğunu küçük bir kasede karıştırın. Sıkıca kapatın ve soğuk bir yerde saklayın.\r\nBitirme: Şanklar kemikten düşecek şekilde yumuşadıysa, fırından çıkarın ve üzerine gremolatın yarısını serpin. Şankları yeniden fırına verin ve 15 dakika daha pişirin.\r\nSosu hazırlama: Tencereye bakın, eğer üstünde yağ tabakası varsa, onu bir kepçe ile alın. Sosu kontrol edin ve eğer çok zayıfsa, kaynar ateşte 5-10 dakika kaynatın. Sosu tatlandırmak için gremolat ekleyebilirsiniz.\r\nŞankları paylaştırma: Eğer şanklar büyükse, birini başına bir porsiyon olarak servis edin. Yavaşça dağılacaksa, daha küçük parçalara ayırarak servis yapın.\r\nServis: Şankları sıcak tabaklarda servis yapın ve risotto ile birlikte sunun. Gremolatanın geri kalanını serpin ve üstüne bolca sos ekleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wwuqvt1487345467.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=9GUTC2Qwrf0",
    "strIngredient1": "Dana Eti",
    "strIngredient2": "Un",
    "strIngredient3": "Zeytinyağı",
    "strIngredient4": "Tereyağı",
    "strIngredient5": "Soğan",
    "strIngredient6": "Havuç",
    "strIngredient7": "Kereviz",
    "strIngredient8": "Rezene",
    "strIngredient9": "Sarımsak",
    "strIngredient10": "Portakal Kabuğu",
    "strIngredient11": "Kekik",
    "strIngredient12": "Defne Yaprağı",
    "strIngredient13": "Kuru Beyaz Şarap",
    "strIngredient14": "Tavuk Suyu",
    "strIngredient15": "Domates",
    "strIngredient16": "Maydanoz",
    "strIngredient17": "Sarımsak",
    "strIngredient18": "Limon Kabuğu",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "4 etli şank",
    "strMeasure2": "½ su bardağı",
    "strMeasure3": "2 yemek kaşığı",
    "strMeasure4": "3 yemek kaşığı",
    "strMeasure5": "1 orta boy doğranmış",
    "strMeasure6": "1 doğranmış",
    "strMeasure7": "1 doğranmış",
    "strMeasure8": "1 baş doğranmış",
    "strMeasure9": "3 diş",
    "strMeasure10": "2 şerit",
    "strMeasure11": "1 ½ çay kaşığı",
    "strMeasure12": "1",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": "½ su bardağı",
    "strMeasure15": "1 su bardağı doğranmış ve suyu",
    "strMeasure16": "2 yemek kaşığı doğranmış",
    "strMeasure17": "1 tatlı kaşığı doğranmış",
    "strMeasure18": "1 tatlı kaşığı rendelenmiş",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.cookstr.com/Meat/Osso-Buco-alla-Milanese",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52943",
    "strMeal": "Oxtail with broad beans",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Jamaika",
    "strInstructions": "Oxtail'i soğan, taze soğan, sarımsak, zencefil, acı biber, soya sosu, kekik, tuz ve karabiberle karıştırın. Sıvı yağı büyük bir tavada orta yüksek ateşte ısıtın. Oxtail'i tavada her tarafı kahverengileşene kadar 10 dakika kadar pişirin. Sonra bir düdüklü tencereye koyun ve 375 ml su ekleyin. 25 dakika basınçta pişirin, sonra ısıyı kesip, üretici talimatlarına göre kapağını açın.\r\nFasulye ve pimento tanelerini ekleyin ve orta yüksek ateşte kaynamaya bırakın. Mısır nişastasını 2 yemek kaşığı suyla çözüp, kaynayan oxtail'in içine karıştırın. Sos koyulaşana kadar  birkaç dakika pişirin ve fasulyeler yumuşayana kadar pişirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1520083578.jpg",
    "strTags": "Ağır,Ana Yemek,Özel",
    "strYoutube": "https://www.youtube.com/watch?v=DIhxk-98Hz8",
    "strIngredient1": "Oxtail",
    "strIngredient2": "Soğan",
    "strIngredient3": "Taze Soğanlar",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Zencefil",
    "strIngredient6": "Scotch Bonnet",
    "strIngredient7": "Soya Sosu",
    "strIngredient8": "Taze Kekik",
    "strIngredient9": "Sıvı Yağ",
    "strIngredient10": "Su",
    "strIngredient11": "Fasulye",
    "strIngredient12": "Mısır Nişastası",
    "strIngredient13": "Su",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "450g",
    "strMeasure2": "1 doğranmış",
    "strMeasure3": "1",
    "strMeasure4": "2 diş doğranmış",
    "strMeasure5": "1 çay kaşığı",
    "strMeasure6": "1 doğranmış",
    "strMeasure7": "2 yemek kaşığı",
    "strMeasure8": "1 doğranmış",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "350 ml",
    "strMeasure11": "200g",
    "strMeasure12": "1 yemek kaşığı",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "http://allrecipes.co.uk/recipe/5392/jamaican-oxtail-with-broad-beans.aspx",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52837",
    "strMeal": "Pilchard Puttanesca",
    "strCategory": "Makarna",
    "strArea": "İtalyan",
    "strInstructions": "Makarnayı paketin talimatlarına göre haşlayın. Bir tavada zeytinyağını ısıtın, soğanı, sarımsağı ve biberi 3-4 dakika soteleyin. Domates salçasını ekleyip 1 dakika pişirin, ardından pilchard'ları sosuyla birlikte ekleyin. Balıkları bir tahta kaşıkla parçalayarak pişirin, sonra zeytinleri ekleyip birkaç dakika daha pişirin. Makarnayı süzüp tavaya ekleyin ve 2-3 yemek kaşığı pişirme suyunu ekleyin. Her şeyi iyice karıştırın, sonra tabaklara koyun ve üzerine Parmesan serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vvtvtr1511180578.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=wqZzLAPmr9k",
    "strIngredient1": "Makarna",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Kırmızı Biber",
    "strIngredient6": "Domates Salçası",
    "strIngredient7": "Pilchard (balina balığı)",
    "strIngredient8": "Siyah Zeytin",
    "strIngredient9": "Parmesan",
    "strMeasure1": "300g",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "1 ince doğranmış",
    "strMeasure4": "2 diş ezilmiş",
    "strMeasure5": "1",
    "strMeasure6": "1 yemek kaşığı",
    "strMeasure7": "425g",
    "strMeasure8": "70g",
    "strMeasure9": "Rendelenmiş",
    "strSource": "https://www.bbcgoodfood.com/recipes/pilchard-puttanesca"
  },
  {
    "idMeal": "52847",
    "strMeal": "Pork Cassoulet",
    "strCategory": "Domuz Eti",
    "strArea": "Fransız",
    "strInstructions": "Fırını 140C/120C fan/gaz 1'e ısıtın. Büyük bir fırın tepsisini yüksek ateşte ısıtın. Yağı ve doğranmış eti ekleyin, kenarları mühürlemek için birkaç dakika pişirin, eşit şekilde pişirmek için karıştırın. Ateşi kısın, doğranmış soğanı, bütün sarımsak dişlerini, havucu ve rezene tohumlarını ekleyin ve sebzeler yumuşayana kadar birkaç dakika pişirin. Kızılcık sirkesini ekleyin, tavada kalan et parçalarını kazıyın. Stok, domates salçası ve yarım taze kekik ve maydanozu ekleyin. Kaynamaya bırakın, 10 dakika kaynatın, sonra tuzlayın, üzerini kapatın ve fırına 2 saat koyun, son 1 saatte kapağı açın. Ara ara karıştırın ve 30 dakika kala fasulyeleri ekleyin. Fırından çıkarın ve ızgarayı ısıtın. Üzerine kalan otları ve ekmek kırıntılarını serpin, üzerine biraz yağ gezdirin ve 5-10 dakika kadar tekrar fırına koyun, ekmek kırıntıları altın rengi olana kadar pişirin. Yanında ekmek ve yeşil sebzelerle servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wxuvuv1511299147.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=MEdHMTD0VCA",
    "strIngredient1": "Kaz Yağı",
    "strIngredient2": "Domuz Eti",
    "strIngredient3": "Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Havuç",
    "strIngredient6": "Rezene Tohumu",
    "strIngredient7": "Kızılcık Sirkesi",
    "strIngredient8": "Sebze Suyu",
    "strIngredient9": "Domates Salçası",
    "strIngredient10": "Kekik",
    "strIngredient11": "Maydanoz",
    "strIngredient12": "Haricot Fasulyesi",
    "strIngredient13": "Ekmek Kırıntıları",
    "strIngredient14": "Yağ",
    "strIngredient15": "Ekmek",
    "strIngredient16": "Brokoli",
    "strMeasure1": "4 yemek kaşığı",
    "strMeasure2": "350g",
    "strMeasure3": "1 büyük",
    "strMeasure4": "10 diş",
    "strMeasure5": "1 ince dilimlenmiş",
    "strMeasure6": "1 tatlı kaşığı",
    "strMeasure7": "2 yemek kaşığı",
    "strMeasure8": "600ml",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "2 dal",
    "strMeasure11": "Bir avuç",
    "strMeasure12": "400g",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "süslemek için",
    "strMeasure15": "servis için",
    "strMeasure16": "servis için",
    "strSource": "https://www.bbcgoodfood.com/recipes/jacks-pork-cassoulet"
  },
  {
    "idMeal": "52857",
    "strMeal": "Balkabağı Turtası",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Balkabağını büyük bir tencereye koyun, su ile örtün ve kaynamaya bırakın. Üstünü kapatın ve 15 dakika veya yumuşayana kadar kısık ateşte pişirin. Balkabağını süzün ve soğumaya bırakın.\nFırını 180C/160C fan/gaz 4'e ısıtın. Hamuru hafif unlanmış bir yüzeyde açın ve 22 cm'lik kelepçeli tart kalıbına yerleştirin. 15 dakika soğutun. Hamurun üzerine pişirme kağıdı ve pişirme boncuklarını koyun, ardından 15 dakika pişirin. Boncukları ve kağıdı çıkarın, tabanı soluk altın rengi ve bisküvi kıvamına gelene kadar 10 dakika daha pişirin. Fırından çıkarın ve hafifçe soğumaya bırakın.\nFırını 220C/200C fan/gaz 7'ye ısıtın. Soğuyan balkabağını bir süzgeçten geçirerek bir kaba alın. Ayrı bir kasede şekeri, tuzu, muskatı ve tarçının yarısını karıştırın. Yumurta, eritilmiş tereyağı ve sütü ekleyin, ardından bu karışımı balkabağı püresine ilave edin ve karıştırın. Karışımı tart hamurunun üzerine dökün ve 10 dakika pişirin, ardından sıcaklığı 180C/160C fan/gaz 4'e düşürün. 35-40 dakika daha pişirin, doldurma tamamen katılaşana kadar.\nSoğumaya bırakın, ardından turta kalıptan çıkarın. Kalan tarçın ve pudra şekerini karıştırın ve turta üzerine serpin. Soğutulmuş olarak servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg",
    "strTags": "Cadılar Bayramı,Tart,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=hpapqEeb36k",
    "strIngredient1": "Balkabağı",
    "strIngredient2": "Kısa Hamur",
    "strIngredient3": "Un",
    "strIngredient4": "Toz Şeker",
    "strIngredient5": "Tuz",
    "strIngredient6": "Muskat",
    "strIngredient7": "Tarçın",
    "strIngredient8": "Yumurtalar",
    "strIngredient9": "Tereyağı",
    "strIngredient10": "Süt",
    "strIngredient11": "Pudra Şekeri",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "750g",
    "strMeasure2": "350g",
    "strMeasure3": "Serpiştirme",
    "strMeasure4": "140g",
    "strMeasure5": "½ çay kaşığı",
    "strMeasure6": "½ çay kaşığı",
    "strMeasure7": "1 tatlı kaşığı",
    "strMeasure8": "2 Yumurta, çırpılmış",
    "strMeasure9": "25g",
    "strMeasure10": "175g",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1742633/pumpkin-pie",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52861",
    "strMeal": "Fıstıklı Peynirli Kek",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "20 cm çapında kelepçeli kek kalıbını yağlayın ve streç filmle kaplayın, mümkün olduğunca düzgün yapmaya çalışın. Tereyağını bir tavada eritin. Bisküvileri bir torbada merdaneyle eziyet ederek ezin, sonra tereyağına karıştırarak iyice kaplanmasını sağlayın. Karışımı kalıbın tabanına sıkıca bastırın ve soğutun.\nJelatini suda bekletin, dolgu karışımını hazırlarken. Ricotta peynirini bir kaba alın, ardından fıstık ezmesi ve şurubu karıştırın. Ricotta biraz tane tane bir dokuya sahip olduğundan, daha pürüzsüz bir doku için bir el blenderi ile karıştırabilirsiniz.\nSuda bekleyen jelatini çıkarın ve suyunu sıkın. Bir tavada sütle birlikte eritin, jelatin tamamen çözülene kadar ısınmasına izin verin. Fıstıklı karışıma karıştırın, ardından bisküvi tabanının üzerine dökün. Soğuyana kadar buzdolabında bekletin.\nDondurmak için, kekin üzerinde streç film kaplayın ve kalıbı streç film ve folyo ile sarın.\nÇözüldükten sonra buzdolabında bir gece bekletin.\nServis yapmadan önce dikkatlice kalıptan çıkarın. Kremayı şekerle çırpın ve cheesecake'in üstüne sürün, üzerine fıstıklı kırıntılar serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=QSTsturcyL0",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Fıstık Ezmeli Kurabiyeler",
    "strIngredient3": "Jelatin Yaprakları",
    "strIngredient4": "Ricotta Peyniri",
    "strIngredient5": "Fıstık Ezmesi",
    "strIngredient6": "Altın Şurup",
    "strIngredient7": "Süt",
    "strIngredient8": "Çift Sütlü Krema",
    "strIngredient9": "Açık Kahverengi Şeker",
    "strIngredient10": "Fıstıklı Kırıntılar",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "175g",
    "strMeasure3": "5 yaprak",
    "strMeasure4": "500g",
    "strMeasure5": "175g",
    "strMeasure6": "175g",
    "strMeasure7": "150ml",
    "strMeasure8": "275ml",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "Kırılmış",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1759649/peanut-butter-cheesecake",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52862",
    "strMeal": "Şeftali ve Yaban Mersini Grunt",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Fırını 190C/170C fan/gaz 5'e ısıtın. Geniş, sığ bir fırın kabını tereyağı ile yağlayın. Mısır nişastasını portakal kabuğu rendesi ve suyu ile karıştırın, sonra büyük bir tavaya koyun. Şeftalileri yarıya bölün, çekirdeklerini çıkarın ve dilimleyin, sonra tavanın içine ekleyin. Yavaşça kaynamaya bırakın, sos parlak ve koyulaşana kadar, yaklaşık 3-4 dakika karıştırarak pişirin. Ocağı kapatın, yaban mersinlerini ekleyin ve hazırladığınız kaba dökün.\nUnu bir karıştırma kabına koyun ve 50g tereyağını ekleyin. Tereyağını una yedirene kadar karıştırın, ardından şekerin yarısını ekleyin. Kalan şekeri tarçınla karıştırın ve kenara ayırın.\nSütü kuru karışıma ekleyin ve yumuşak bir hamur elde edene kadar karıştırın. Hafifçe unlanmış bir yüzeye dökün ve kısa bir süre yoğurun. 16 x 24 cm boyutlarında bir dikdörtgen şeklinde açın. Üzerine eritilmiş tereyağı sürün ve tarçınlı şekeri eşit şekilde serpin. Uzun kenardan yuvarlayın ve 12 dilime kesin. Bunları fırın kabının üzerine, ortası açık olacak şekilde yerleştirin.\n20-25 dakika pişirin, üstü çıtır ve altın rengini alana kadar. Sıcak servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ssxvup1511387476.jpg",
    "strTags": "Tatlı,Puding,Meyveli",
    "strYoutube": "https://www.youtube.com/watch?v=SNeO28BCpsc",
    "strIngredient1": "Mısır Nişastası",
    "strIngredient2": "Portakal",
    "strIngredient3": "Portakal Kabuğu",
    "strIngredient4": "Toz Şeker",
    "strIngredient5": "Şeftali",
    "strIngredient6": "Yaban Mersini",
    "strIngredient7": "Kabartma Unu",
    "strIngredient8": "Tereyağı",
    "strIngredient9": "Esmer Şeker",
    "strIngredient10": "Tarçın",
    "strIngredient11": "Süt",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 tatlı kaşığı",
    "strMeasure2": "2 portakalın suyu",
    "strMeasure3": "1 portakalın kabuğu",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "6 şeftali",
    "strMeasure6": "250g",
    "strMeasure7": "200g",
    "strMeasure8": "50g",
    "strMeasure9": "100g",
    "strMeasure10": "1 tatlı kaşığı",
    "strMeasure11": "6 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1553651/peach-and-blueberry-grunt",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52922",
    "strMeal": "Karides ve Rezene Biski",
    "strDrinkAlternate": null,
    "strCategory": "Yan Yemek",
    "strArea": "Fransız",
    "strInstructions": "Karidesleri soyun, ardından kabukları büyük bir tavada yaklaşık 5 dakika boyunca yağda kızartın. Soğanı, rezene ve havuçları ekleyin ve sebzeler yumuşamaya başlayana kadar yaklaşık 10 dakika pişirin. Şarap ve brendi ekleyin, alkolün uçması için yaklaşık 1 dakika kaynatın, ardından domatesleri, et suyunu ve paprika ekleyin. Kapağını kapatıp 30 dakika kaynamaya bırakın. Bu arada karidesleri doğrayın.\r\nÇorbayı bir çubuk mikseri veya mutfak robotu ile olabildiğince ince bir şekilde pürüzsüz hale getirin, ardından bir süzgeçten geçirin. Süreç boyunca karışımı süzgeçten iyice geçirerek çorbaya kadifemsi bir doku kazandırın.\r\nTemiz bir tencereye geri dökün, karidesleri ekleyin ve 10 dakika pişirin, sonra tekrar pürüzsüz hale gelene kadar çırpın. Bu çorbayı bir gün önceden hazırlayıp soğutabilir veya 1 ay boyunca dondurabilirsiniz. Gece boyunca buzdolabında çözdürün. Servis yaparken, bir tavada kremayla nazikçe ısıtın. Süslemek isterseniz, 8 karidesi biraz tereyağında pişirin. Küçük kaselere koyun ve karidesler ve doğranmış rezene dallarıyla süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg",
    "strTags": "Çorba, Sıcak, Deniz Ürünleri, Kabuklu Deniz Ürünleri",
    "strYoutube": "https://www.youtube.com/watch?v=4thpMbDakgM",
    "strIngredient1": "Kaplan Karidesleri",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Soğan",
    "strIngredient4": "Rezene",
    "strIngredient5": "Havuç",
    "strIngredient6": "Kuru Beyaz Şarap",
    "strIngredient7": "Brendi",
    "strIngredient8": "Doğranmış Domates",
    "strIngredient9": "Balık Suyu",
    "strIngredient10": "Paprika",
    "strIngredient11": "Sıvı Krema",
    "strIngredient12": "Karides",
    "strIngredient13": "",
    "strMeasure1": "450g",
    "strMeasure2": "4 yemek kaşığı",
    "strMeasure3": "1 büyük",
    "strMeasure4": "1 büyük",
    "strMeasure5": "2 doğranmış",
    "strMeasure6": "150ml",
    "strMeasure7": "1 yemek kaşığı",
    "strMeasure8": "400g",
    "strMeasure9": "1L",
    "strMeasure10": "2 tutam",
    "strMeasure11": "150ml",
    "strMeasure12": "8",
    "strSource": "https://www.bbcgoodfood.com/recipes/71600/prawn-and-fennel-bisque",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52930",
    "strMeal": "Pate Chinois",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Etli",
    "strArea": "Kanada",
    "strInstructions": "Büyük bir tuzlu suda patatesleri çok yumuşayana kadar pişirin. Süzün.\r\nBir ezici ile, patatesleri en az 30 ml (2 yemek kaşığı) tereyağı ile iri şekilde ezin. Elektrikli bir mikserle sütle püre haline getirin. Tuz ve karabiber ile tatlandırın. Bir kenara koyun.\r\nFırın rafını ortada olacak şekilde yerleştirin ve fırını 190 °C (375 °F) ısıtın.\r\nBüyük bir tavada, kalan tereyağında soğanı kavurun. Kıymayı ekleyin ve altın rengini alana kadar pişirin. Tuz ve karabiber ile tatlandırın. Ocaktan alın.\r\nKıymayı 20 cm (8 inç) kare bir fırın kabının altına hafifçe bastırarak yerleştirin. Üzerine mısır ve ezilmiş patatesleri ekleyin. Paprika ve maydanoz ile serpin.\r\nYaklaşık 30 dakika pişirin. Sonra broilerda pişirmeye devam edin. 10 dakika soğumaya bırakın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yyrrxr1511816289.jpg",
    "strTags": "Ana Yemek, Alkol İçeren",
    "strYoutube": "https://www.youtube.com/watch?v=QRFqnLkEv3I",
    "strIngredient1": "Patatesler",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Süt",
    "strIngredient4": "Kıyma",
    "strIngredient5": "Soğan",
    "strIngredient6": "Kremalı Mısır",
    "strIngredient7": "Paprika",
    "strIngredient8": "Maydanoz",
    "strIngredient9": "Tuz",
    "strIngredient10": "Karabiber",
    "strMeasure1": "4 su bardağı",
    "strMeasure2": "60ml",
    "strMeasure3": "½ su bardağı",
    "strMeasure4": "450g",
    "strMeasure5": "1 ince doğranmış",
    "strMeasure6": "500ml",
    "strMeasure7": "isteğe göre",
    "strMeasure8": "isteğe göre",
    "strMeasure9": "Bir tutam",
    "strMeasure10": "Bir tutam",
    "strSource": "https://www.ricardocuisine.com/en/recipes/5541-pate-chinois-shepherd--s-pie-",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52932",
    "strMeal": "Pouding Chomeur",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Kanada",
    "strInstructions": "Büyük bir kasede, elektrikli mikserle tereyağını ve şekeri iyice karıştırın.\r\nYumurtaları ve vanilyayı ekleyin ve karıştırın.\r\nBaşka bir kasede un ve kabartma tozunu karıştırın.\r\nUn karışımını ve sütü, tereyağlı karışıma sırayla ekleyin.\r\nYağlanmış 13x9 inçlik bir tepsiye dökün.\r\nMAPLE SOS.\r\nBüyük bir tencerede, şurup, esmer şeker, krema ve tereyağını kaynatın ve sürekli karıştırın.\r\nIsıyı azaltın ve sos biraz azalana kadar 2 dakika nazikçe pişirin.\r\nSosu kekin üzerine nazikçe dökün.\r\n325°F (160°C) sıcaklıkta yaklaşık 35 dakika pişirin ya da kek altın rengi olana kadar pişirin ve kürdanı batırdığınızda temiz çıkana kadar.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg",
    "strTags": "Puding",
    "strYoutube": "https://www.youtube.com/watch?v=WFvj71RZYPc",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Şeker",
    "strIngredient3": "Yumurtalar",
    "strIngredient4": "Vanilya Özütü",
    "strIngredient5": "Un",
    "strIngredient6": "Kabartma Tozu",
    "strIngredient7": "Süt",
    "strIngredient8": "Akçaağaç Şurubu",
    "strIngredient9": "Esmer Şeker",
    "strIngredient10": "Tekli Krema",
    "strIngredient11": "Tereyağı",
    "strMeasure1": "½ su bardağı",
    "strMeasure2": "1 su bardağı",
    "strMeasure3": "2",
    "strMeasure4": "1 çay kaşığı",
    "strMeasure5": "2 su bardağı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "1 ¼ su bardağı",
    "strMeasure8": "1 ½ su bardağı",
    "strMeasure9": "1 ½ su bardağı",
    "strMeasure10": "1 ½ su bardağı",
    "strMeasure11": "1/3 su bardağı",
    "strSource": "http://www.geniuskitchen.com/recipe/pouding-chomeur-poor-mans-pudding-with-maple-syrup-sauce-218797",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  }
]
