[
  {
    "idMeal": "53049",
    "strMeal": "Apam balik",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Malaysian",
    "strInstructions": "Süt, yağ ve yumurtayı karıştırın. Unu, kabartma tozunu ve tuzu karışıma eleyin. Tüm malzemeler eşit şekilde birleşene kadar iyice karıştırın.\r\n\r\nTavaya biraz hamur yayın. Tavanın kenarına ince bir hamur tabakası yayın. Küçük hava kabarcıkları görünene kadar tavayı 30-60 saniye örtün.\r\n\r\nTereyağı, krema mısır, ezilmiş fıstık ve şekeri krepin üzerine ekleyin. Alt yüzeyi kızardığında krepi ikiye katlayın.\r\n\r\nDilimlere kesin ve ılıkken yenmesi en iyisidir.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=6R8ffRRJcrg",
    "strIngredient1": "Süt",
    "strIngredient2": "Yağ",
    "strIngredient3": "Yumurta",
    "strIngredient4": "Un",
    "strIngredient5": "Kabartma Tozu",
    "strIngredient6": "Tuz",
    "strIngredient7": "Tuzsuz Tereyağı",
    "strIngredient8": "Şeker",
    "strIngredient9": "Fıstık Ezmesi",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "200ml",
    "strMeasure2": "60ml",
    "strMeasure3": "2",
    "strMeasure4": "1600g",
    "strMeasure5": "3 çay kaşığı",
    "strMeasure6": "1/2 çay kaşığı",
    "strMeasure7": "25g",
    "strMeasure8": "45g",
    "strMeasure9": "3 yemek kaşığı",
    "strMeasure10": " ",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.nyonyacooking.com/recipes/apam-balik~SJ5WuvsDf9WQ",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53050",
    "strMeal": "Ayam Percik",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Malaysian",
    "strInstructions": "Bir blender'da baharat ezmesi için malzemeleri ekleyin ve pürüzsüz olana kadar karıştırın.\r\nOrta ateşte baharat ezmesini bir tavaya veya tavaya dökün ve hoş bir koku gelene kadar 10 dakika kızartın. Macun çok kurursa her seferinde 1 yemek kaşığı su veya yağ ekleyin. Macunu yakmayın. Gerekirse ateşi biraz kısın.\r\nKaranfilleri, kakuleyi, demirhindi posasını, hindistan cevizi sütünü, suyu, şekeri ve tuzu ekleyin. Ateşi açın ve karışımı kaynatın. Ateşi orta kısığa getirin ve 10 dakika pişirin. Ara sıra karıştırın. Biraz azalacaktır. Bu marine sosu/sosudur, bu nedenle tadına bakın ve gerekirse baharatı ayarlayın Gerekli. Hafif acı olsa bile endişelenmeyin. Kızartırken geçecektir.\r\nMarinasyon/sos soğuduğunda, her şeyi tavuğun üzerine dökün ve bir gece ila iki gün marine edin.\r\nFırını 425 F'ye önceden ısıtın.\r\nTavukları marine soslarından çıkarın. Marine sosunu yağlanmış (veya alüminyum kaplı) bir fırın tepsisine dökün. Tavuğu sosun üzerine koyun (tavuğun sosu örttüğünden ve sosun açıkta olmadığından emin olun, aksi takdirde yanar) ve kalan marine sosunu tavuğun üzerine yayın. 35-45 dakika veya tavuğun en kalın kısmının iç sıcaklığı en az 175 F olana kadar kızartın.\r\nTavuğu 5 dakika dinlendirin. Tavuğu biraz yağla fırçalayın. Tavuğu sosla birlikte buharda pişirilmiş pilavın (veya Hindistan cevizi pilavının) üzerine servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=9ytR28QK6I8",
    "strIngredient1": "Tavuk Butları",
    "strIngredient2": "Çaylak Soğan",
    "strIngredient3": "Zencefil",
    "strIngredient4": "Sarımsak Dişi",
    "strIngredient5": "Acı Biber",
    "strIngredient6": "Zerdeçal",
    "strIngredient7": "Kimyon",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Rezene",
    "strIngredient10": "Tamarind Macunu",
    "strIngredient11": "Hindistan Cevizi Sütü",
    "strIngredient12": "Şeker",
    "strIngredient13": "Su",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "6",
    "strMeasure2": "16",
    "strMeasure3": "1 1/2",
    "strMeasure4": "6",
    "strMeasure5": "8",
    "strMeasure6": "2 yemek kaşığı",
    "strMeasure7": "1 1/2",
    "strMeasure8": "1 1/2",
    "strMeasure9": "1 1/2",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "1 kutu",
    "strMeasure12": "1 çay kaşığı",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "http://www.curiousnut.com/roasted-spiced-chicken-ayam-percik/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52873",
    "strMeal": "Dana Köfte Güveci",
    "strDrinkAlternate": null,
    "strCategory": "Dana",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 180C/350F/Gaz 4'e önceden ısıtın.\r\n\r\nDana güveci için, fırına dayanıklı bir güveçte yağı ve tereyağını ısıtın ve dana etini her tarafı kızarana kadar kızartın.\r\n\r\nUnun üzerine serpin ve 2-3 dakika daha pişirin.\r\n\r\nSarımsağı ve tüm sebzeleri ekleyin ve 1-2 dakika kızartın.\r\n\r\nŞarap, et suyu ve otları karıştırın, ardından Worcestershire sosu ve balzamik sirkeyi damak tadınıza göre ekleyin. Tuz ve taze çekilmiş siyah biber.\r\n\r\nKapağını kapatıp fırına koyun ve yaklaşık iki saat veya et yumuşayana kadar pişirin.\r\n\r\nKöfteler için unu, kabartma tozunu ve tuzu bir kaseye eleyin.\r\nYağı ve kalın bir hamur elde edene kadar yeterli suyu ekleyin.\r\n\r\nUnlanmış ellerle hamurdan kaşık kaşık küçük toplar yapın.\r\n\r\nİki saat sonra güveçten kapağı çıkarın ve topları güvecin üzerine yerleştirin. Üzerini kapatın, fırına geri koyun ve 20 dakika daha veya köfteler şişip yumuşayana kadar pişirin. (Köftelerinizin üstünün altın rengi olmasını istiyorsanız fırına geri koyarken kapağı açık bırakın.)\r\n\r\nServis etmek için dört servis tabağının her birine bir kaşık patates püresi koyun ve güveç ve köftelerle üstünü kapatın. Üzerine kıyılmış maydanoz serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg",
    "strTags": "Güveç,Pişirme",
    "strYoutube": "https://www.youtube.com/watch?v=6NgheY-r5t0",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Sığır Eti",
    "strIngredient4": "Sade Un",
    "strIngredient5": "Sarımsak",
    "strIngredient6": "Soğan",
    "strIngredient7": "Kereviz",
    "strIngredient8": "Havuç",
    "strIngredient9": "Pırasa",
    "strIngredient10": "İsveç",
    "strIngredient11": "Kırmızı Şarap",
    "strIngredient12": "Sığır Suyu",
    "strIngredient13": "Defne Yaprağı",
    "strIngredient14": "Kekik",
    "strIngredient15": "Maydanoz",
    "strIngredient16": "Düz Un",
    "strIngredient17": "Kabartma Tozu",
    "strIngredient18": "Suet",
    "strIngredient19": "Su",
    "strIngredient20": null,
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "25g",
    "strMeasure3": "750g",
    "strMeasure4": "2 yemek kaşığı ",
    "strMeasure5": "2 diş kıyılmış",
    "strMeasure6": "175g",
    "strMeasure7": "150g",
    "strMeasure8": "150g",
    "strMeasure9": "2 doğranmış",
    "strMeasure10": "200g",
    "strMeasure11": "150ml",
    "strMeasure12": "500g",
    "strMeasure13": "2",
    "strMeasure14": "3 yemek kaşığı",
    "strMeasure15": "3 yemek kaşığı doğranmış",
    "strMeasure16": "125g",
    "strMeasure17": "1 çay kaşığı ",
    "strMeasure18": "60g",
    "strMeasure19": "Sıçrama",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/beefstewwithdumpling_87333",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52891",
    "strMeal": "Blackberry Fool",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Bisküviler için fırını 200C/180C (fan)/Gaz 6'ya önceden ısıtın ve iki büyük fırın tepsisini pişirme kağıdıyla kaplayın. Fındıkları bir fırın tepsisine dağıtın ve fırında 6-8 dakika veya kızarana kadar kızartın. Yanma şansları olmaması için dikkatlice izleyin. Fırından çıkarın, bir tahtaya dökün ve soğumaya bırakın.\r\nTereyağı ve şekeri büyük bir kaseye koyun ve tahta bir kaşıkla açık renk ve krema kıvamına gelene kadar çırpın. Soğuyan fındıkları iri kıyın ve krema kıvamına gelene kadar tereyağı ve şekere, limon kabuğu rendesi, un ve kabartma tozuyla birlikte ekleyin. Karışım bir araya gelip bir top oluşturur – ellerinizi kullanmanız gerekebilir.\r\nBisküvi hamurunu 24 eşit parçaya bölün ve küçük toplar haline getirin. Topları, yayılmalarına izin verecek şekilde aralıklı olarak hazırlanmış fırın tepsilerine yerleştirin.\r\nBisküvileri yaklaşık 1 cm/½ inç kalınlığında düzleştirmek için bastırın. Bisküvileri, her seferinde bir tepsi olmak üzere, 12 dakika veya çok soluk altın-kahverengi olana kadar pişirin. Tepside soğumaya bırakın. Fırından çıkardığınızda çok yumuşak olacaklar, ancak soğudukça çıtır çıtır olacaklar.\r\nHava geçirmez bir tenekede saklayın ve beş gün içinde yiyin.\r İçin, böğürtlenleri bir süzgeçte yıkayarak toz veya kiri temizleyin. Böğürtlenleri yapışmaz bir tencereye koyun ve üzerine pudra şekeri serpin.\r\nLimon suyunu karıştırın ve böğürtlenler yumuşamaya ve suyunu bırakmaya başlayana kadar iki dakika boyunca hafifçe ısıtın. 12 böğürtleni süsleme için ayırın ve geri kalanını pişirmeye devam edin.\r\nBöğürtlenleri çok yumuşak ve yumuşak olana kadar düzenli olarak karıştırarak 15 dakika boyunca çok kısık ateşte pişirin. Ateşten alın ve meyveleri ve suyunu bir kase üzerinde bir elekten geçirin, kepçenin altını kullanarak mümkün olduğunca fazla püreyi çıkarın. Püreyi soğumaya bırakın ve çekirdeklerini atın. Yaklaşık 325 ml/11 fl oz püre elde etmelisiniz.\r\nKremayı ve yoğurdu büyük bir kaseye koyun ve çırpıcı kaseden çıkarıldığında yumuşak tepecikler oluşana kadar elektrikli çırpıcıyla çırpın - meyvenin asiditesi kremayı daha da koyulaştıracaktır, bu yüzden çok ileri götürmeyin.\r\nPüre tamamen soğuduğunda, gerekirse daha fazla şeker ekleyerek tatlılığını damak tadınıza göre ayarlayın. Çırpılmış krema ve yoğurtla birlikte kaseye dökün ve çok hafifçe birleşene kadar sadece bir veya iki kez karıştırın.\r\nBöğürtlenli keki geniş, cam tabaklara veya tek bir büyük, tek kaseye kaşıkla koyun. Oldukça mermer gibi görünmelidir, bu yüzden fazla karıştırmayın. Üzerine birkaç küçük nane yaprağı serpin ve ayırdığınız böğürtlenlerle süsleyin. İsterseniz biraz şeker serpin ve fındıklı bisküvilerle servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg",
    "strTags": "Çöl,Yaz,Meyveli,Süt",
    "strYoutube": "https://www.youtube.com/watch?v=kniRGjDLFrQ",
    "strIngredient1": "Fındık",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Pudra Şekeri",
    "strIngredient4": "Limon",
    "strIngredient5": "Düz Un",
    "strIngredient6": "Kabartma Tozu",
    "strIngredient7": "Blackberrys",
    "strIngredient8": "Şeker",
    "strIngredient9": "Toz Şeker",
    "strIngredient10": "Limon Suyu",
    "strIngredient11": "Çift Krema",
    "strIngredient12": "Yoğurt",
    "strIngredient13": "Nane",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "125g",
    "strMeasure3": "150g",
    "strMeasure4": "Rendelenmiş",
    "strMeasure5": "150g",
    "strMeasure6": "½ çay kaşığı",
    "strMeasure7": "600g",
    "strMeasure8": "75g",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "300ml ",
    "strMeasure12": "100ml",
    "strMeasure13": "Şununla süsleyin",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/blackberry_fool_with_11859",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52904",
    "strMeal": "Sığır Bourguignon",
    "strDrinkAlternate": null,
    "strCategory": "Sığır",
    "strArea": "Fransız",
    "strInstructions": "Büyük bir güveç tavasını ısıtın ve 1 yemek kaşığı kaz yağı ekleyin. Eti baharatlayın ve altın rengi kahverengi olana kadar yaklaşık 3-5 dakika kızartın, sonra çevirin ve etin her tarafı kızarana kadar diğer tarafını kızartın, gerekirse daha fazla yağ ekleyin. Bunu 2-3 parti halinde yapın, kızardığında eti bir kase üzerine yerleştirilmiş bir süzgece aktarın.\r\nAynı tavada pastırmayı, arpacık soğanını veya inci soğanını, mantarı, sarımsağı ve buket garniyi hafifçe kızarana kadar kızartın. Domates püresini ekleyin ve karışıma karıştırarak birkaç dakika pişirin. Bu, bourguignon'u zenginleştirir ve güveç. Sonra eti ve süzülmüş suyu tavaya geri koyun ve karıştırın.\r\nEt sıvıdan sıçrayacak ancak tamamen kaplanmayacak şekilde şarap ve yaklaşık 100 ml su dökün. Kaynatın ve bir kaşık kullanarak karamelize olmuş pişirme suyunu tavanın dibinden kazıyın - bu güvece daha fazla lezzet katacaktır.\r\nFırını 150C/fan 130C/gaz 2'ye ısıtın. Bir kartuş yapın: güveçten biraz daha büyük bir folyo karesi koparın, güvecin üstünü kaplayacak şekilde tavaya yerleştirin ve fazla folyoyu kesin. Sonra 3 saat pişirin. Sos sulu görünüyorsa, eti ve sebzeleri delikli bir kaşıkla çıkarın ve bir kenara koyun. Sos biraz koyulaşana kadar sosu yüksek ateşte birkaç dakika pişirin, ardından eti ve sebzeleri tavaya geri koyun.\r\nKereviz püresi yapmak için kerevizi soyun ve küpler halinde kesin. Büyük bir tavada zeytinyağını ısıtın. Kerevizi ekleyin ve altın rengi olana kadar 5 dakika kızartın. Tuz ve karabiberle iyice tatlandırın. Biberiye, kekik, defne ve kakule kabuklarını ekleyin, ardından kerevizi neredeyse kaplayacak kadar 200 ml su dökün. Ateşi kısın, tavayı kısmen kapatın ve 25-30 dakika kısık ateşte pişirin.\r\n25-30 dakika sonra kereviz yumuşamış ve suyun çoğu buharlaşmış olmalıdır. Kalan suyu süzün, ardından ot dallarını, defne ve kakule kabuklarını çıkarın. Patates ezici ile hafifçe ezin, ardından bir yudum zeytinyağı ile tamamlayın ve damak tadınıza göre baharatlayın. Sığır eti bourguignon'u servis kaselerine koyun ve üzerine büyük bir kaşık kereviz püresi koyun. İsterseniz defne yapraklarından biriyle süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vtqxtu1511784197.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=SQnr4Z-7rok",
    "strIngredient1": "Kaz Yağı",
    "strIngredient2": "Dana İncik",
    "strIngredient3": "Pastırma",
    "strIngredient4": "Çaylak",
    "strIngredient5": "Kestane Mantarı",
    "strIngredient6": "Sarımsak Dişi",
    "strIngredient7": "Buket Garni",
    "strIngredient8": "Domates Püresi",
    "strIngredient9": "Kırmızı Şarap",
    "strIngredient10": "Kereviz",
    "strIngredient11": "Zeytinyağı",
    "strIngredient12": "Kekik",
    "strIngredient13": "Biberiye",
    "strIngredient14": "Defne Yaprağı",
    "strIngredient15": "Kakule",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "3 çay kaşığı",
    "strMeasure2": "600g",
    "strMeasure3": "100g",
    "strMeasure4": "350g",
    "strMeasure5": "250g",
    "strMeasure6": "2 dilimlenmiş",
    "strMeasure7": "1",
    "strMeasure8": "1 yemek kaşığı",
    "strMeasure9": "750 ml",
    "strMeasure10": "600g",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "taze dal",
    "strMeasure13": "taze dal",
    "strMeasure14": "2",
    "strMeasure15": "4",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/5032/beef-bourguignon",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52782",
    "strMeal": "Kuzu domates ve tatlı baharatlar",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "Fas",
    "strInstructions": "Burada salamurada saklanan turşu yaprakları kullanın. Küçük narin yapraklar büyük kıllı olanlardan daha iyidir ancak elinizde yalnızca büyük yapraklar varsa, dolgunun etrafında çok fazla yaprak tabakası olmaması için bunları yaklaşık 12 x 12 cm olacak şekilde kesin. Ve tüm sapları çıkarın. Korunmuş yaprakları süzün, 10 dakika kaynar suda bekletin ve kullanmadan önce bir çay havlusu üzerinde kurumaya bırakın. \r\nTereyağlı ve çam fıstıklı basmati pirinci ideal bir eşlikçidir. Kuskus da harikadır. Dört kişiliktir.\r\nÖnce dolguyu yapın. Domatesler hariç tüm malzemeleri bir kase. Domatesleri ikiye kesin, kaba rendeleyin ve kabuklarını çıkarın. Yarım çay kaşığı tuz ve biraz karabiber ekleyin ve karıştırın. Bir kenara veya buzdolabında bir güne kadar bekletin. Kullanmadan önce, ellerinizle hafifçe sıkın ve çıkan suyu süzün.\r\nSosu yapmak için, orta boy bir tavada yağı ısıtın. Zencefil ve sarımsağı ekleyin, yakmamaya dikkat ederek bir veya iki dakika pişirin, ardından domatesi, limon suyunu ve şekeri ekleyin. Baharatlayın ve 20 dakika pişirin.\r\nSos fokurdarken, asma yapraklarını hazırlayın. Yırtık veya kırık yaprakları geniş ve ağır bir tencerenin tabanını kaplamak için kullanın. Rezene yapraklarını kesin, dikey olarak 0,5 cm kalınlığında dilimler halinde kesin ve tencerenin tabanını tamamen kaplayacak şekilde yayın.\r\nHazırlanmış bir asma yaprağını (girişe bakın) damarlı tarafı yukarı bakacak şekilde bir çalışma yüzeyine koyun. Yaprağın tabanına 2 cm uzunluğunda ve 1 cm genişliğinde bir şerit halinde iki tatlı kaşığı iç harcı koyun. Yaprağın kenarlarını iç harcın üzerine katlayın, sonra alttan üste doğru sıkıca puro şeklinde sarın. Tavaya yerleştirin, dikişlerini aşağı doğru yapın ve kalan yapraklarla tekrarlayın, onları sıkıca yan yana çizgiler veya daireler halinde yerleştirin (gerekirse iki kat halinde).\r\nSosu yaprakların üzerine dökün (ve gerekirse sadece örtecek kadar su ekleyin). Yaprakları aşağı bastırmak için üstüne bir tabak koyun, sonra bir kapakla örtün. Kaynatın, ateşi kısın ve kısık ateşte 70 dakika pişirin. Sıvının çoğu buharlaşmalıdır. Ateşten alın ve biraz soğumaya bırakın - sıcak servis edilmesi en iyisidir. Servis ederken, tavada masaya getirin - harika görünüyor. Sıcak pilavla birkaç asma yaprağı ve rezene dilimi servis edin. Üzerine haşlama suyunu dökün ve kişnişle süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
    "strTags": "",
    "strYoutube": "https://www.youtube.com/watch?v=vaZb1MnFBgA",
    "strIngredient1": "zeytinyağı",
    "strIngredient2": "zencefil",
    "strIngredient3": "sarımsak",
    "strIngredient4": "domates",
    "strIngredient5": "limon suyu",
    "strIngredient6": "pudra şekeri",
    "strIngredient7": "asma yaprakları",
    "strIngredient8": "rezene bulb",
    "strIngredient9": "kuzu kıyması",
    "strIngredient10": "soğan",
    "strIngredient11": "patates",
    "strIngredient12": "basmati pirinci",
    "strIngredient13": "kıyılmış maydanoz",
    "strIngredient14": "kişniş",
    "strIngredient15": "limon suyu",
    "strIngredient16": "sarımsak",
    "strIngredient17": "karanfil",
    "strIngredient18": "tarçın",
    "strIngredient19": "domates",
    "strIngredient20": "",
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "4 cm parça ince kıyılmış",
    "strMeasure3": "2 diş soyulmuş ve doğranmış",
    "strMeasure4": "800g soyulmuş ve doğranmış",
    "strMeasure5": "2 yemek kaşığı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "50",
    "strMeasure8": "1 büyük",
    "strMeasure9": "400g",
    "strMeasure10": "1 orta",
    "strMeasure11": "1 küçük soyulmuş ve iri rendelenmiş",
    "strMeasure12": "2 yemek kaşığı",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "2 yemek kaşığı doğranmış",
    "strMeasure15": "1 yemek kaşığı",
    "strMeasure16": "2 diş",
    "strMeasure17": "½ çay kaşığı öğütülmüş",
    "strMeasure18": "½ çay kaşığı öğütülmüş ",
    "strMeasure19": "2 orta",
    "strMeasure20": "",
    "strSource": "http://www.ottolenghi.co.uk/recipes/meat/lamb-tomato-and-sweet-spices-shop",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52805",
    "strMeal": "Kuzu Biryani",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "Hint",
    "strInstructions": "Mümkün olduğunca az su kullanarak kajuyu, haşhaş tohumlarını ve kimyon tohumlarını pürüzsüz bir macun haline getirin. Bir kenara koyun. \r\n\r\nSıcakken dilimlenmiş soğanları derin yağda kızartın. Yağı aşırı doldurmayın. Soğanlar hafifçe kahverengiye döndüğünde yağdan alın ve kağıt havlu üzerinde süzün. Kızarmış soğan süzülürken çıtır çıtır olacaktır. Ayrıca kaju fıstıklarını da kızarana kadar kızartın. Bir kenara koyun.\r\n\r\nPirinci yıkayın ve yirmi dakika suda bekletin.\r\nBu arada büyük ve geniş bir tava alın, orta ateşte yağı ekleyin, dilimlenmiş soğanları ekleyin, karıştırılmış macunu ekleyin, üzerine yeşil biberleri, zencefil sarımsak ezmesini ekleyin ve sarımsakları ekleyip bir dakika kızartın.\r\nSonra domatesleri ekleyin ve pişene ve lapa olmayana kadar iyice soteleyin.\r\n\r\nSonra kırmızı toz biber, biryani tozu, nane, kişniş yapraklarını ekleyin ve iyice soteleyin.\r\nYoğurdu ekleyin ve iyice karıştırın. Yoğurt eklerken tavayı her zaman ocaktan uzaklaştırırım, böylece kesilmesini önler.\r\n\r\nŞimdi tavayı tekrar ocağa koyduktan sonra, yıkanmış kuzuyu, tuzu ve ½ su bardağı suyu ekleyin ve iyice karıştırın. 1 saat pişirin ve orta düşük ateşte kapalı olarak pişirin veya düdüklü tencereye 6 düdük sesi gelene kadar pişirin. Su tamamen boşalmamışsa, açık tutarak ısıtın.\r\n\r\nBaşka bir büyük tava alın, kullandığınız pirincin üç katı su bardağını ekleyin ve kaynatın. Yüksek kaynamaya başladığında pirinci, tuzu ve kimyonu ekleyin ve iyice karıştırın. Tam 7 dakika sonra veya pirinç %80 piştiğinde. Kapatın ve pirinci süzün.\r\n\r\nŞimdi katmanlama başlıyor. Kuzuya, hafifçe vurun ve düzeltin. Üzerine süzülmüş sıcak pirinci ekleyin. Kızarmış soğan, ghee, nane, kişniş yaprakları ve sütte eritilmiş safranla süsleyin.\r\n\r\nKabın üzerini kapatın ve 350f fırında 15 dakika veya pişene kadar ancak lapa olmayana kadar pişirin. Veya orta ateşte 12 dakika ve en düşük ateşte 5 dakika pişirin. Ve kapatın. Karıştırın ve sıcak servis edin!\r\nNotlar\r\n1. Fırında pişiriyorsanız, büyük fırına dayanıklı bir tavada pişirdiğinizden ve sıkıca kapattığınızdan ve ardından son adım için fırında tuttuğunuzdan emin olun.\r\n2. Eğer yoksa biryani masala'yı atlayabilir ve sadece garam masala ekleyebilirsiniz (1 çay kaşığı ve kırmızı biber tozu - 1 çay kaşığı yerine 3 çay kaşığı)\r\n3. Sonunda baharatlı olursa, biraz limon sıkın, bu acıyı azaltacak ve lezzetleri de artıracaktır.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
    "strTags": "Köri,Et",
    "strYoutube": "https://www.youtube.com/watch?v=r7SYVSG5nxo",
    "strIngredient1": "Kaju fıstığı",
    "strIngredient2": "Khus khus",
    "strIngredient3": "Kimyon tohumları",
    "strIngredient4": "Soğan",
    "strIngredient5": "Zencefilli sarımsak ezmesi",
    "strIngredient6": "Sarımsak",
    "strIngredient7": "Nane",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Safran",
    "strIngredient10": "Ghee",
    "strIngredient11": "Basmati pirinci",
    "strIngredient12": "Tam yağlı yoğurt",
    "strIngredient13": "Kimyon tohumları",
    "strIngredient14": "Defne yaprağı",
    "strIngredient15": "Tarçın",
    "strIngredient16": "Karanfil",
    "strIngredient17": "Kakule",
    "strIngredient18": "Kuzu eti",
    "strIngredient19": "Kırmızı biber tozu",
    "strIngredient20": "Biryani masala",
    "strMeasure1": "12",
    "strMeasure2": "½ yemek kaşığı",
    "strMeasure3": "½ yemek kaşığı",
    "strMeasure4": "3 ince dilimlenmiş",
    "strMeasure5": "2 çay kaşığı",
    "strMeasure6": "4 bütün",
    "strMeasure7": "Yapraklar",
    "strMeasure8": "Yapraklar",
    "strMeasure9": "½ çay kaşığı ½ su bardağı ılık sütte çözülmüş",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "2 Su Bardağı",
    "strMeasure12": "½ su bardağı",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "½",
    "strMeasure15": "1 ince parça",
    "strMeasure16": "3",
    "strMeasure17": "2",
    "strMeasure18": "1 lb",
    "strMeasure19": "1 çay kaşığı",
    "strMeasure20": "1 yemek kaşığı",
    "strSource": "http://www.relishthebite.com/restaurant-style-lamb-biryani/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52844",
    "strMeal": "Lazanya",
    "strDrinkAlternate": null,
    "strCategory": "Makarna",
    "strArea": "İtalyan",
    "strInstructions": "Büyük bir tencerede yağı ısıtın. Pastırmayı küçük parçalara ayırmak için mutfak makası kullanın veya bir kesme tahtası üzerinde doğramak için keskin bir bıçak kullanın. Pastırmayı tavaya ekleyin ve altın rengine dönmeye başlayana kadar sadece birkaç dakika pişirin. Soğan, kereviz ve havucu ekleyin ve ara sıra karıştırarak yumuşayana kadar orta ateşte 5 dakika pişirin.\r\nSarımsağı ekleyin ve 1 dakika pişirin, ardından kıymayı ekleyin ve yaklaşık 6 dakika boyunca her tarafı kızarana kadar tahta bir kaşıkla karıştırarak ve parçalayarak pişirin.\r\nDomates püresini ekleyin ve 1 dakika pişirin, sığır eti ve sebzelerle iyice karıştırın. doğranmış domatesler. Her kutuyu yarıya kadar suyla doldurup kutuda kalan domatesleri yıkayın ve tavaya ekleyin. Balı ekleyin ve damak tadınıza göre baharatlayın. 20 dakika pişirin.\r\nFırını 200C/180C fan/gaz 6'ya ısıtın. Lazanyayı birleştirmek için, ragu sosundan bir kepçeyle fırın tepsisinin veya güveç kabının tabanına dökün ve sosu tüm tabana yayın. Sosun üzerine sığması için üst üste gelecek şekilde 2 lazanya yaprağı yerleştirin, ardından daha fazla sos ve bir kat daha makarna ile tekrarlayın. 2 kat daha sos ve makarna ile tekrarlayın ve bir kat makarna ile bitirin.\r\nCrème fraîche'i bir kaseye koyun ve 2 yemek kaşığı suyla karıştırarak gevşetin ve pürüzsüz, dökülebilir bir sos elde edin. Bunu makarnanın üzerine dökün, ardından mozzarella peyniri ile kaplayın. Üzerine Parmesan serpin ve altın rengi ve köpürene kadar 25-30 dakika pişirin. İsterseniz fesleğenle serpiştirerek servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=gfhfsBPt46s",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Pastırma",
    "strIngredient3": "Soğan",
    "strIngredient4": "Kereviz",
    "strIngredient5": "Havuç",
    "strIngredient6": "Sarımsak",
    "strIngredient7": "Kıyma",
    "strIngredient8": "Domates Püresi",
    "strIngredient9": "Doğranmış Domatesler",
    "strIngredient10": "Bal",
    "strIngredient11": "Lazanya Yaprakları",
    "strIngredient12": "Creme Fraiche",
    "strIngredient13": "Mozzarella Topları",
    "strIngredient14": "Parmesan Peyniri",
    "strIngredient15": "Fesleğen Yaprakları",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 yemek kaşığı ",
    "strMeasure2": "2",
    "strMeasure3": "1 ince kıyılmış",
    "strMeasure4": "1 Çubuk",
    "strMeasure5": "1 orta",
    "strMeasure6": "2 diş kıyılmış",
    "strMeasure7": "500g",
    "strMeasure8": "1 yemek kaşığı",
    "strMeasure9": "800g",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "500g",
    "strMeasure12": "400ml",
    "strMeasure13": "125g",
    "strMeasure14": "50g",
    "strMeasure15": "Üst sos",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/classic-lasagne",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52827",
    "strMeal": "Massaman Sığır Körisi",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Tayland",
    "strInstructions": "Fırını 200C/180C fan/gaz 6'ya ısıtın, ardından fıstıkları altın rengi kahverengi olana kadar 5 dakika fırın tepsisinde kavurun. Elle tutulabilecek kadar soğuduğunda, kabaca doğrayın. Fırını 180C/160C fan/gaz 4'e düşürün.\r\nKapaklı büyük bir güveç kabına 2 yemek kaşığı Hindistan cevizi kremasını ısıtın. Köri ezmesini ekleyin ve 1 dakika kızartın, ardından sığır etini ekleyin ve iyice kaplanana ve mühürlenene kadar kızartın. Hindistan cevizinin geri kalanını yarım kutu suyla, patates, soğan, limon yaprakları, tarçın, demirhindi, şeker, balık sosu ve fıstıkların çoğuyla karıştırın. Kaynamaya başlayınca kısık ateşte pişirin, sonra üzerini kapatın ve dana eti yumuşayana kadar fırında 2 saat pişirin.\r\nDilimlenmiş acı biber ve kalan fıstıkları serpin, ardından yasemin pirinciyle birlikte doğrudan tabaktan servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
    "strTags": "Köri",
    "strYoutube": "https://www.youtube.com/watch?v=mVxgZSCU9_g",
    "strIngredient1": "Fıstık",
    "strIngredient2": "Hindistan cevizi kreması",
    "strIngredient3": "Massaman köri ezmesi",
    "strIngredient4": "Dana eti",
    "strIngredient5": "Patates",
    "strIngredient6": "Soğan",
    "strIngredient7": "Limon",
    "strIngredient8": "Tarçın çubuğu",
    "strIngredient9": "Tamarind ezmesi",
    "strIngredient10": "Esmer şeker",
    "strIngredient11": "Balık sosu",
    "strIngredient12": "acı biber",
    "strIngredient13": "Yasemin pirinci",
    "strIngredient14": null,
    "strIngredient15": null,
    "strIngredient16": null,
    "strIngredient17": null,
    "strIngredient18": null,
    "strIngredient19": null,
    "strIngredient20": null,
    "strMeasure1": "85g",
    "strMeasure2": "400ml kutu",
    "strMeasure3": "4 yemek kaşığı",
    "strMeasure4": "600g haşlanmış şeritler halinde kesilmiş",
    "strMeasure5": "450g mumsu",
    "strMeasure6": "1 ince dilimler halinde kesilmiş",
    "strMeasure7": "4 yaprak",
    "strMeasure8": "1",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı hurma veya yumuşak ışık",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "1 kırmızı çekirdekleri çıkarılmış ve ince dilimlenmiş, servis için",
    "strMeasure13": "servis için",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/420631/beef-massaman-curry",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52864",
    "strMeal": "Mantar ve Kestane Rotolo",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İngiliz",
    "strInstructions": "Kurutulmuş mantarları 350 ml kaynar suda bekletin ve ihtiyaç duyana kadar bir kenara koyun. Kestanelerin ¾'ünü krema kıvamına gelene kadar 150 ml suyla karıştırın. Kalan kestaneleri kabaca doğrayın.\r\nBüyük yapışmaz bir tavada 2 yemek kaşığı zeytinyağını ısıtın. Arpacık soğanlarını bir tutam tuzla yumuşayana kadar kızartın, ardından sarımsağı, doğranmış kestaneleri ve biberiye ekleyin ve 2 dakika daha kızartın. Yabani mantarları, 2 yemek kaşığı yağı ve biraz baharat ekleyin. Yumuşamaya başlayana kadar 3 dakika pişirin. Kurutulmuş mantarları süzün ve kabaca doğrayın ( ıslatma sıvısı), sonra bunları da soya sosuyla birlikte ekleyin ve 2 dakika daha kızartın.\r\nŞarabı, ayrılmış mantar sıvısını ve kestane kremasını bir sos oluşturmak için çırpın. Baharatlayın, sonra yarısını tavadaki mantar karışımına ekleyin ve sos parlaklaşana kadar 1 dakika pişirin. Biberiye dallarını çıkarın ve atın, sonra karışımı bir kenara koyun.\r\nFırını 180C/160C fan/gaz 4'e ısıtın. Büyük bir tencerede tuzlu suyu kaynatın ve büyük bir kase buzlu su hazırlayın. Lazanya yapraklarını kaynar suya 2 dakika veya yumuşayana ve biraz pişene kadar bırakın, sonra hemen soğuk suya daldırın. Parmaklarınızı kullanarak yaprakları dikkatlice ayırın ve temiz bir çay havlusuna aktarın. Her yaprağın alt üçte ikisine bir kaşık sos sürün, sonra kendinizden uzağa doğru yuvarlayarak kısa uçları yuvarlayın. Her ruloyu ikiye kesin, sonra makarna rulolarını masada servis etmekten mutluluk duyacağınız bir turta tabağına kesik tarafı yukarı bakacak şekilde yerleştirin. Tüm yufkaları sardıktan sonra mantar sosunuz kaldıysa, bunu sadece makarna rulolarından bazılarının açıkta kalan kısımlarına itin.\r\nSosun geri kalanını makarnanın üstüne dökün, sonra 10 dakika veya makarna şişle test edildiğinde artık direnç göstermeyene kadar pişirin.\r\nBu arada, galeta ununu, son 2 yemek kaşığı zeytinyağını, adaçayı yapraklarını ve biraz baharatı bir kaseye koyun ve her şeyi karıştırın. Rotoloyu kırıntılar ve adaçayı ile serpin, sonra üstü altın rengi olana ve adaçayı yaprakları çıtır çıtır olana kadar 10 dakika daha pişirin. Makarnanın sosu emmesi için 10 dakika soğumaya bırakın, ardından isterseniz yemeğinizi masaya koymadan önce üzerine biraz trüf yağı gezdirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ssyqwr1511451678.jpg",
    "strTags": "Vejetaryen, Fındık",
    "strYoutube": "https://www.youtube.com/watch?v=GNN7_ZSJ5YE",
    "strIngredient1": "Mantar",
    "strIngredient2": "Kestane",
    "strIngredient3": "Çaylak",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Biberiye",
    "strIngredient6": "Vahşi Mantarlar",
    "strIngredient7": "Soya Sosu",
    "strIngredient8": "Beyaz Şarap",
    "strIngredient9": "Lazanya Yaprakları",
    "strIngredient10": "Ekmek Kırıntıları",
    "strIngredient11": "Adaçayı",
    "strIngredient12": "Trüf Yağı",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "30g",
    "strMeasure2": "240g",
    "strMeasure3": "3",
    "strMeasure4": "3 karanfil",
    "strMeasure5": "3 dal",
    "strMeasure6": "500g",
    "strMeasure7": "2 yemek kaşığı ",
    "strMeasure8": "125ml ",
    "strMeasure9": "350g",
    "strMeasure10": "4 yemek kaşığı",
    "strMeasure11": "1/2 avuç ",
    "strMeasure12": "servis etmek için",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/mushroom-chestnut-rotolo",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52876",
    "strMeal": "Kıymalı Turta",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 200C/400F/Gaz 6'ya önceden ısıtın.\r\nDerin bir tavada yağı ısıtın ve kıymayı 4-5 dakika kızartın, kızarırken tahta bir kaşıkla parçalayın.\r\nSoğanı ekleyin ve 2-3 dakika pişirin, ardından domates püresini ekleyin ve 2-3 dakika daha pişirin. Unu ekleyin ve bir dakika daha pişirin, ardından doğranmış mantarları, stout veya dana suyunu ve birkaç damla Worcestershire sosunu ekleyin. Kaynama noktasına getirin, ardından ateşi kısın, tavayı bir kapakla kapatın ve 20 dakika kısık ateşte pişirin. kenara koyun ve soğumaya bırakın, sonra et karışımını bir litrelik turta tabağına alın.\r\nHamuru unlanmış bir çalışma yüzeyinde turta tabağından biraz daha büyük olana kadar açın. Hamuru tabağın üzerine yavaşça örtün, kenarlarına sıkıca bastırın. Kenarlarını kesin, sonra yivli bir şekil verin.\r\nHamur artıklarından birkaç yaprak şekli kesin ve turtanın üstünü süsleyin, çırpılmış yumurta sarısı ile hamura yapıştırın.\r\nBuharın çıkması için hamurda üç veya dört kesik açın, sonra turtayı çırpılmış yumurta sarısının geri kalanıyla fırçalayın ve fırında 20-25 dakika veya kızarana kadar pişirin.\r\nServis etmek için dilimler halinde kesin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
    "strTags": "Turta, Et",
    "strYoutube": "https://www.youtube.com/watch?v=QY47h-uqq5g",
    "strIngredient1": "Bitkisel Yağ",
    "strIngredient2": "Kıyma",
    "strIngredient3": "Soğan",
    "strIngredient4": "Domates Püresi",
    "strIngredient5": "Sade Un",
    "strIngredient6": "Mantar",
    "strIngredient7": "Dana Suyu",
    "strIngredient8": "Worcestershire Sosu",
    "strIngredient9": "Kısa Hamur",
    "strIngredient10": "Yumurta Sarısı",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "500g",
    "strMeasure3": "1 doğranmış",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "1 ½ yemek kaşığı",
    "strMeasure6": "75g",
    "strMeasure7": "250ml",
    "strMeasure8": "Tire",
    "strMeasure9": "400g",
    "strMeasure10": "1",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/mincedbeefpie_89198",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52880",
    "strMeal": "McSinghs İskoç Böreği",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu",
    "strArea": "İngiliz",
    "strInstructions": "Büyük bir tavayı ısıtın ve kimyon tohumlarını birkaç dakika kavurun, ardından bir kenara koyun. Aynı tavada yağı ısıtın ve soğan, sarımsak, biber, kırmızı biber ve bir tutam tuzu yaklaşık sekiz dakika, nem kalmayana kadar kızartın. Tavadan alın, kavrulmuş kimyon tohumlarını, toz hint cevizi (veya muskat) ve toz kişnişi ekleyin. Soğumaya bırakın.\r\nBüyük bir kasede kıyma kuzu, beyaz biber, taze kişniş ve soğutulmuş baharatlı soğan karışımını karıştırın. Üzerini örtün ve buzdolabında bekletin.\r\nFırını 200C/400F/Gaz 6'ya ısıtın ve 20cm/8in çapında kelepçeli yuvarlak kek kalıbını cömertçe iç yağı ile yağlayın.\r\nHamuru yapmak için un ve tuzu büyük bir kaseye eleyin ve ortasına bir kuyu açın.\r\nSüt, iç yağı ve 90ml/3fl oz suyu bir tencerede nazikçe ısıtın. İç yağı eridiğinde, ısıyı artırın ve kaynatın.\r\nKaynar sıvıyı una dökün ve tahta kaşıkla karıştırarak soğuyana kadar karıştırın. Bir top haline getirin.\r\nUn serpilmiş bir yüzeyde hızlıca çalışarak hamuru kısa süre yoğurun – hamur yumuşak ve nemli olacaktır. Hamurun üçte birini ayırın ve kalan kısmını iyice unlanmış bir yüzeyde açın. Pasta kabını hamurla kaplayın, yanlara doğru bastırın ve kalıbın tepesinden biraz yukarı çıkana kadar bastırın.\r\nİç harcı hamurlu kalıba azar azar ekleyin. Üst kısma ulaştığınızda hafif bir tepe oluşturun. Ayrılan hamuru açın ve pastanın üstünü kaplayın. Kenarlarını sıkıştırarak mühürleyin ve fazlalıkları kesin. Pastanın üst kısmında bir delik açın ve buharın çıkması için küçük bir alüminyum folyo tüpü yerleştirin.\r\nPastanın üstünü biraz çırpılmış yumurta sarısı ile fırçalayın ve önceden ısıtılmış fırında 30 dakika pişirin (alttaki rafta bir tepsi yerleştirerek damlayanları toplayın). Ardından sıcaklığı 160C/325F/Gaz 3'e düşürün ve 1¼ saat daha altın kahverengi olana kadar pişirin. Tamamen soğumaya bırakın ve iki saat veya bir gece buzdolabında bekletin.\r\nPastanın kenarını bir bıçakla gezdirin, kalıptan çıkarın ve chutney, salata veya turşularla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "strTags": "Börek",
    "strYoutube": "https://www.youtube.com/watch?v=1nArqhRyszw",
    "strIngredient1": "Kimyon",
    "strIngredient2": "Kanola Yağı",
    "strIngredient3": "Kırmızı Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Yeşil Biber",
    "strIngredient6": "Kırmızı Biber",
    "strIngredient7": "Muskat",
    "strIngredient8": "Kişniş",
    "strIngredient9": "Kuzu Kıyma",
    "strIngredient10": "Karabiber",
    "strIngredient11": "Kişniş",
    "strIngredient12": "Un",
    "strIngredient13": "Tuz",
    "strIngredient14": "Süt",
    "strIngredient15": "İç Yağı",
    "strIngredient16": "Yumurta Sarısı",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 çay kaşığı",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "2 ince doğranmış",
    "strMeasure4": "6",
    "strMeasure5": "3 ince doğranmış",
    "strMeasure6": "1 ince doğranmış",
    "strMeasure7": "1 çay kaşığı",
    "strMeasure8": "2 çay kaşığı",
    "strMeasure9": "1kg",
    "strMeasure10": "1 çay kaşığı",
    "strMeasure11": "3 yemek kaşığı",
    "strMeasure12": "340g",
    "strMeasure13": "½ çay kaşığı",
    "strMeasure14": "90 ml",
    "strMeasure15": "150g",
    "strMeasure16": "Çırpılmış",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/mcsinghs_scotch_pie_98356",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52900",
    "strMeal": "Madeira Keki",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Fırını önceden 180C/350F/Gaz 4'e ısıtın. 18cm/7in yuvarlak kek kalıbını yağlayın, tabanını yağlı kağıt ile kaplayın ve kağıdı da yağlayın.\r\nBir kapta tereyağı ve şekeri birlikte krema kıvamına gelene kadar çırpın. Yumurtaları teker teker çırpın, her birini eklerken karışımı iyice çırpın ve karışımın kesilmemesi için son yumurtayla birlikte bir kaşık un ekleyin.\r\nUnu eleyin ve yavaşça karışıma katın, kaşıkla ağır bir şekilde düşen bir kıvama gelene kadar yeterli miktarda süt ekleyin. Limon kabuğu rendesini katın.\r\nKarışımı hazırlanan kalıba dökün ve üstünü hafifçe düzeltin. Kekin üstü altın kahverengiye dönene ve ortasına batırılan bir şiş temiz çıkana kadar fırının orta rafında 30-40 dakika pişirin.\r\nFırından çıkarın ve kalıpta 10 dakika soğumaya bırakın, ardından bir tel rafa çıkarın ve tamamen soğumaya bırakın.\r\nServis yapmak için keki şekerlenmiş kabuklarla süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/urtqut1511723591.jpg",
    "strTags": "Kek,Hafif,Fırın,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=-YDh4WEmK_E",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Toz Şeker",
    "strIngredient3": "Yumurta",
    "strIngredient4": "Kendinden Kabaran Un",
    "strIngredient5": "Süt",
    "strIngredient6": "Limon",
    "strIngredient7": "Karışık Kabuk",
    "strIngredient8": "",
    "strIngredient9": "",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "175g",
    "strMeasure2": "175g",
    "strMeasure3": "3",
    "strMeasure4": "250g",
    "strMeasure5": "3 yemek kaşığı",
    "strMeasure6": "1 limon kabuğu rendesi",
    "strMeasure7": "Süslemek İçin",
    "strMeasure8": "",
    "strMeasure9": "",
    "strMeasure10": "",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbc.co.uk/food/recipes/madeiracake_73878",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52927",
    "strMeal": "Montreal Tütsülenmiş Et",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Kanadalı",
    "strInstructions": "Cilayı hazırlamak için küçük bir kasede tuz, pembe tuz, karabiber, kişniş, şeker, defne yaprağı ve karanfil karıştırın. Etin tamamını bu karışımla kaplayın ve büyük bir zipli plastik torbaya koyun. Buzdolabının en soğuk bölümüne yerleştirin ve 4 gün boyunca, günde iki kez etin yönünü değiştirerek bekletin.\r\nEti torbadan çıkarın ve soğuk su altında cilayı mümkün olduğunca yıkayın. Eti büyük bir kaba koyun, su ile doldurun ve 2 saat bekletin, her 30 dakikada bir suyu değiştirin. Suyu boşaltın ve kağıt havlularla iyice kurulayın.\r\nKarıştırıcı bir kasede karabiber, kişniş, paprika, sarımsak tozu, soğan tozu, dereotu, hardal, kereviz tohumu ve pul biberi karıştırın. Etin tamamını bu karışımla kaplayın.\r\nIzgarayı veya tütsüleyiciyi 225 dereceye ısıtın, ısındığında tütsüleme odunları ekleyin. Odunlar yanmaya başlayıp duman üretmeye başladığında, eti yağı yukarı gelecek şekilde yerleştirin ve kalın kısmına bir anlık sıcaklık ölçer yerleştirildiğinde 165 dereceye ulaşana kadar yaklaşık 6 saat tütsüleyin.\r\nEti büyük bir kavrulma tepsisine yerleştirin, tepsiyi iki ocak üzerinde yerleştirin ve içine 2,5 cm su ekleyin. Su kaynamaya başlayınca ısısını orta seviyeye düşürün, tepsiyi alüminyum folyo ile kapatın ve etin kalın kısmına bir anlık sıcaklık ölçer yerleştirildiğinde 180 dereceye ulaşana kadar 1-2 saat buharda pişirin. Gerekirse sıcak su ekleyin.\r\nEti kesme tahtasına alıp biraz soğumasını bekleyin. Dilimleyin ve tercihen çavdar ekmeği ve hardalla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
    "strTags": "Özel,Atıştırmalık,Güçlü Tatlar",
    "strYoutube": "https://www.youtube.com/watch?v=g5oCDoyxbBk",
    "strIngredient1": "Sığır Göğsü",
    "strIngredient2": "Tuz",
    "strIngredient3": "Karabiber",
    "strIngredient4": "Kişniş",
    "strIngredient5": "Şeker",
    "strIngredient6": "Defne Yaprağı",
    "strIngredient7": "Karanfil",
    "strIngredient8": "Karabiber",
    "strIngredient9": "Kişniş",
    "strIngredient10": "Paprika",
    "strIngredient11": "Sarımsak",
    "strIngredient12": "Soğan",
    "strIngredient13": "Dereotu",
    "strIngredient14": "İngiliz Hardalı",
    "strIngredient15": "Kereviz Tuzu",
    "strIngredient16": "Kırmızı Biber Pul",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1",
    "strMeasure2": "3 yemek kaşığı",
    "strMeasure3": "3 yemek kaşığı",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "1 yemek kaşığı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "1 çay kaşığı",
    "strMeasure8": "3 yemek kaşığı",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "1 yemek kaşığı",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "1 çay kaşığı",
    "strMeasure15": "1 yemek kaşığı",
    "strMeasure16": "1 çay kaşığı",
    "strSource": "http://www.meatwave.com/blog/montreal-smoked-meat-recipe",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52947",
    "strMeal": "Ma Po Tofu",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Çin",
    "strInstructions": "Minik bir tutam tuz ve susam yağı ekleyin ve kıyma etini iyice karıştırın, bir kenara bırakın.\r\nBir kasede 1 yemek kaşığı mısır nişastasını 2,5 yemek kaşığı su ile karıştırarak su nişastası hazırlayın.\r\nTofuyu kare küpler halinde kesin (yaklaşık 2 cm). Büyük bir tencereyi kaynamaya getirin, bir tutam tuz ekleyin ve tofu ekleyin, 1 dakika pişirin. Tofuyu çıkarın ve süzün.\r\nWok'u alın, 2 yemek kaşığı yağ ısıtın ve kıyma etini gevrekleşene kadar kızartın. Kıyma eti dışarı alın ve yağı wok'ta bırakın.\r\nDoubanjiang'ı 1 dakika boyunca düşük ateşte kızartın, ardından sarımsak, soğan beyazı, zencefil ve fermente siyah fasulyeyi ekleyin ve 30 saniye pişirin, sonra pul biberi ekleyin.\r\nBaharatlara su ekleyin ve yüksek ateşte kaynamaya getirin. Tofuyu dikkatlice ekleyin. Hafif soya sosu ve kıyma ekleyin. Kaynadıktan sonra ısıyı düşürün ve 6-8 dakika pişirin. Ardından doğranmış yeşil sarımsağı ekleyin.\r\nSuyu nişastasını karıştırın ve karışımın yarısını kaynayan tencereye ekleyin. Yaklaşık 30 saniye bekledikten sonra kalan yarısını ekleyin. Tofu tadına bakın, eğer yeterince tuzlu değilse biraz tuz ekleyebilirsiniz. Ayrıca, eğer fazla baharatlı olduğunu düşünüyorsanız, tadını yumuşatmak için biraz şeker ekleyebilirsiniz. Ancak dikkatli olun, çünkü bu noktada sıvı oldukça sıcak olacaktır.\r\nBaharatların neredeyse tamamı tofunun üzerine yapıştığında, üzerine Szechuan karabiberi (isteğe bağlı) ve doğranmış sarımsak yeşillikleri serpin.\r\nHemen buharda pişirilmiş pirinç ile servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1525874812.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=IhwPQL9dFYc",
    "strIngredient1": "Tofu",
    "strIngredient2": "Kıyma",
    "strIngredient3": "Susam Yağı",
    "strIngredient4": "Doubanjiang",
    "strIngredient5": "Fermente Siyah Fasulye",
    "strIngredient6": "Karabiber",
    "strIngredient7": "Tuz",
    "strIngredient8": "Sichuan Biberi",
    "strIngredient9": "Soya Sosu",
    "strIngredient10": "Su",
    "strIngredient11": "Zeytinyağı",
    "strIngredient12": "Soğanlar",
    "strIngredient13": "Yeşil Soğanlar",
    "strIngredient14": "Sarımsak",
    "strIngredient15": "Zencefil",
    "strIngredient16": "Su",
    "strIngredient17": "Mısır Nişastası",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "450g",
    "strMeasure2": "100g",
    "strMeasure3": "1/2 yemek kaşığı",
    "strMeasure4": "1 1/2 çay kaşığı",
    "strMeasure5": "1/2 çay kaşığı",
    "strMeasure6": "1 yemek kaşığı",
    "strMeasure7": "1/2 çay kaşığı",
    "strMeasure8": "1/2 çay kaşığı",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "400ml",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "2 doğranmış",
    "strMeasure13": "4",
    "strMeasure14": "2 diş doğranmış",
    "strMeasure15": "4 dilimlenmiş",
    "strMeasure16": "2 1/2 yemek kaşığı",
    "strMeasure17": "1 yemek kaşığı",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.chinasichuanfood.com/mapo-tofu-recipe/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53048",
    "strMeal": "Mee goreng mamak",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Malaysian",
    "strInstructions": "Orta ateşte bir tavada yağı ısıtın. Sonra, fıstıkları, kurutulmuş biberleri, kurutulmuş karidesleri ve mercimeği ekleyin. Aromatikleri güzel kokana kadar kızartın. Tavadan alın ve bir kenara koyun.\r\n\r\nKızarmış malzemeleri tamarind ezmesi ve suyla incecik olana kadar karıştırın. Sonra, karıştırılmış malzemeleri düşük ateşte ısıtılmış yağda soteleyin. Yağ ezmeden ayrılıp daha koyu bir renge dönene kadar pişirmeye devam edin.\r\n\r\nPatatesleri soyun ve küçük parçalara kesin ve bıçakla yumuşayana kadar bir tencerede suda kaynatın. Hazır olduğunda, tencereden alın ve bir kenara koyun. su.\r\n\r\nSoğanı ve kızarmış tofuyu dilimleyin, sarımsağı kıyın, biraz lahana ve Çin lahanası (choi sam) doğrayın. Karides kızartması hazırlayın ve doğrayın. Kurutulmuş olarak satın aldıysanız erişteleri yumuşaması için haşlayın. Ayrıca siyah soya sosunu suyla karıştırın.\r\n\r\nBir porsiyon mee goreng mamak'ı kızartmak için yağı ısıtın ve aşağıdaki malzemelerin 1/4'ünü şu sırayla ekleyin: sarımsak, soğan, salça. Güzel kokana kadar soteleyin. İsteğe bağlı olarak karides ekleyin.\r\n\r\n1/4 miktarda tofu, haşlanmış patates, lahana, Çin lahanası ve karides kızartması ekleyin. 30 saniye daha soteleyin.\r\n\r\nWok'a erişteleri ekleyin. 3 yemek kaşığı koyu soya sosu karışımını ekleyin. Sonraki 1 dakika boyunca eşit şekilde karıştırın. Ardından erişteleri wok'un kenarına alın. Bir yumurtayı karıştırın. Bir dilim limon ve yeşil biber dilimleriyle süsleyin. Başka bir erişte tabağı pişirmek için 5. adımdan itibaren tekrarlayın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xquakq1619787532.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=pOJEmDBgtSk",
    "strIngredient1": "Fıstık",
    "strIngredient2": "Acı Biber",
    "strIngredient3": "Karides",
    "strIngredient4": "Yağ",
    "strIngredient5": "Su",
    "strIngredient6": "Tamarind Macunu",
    "strIngredient7": "Patates",
    "strIngredient8": "Kırmızı Soğan",
    "strIngredient9": "Sarımsak Dişi",
    "strIngredient10": "Lahana",
    "strIngredient11": "Çin Brokolisi",
    "strIngredient12": "Tofu",
    "strIngredient13": "Soya Sosu",
    "strIngredient14": "Erişte",
    "strIngredient15": "Yumurta",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "15g",
    "strMeasure3": "10g",
    "strMeasure4": "5 yemek kaşığı",
    "strMeasure5": "750 ml ",
    "strMeasure6": "1/2 yemek kaşığı",
    "strMeasure7": "250g",
    "strMeasure8": "2",
    "strMeasure9": "4",
    "strMeasure10": "30g",
    "strMeasure11": "30g",
    "strMeasure12": "1",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "4",
    "strMeasure15": "1",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.nyonyacooking.com/recipes/mee-goreng-mamak~BkTLRjTuX",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52858",
    "strMeal": "New York Cheesecake",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Fırın rafını fırının ortasına yerleştirin. Fırını fanlı 160C/konvansiyonel 180C/gaz 4'te ısıtın. 23 cm'lik bir kelepçeli kek kalıbının tabanını yağlı kağıtla kaplayın. Tabandaki hamur için, tereyağını orta boy bir tavada eritin. Bisküvi kırıntıları ve şekeri karıştırarak karışımın iyice nemlenmesini sağlayın. Karışımı kalıbın tabanına bastırarak yerleştirin ve 10 dakika pişirin. Bir tel ızgarada soğumaya bırakın, dolgu malzemesini hazırlarken.\r\nDolgu için, fırın sıcaklığını fanlı 200C/konvansiyonel 240C/gaz 9'a çıkarın. Masa üstü mikserine paddle aparatı takarak yumuşak peyniri orta-düşük hızda 2 dakika kadar çırpın. Mikseri düşük hızda tutarak şekeri, ardından unu ve tuzu ekleyin, kasesinin ve paddle'ın kenarlarını iki kez sıyırarak karıştırın.\r\nPaddle aparatı yerine çırpıcı aparatı takın. Vanilya, limon kabuğu ve suyunu ekleyerek çırpmaya devam edin. Yumurtaları ve yumurta sarısını birer birer ekleyin, karıştırma kabını ve çırpıcıyı en az iki kez sıyırın. 284 ml'lik ekşi kremayı ekleyin ve karıştırın, ardından 200 ml (paketin 3/4'ü) ekşi kremayı ölçün ve düşük hızda ekleyin. Karışımın pürüzsüz, hafif ve havadar olmasına dikkat ederek çırpın, aşırı çırpmayın.\r\nKelepçeli kalıbın yanlarını erimiş tereyağı ile fırçalayın ve üzerine bir pişirme tepsisi koyun. Karışımı dökün - eğer topaklar varsa, bir bıçakla batırarak düzeltebilirsiniz - üstü olabildiğince pürüzsüz olmalıdır. 10 dakika pişirin. Fırın sıcaklığını fanlı 90C/konvansiyonel 110C/gaz 1/4'e düşürün ve 25 dakika daha pişirin. Kalıbı hafifçe salladığınızda dolgunun hafifçe sarsılması gerekir. Fırını kapatın ve kapıyı açın, cheesecake'in merkezinin kremamsı olmasını istiyorsanız; kapalı tutun, daha kuru bir doku isterseniz. Fırında 2 saat soğumaya bırakın. Cheesecake'in üstü, soğurken hafifçe çatlayabilir.\r\nKalan ekşi kremayı, 142 ml'lik ekşi kremayı, şekeri ve limon suyunu karıştırarak üst sosu hazırlayın. Cheesecake'in üzerine kenarlara kadar yayın. Üstünü gevşekçe alüminyum folyo ile kapatın ve en az 8 saat veya bir gece buzdolabında soğutun.\r\nKelepçeli kalıbın kenarlarına yuvarlak uçlu bir bıçakla dokunun ve kenarlarda sıkışan kenarları gevşetmek için dikkatlice çözün. Yan tarafı açın, cheesecake'i kalıbın altından tabağa kaydırın ve yağlı kağıdı dikkatlice çıkarın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/swttys1511385853.jpg",
    "strTags": "Tatlı,Sütlü,Puding,Kek,Kahvaltı",
    "strYoutube": "https://www.youtube.com/watch?v=tspdJ6hxqnc",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Ekşi Krema",
    "strIngredient3": "Şeker",
    "strIngredient4": "Krem Peynir",
    "strIngredient5": "Toz Şeker",
    "strIngredient6": "Un",
    "strIngredient7": "Limon Suyu",
    "strIngredient8": "Yumurtalar",
    "strIngredient9": "Ekşi Krema",
    "strIngredient10": "Ekşi Krema",
    "strIngredient11": "Toz Şeker",
    "strIngredient12": "Limon Suyu",
    "strMeasure1": "85g",
    "strMeasure2": "140g",
    "strMeasure3": "1 yemek kaşığı",
    "strMeasure4": "900g",
    "strMeasure5": "250g",
    "strMeasure6": "3 yemek kaşığı",
    "strMeasure7": "1 ½ tatlı kaşığı",
    "strMeasure8": "3 Büyük",
    "strMeasure9": "250ml",
    "strMeasure10": "150ml",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "2 tatlı kaşığı",
    "strSource": "https://www.bbcgoodfood.com/recipes/2869/new-york-cheesecake",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52924",
    "strMeal": "Nanaimo Barları",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Kanada",
    "strInstructions": "Bisküvi tabanını yapmaya başlamak için, bir kaba, kaynayan suyun üzerine tereyağını, şekeri ve kakao tozunu ekleyin, ara sıra karıştırarak karışımın pürüzsüz olmasını sağlayın. Yumurtayı 2-3 dakika kadar çırpın, karışım koyulaşıncaya kadar. Ocaktan alın ve bisküvi kırıntıları, hindistancevizi ve varsa bademleri ekleyin, sonra karışımı 20 cm'lik kare bir kalıba basarak yerleştirin. 10 dakika soğutun.\r\nOrta katman için, krema karışımını hazırlayın; tereyağını, kremayı ve krem şanti tozunu çırpın. Karışım hafif ve kabarık olduktan sonra, şeker ekleyin ve tamamen karıştırın. Karışımı bisküvi tabanının üzerine sürün ve buzdolabında 10 dakika kadar soğutun.\r\nÇikolatayı ve tereyağını mikrodalgada eritin, sonra karışımı soğutulmuş barların üzerine dökün ve tekrar buzdolabına koyun. Çikolata tamamen donana kadar (yaklaşık 2 saat) bekleyin. Karışımı kalıptan çıkarın ve kareler halinde dilimleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg",
    "strTags": "Atıştırmalık,Hafif,Yemek",
    "strYoutube": "https://www.youtube.com/watch?v=MMrE4I1ZtWo",
    "strIngredient1": "Krem Şanti",
    "strIngredient2": "Toz Şeker",
    "strIngredient3": "Kakao",
    "strIngredient4": "Yumurta",
    "strIngredient5": "Bisküvi Kırıntıları",
    "strIngredient6": "Hindistancevizi",
    "strIngredient7": "Badem",
    "strIngredient8": "Tereyağı",
    "strIngredient9": "Krema",
    "strIngredient10": "Krem Şanti Tozu",
    "strIngredient11": "Toz Şeker",
    "strIngredient12": "Bitter Çikolata",
    "strIngredient13": "Tereyağı",
    "strMeasure1": "125g",
    "strMeasure2": "50g",
    "strMeasure3": "5 yemek kaşığı",
    "strMeasure4": "1 çırpılmış",
    "strMeasure5": "200g doğranmış",
    "strMeasure6": "100g ",
    "strMeasure7": "50g",
    "strMeasure8": "100g ",
    "strMeasure9": "4 yemek kaşığı",
    "strMeasure10": "3 yemek kaşığı",
    "strMeasure11": "250g",
    "strMeasure12": "150g",
    "strMeasure13": "50g",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/nanaimo-bars",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53051",
    "strMeal": "Nasi lemak",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Malezya",
    "strInstructions": "Orta boy bir tencerede, orta ateşte hindistancevizi sütü, su, zencefil ezmesi, taze zencefil, tuz, defne yaprağı ve pirinci karıştırın. Kapağını kapatıp kaynamaya bırakın. Sıcaklık düşürülüp 20-30 dakika ya da pişene kadar kısık ateşte pişirin.\r\n\r\n Adım 2\r\nYumurtaları bir tencereye koyun ve üzerini soğuk su ile doldurun. Suyu kaynamaya bırakın, hemen ocaktan alın. Kapağını kapatın ve 10-12 dakika sıcak suda bekletin. Yumurtaları sudan çıkarın, soğutun, soyun ve ortadan ikiye kesin. Salatalığı dilimleyin.\r\n\r\n Adım 3\r\nBu arada, geniş bir tavada veya wokta, orta yüksek ateşte 1 su bardağı sıvı yağı ısıtın. Fıstıkları ekleyin ve hafifçe kahverengileşene kadar kısa süre pişirin. Fıstıkları delikli bir kepçe ile alın ve kağıt havluların üzerine koyarak fazla yağı emmesini sağlayın. Tavayı tekrar ocakta ısıtın. Bir paket hamsinin içeriğini ekleyin; kısa süre pişirin, karıştırarak, kıtır kıtır olana kadar pişirin. Delikli bir kepçe ile alın ve kağıt havluların üzerine koyun. Yağı dökün. Tavayı silin.\r\n\r\n Adım 4\r\nTavada 2 yemek kaşığı yağ ısıtın. Soğanı, sarımsağı ve arpacık soğanını ekleyin, 1-2 dakika kokusu çıkana kadar pişirin. Chilili karışımı ekleyin ve 10 dakika pişirin, ara sıra karıştırın. Eğer karışım kuru olursa, küçük bir miktar su ekleyin. Kalan hamsiyi ekleyin ve 5 dakika pişirin. Tuz, şeker ve asidik meyve suyu ekleyin; sos koyulaşana kadar 5 dakika pişirin.\r\n\r\n Adım 5\r\nSıcak pilavın üzerine soğan ve sarımsak sosunu dökün, üzerine fıstık, kızarmış hamsi, salatalık ve yumurta ekleyerek servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wai9bw1619788844.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=IUIs4C86Ilo",
    "strIngredient1": "Hindistancevizi Sütü",
    "strIngredient2": "Su",
    "strIngredient3": "Zencefil Ezmesi",
    "strIngredient4": "Zencefil",
    "strIngredient5": "Defne Yaprağı",
    "strIngredient6": "Pirinç",
    "strIngredient7": "Yumurtalar",
    "strIngredient8": "Salatalık",
    "strIngredient9": "Fıstık",
    "strIngredient10": "Hamsi Filetosu",
    "strIngredient11": "Sıvı Yağ",
    "strIngredient12": "Soğan",
    "strIngredient13": "Sarımsak",
    "strIngredient14": "Arpacık Soğanı",
    "strIngredient15": "Acı Biber Tozu",
    "strIngredient16": "Hamsi Filetosu",
    "strIngredient17": "Şeker",
    "strIngredient18": "Asidik Meyve Püresi",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 su bardağı",
    "strMeasure2": "2 su bardağı",
    "strMeasure3": "1/4 çay kaşığı",
    "strMeasure4": "1",
    "strMeasure5": "1",
    "strMeasure6": "2 su bardağı",
    "strMeasure7": "4",
    "strMeasure8": "1",
    "strMeasure9": "1 su bardağı",
    "strMeasure10": "4 oz",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "1",
    "strMeasure13": "3 diş",
    "strMeasure14": "3",
    "strMeasure15": "2 çay kaşığı",
    "strMeasure16": "4 oz",
    "strMeasure17": "3 yemek kaşığı",
    "strMeasure18": "1/3 su bardağı",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.allrecipes.com/recipe/78938/malaysian-nasi-lemak/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52810",
    "strMeal": "Osso Buco alla Milanese",
    "strDrinkAlternate": null,
    "strCategory": "Çeşitli",
    "strArea": "İtalyan",
    "strInstructions": "Fırını 150 dereceye ısıtın.\r\nŞankları unla bulama: Unu geniş bir tabağa dökün (bir turta tabağı iyi olur). Şankları tuz ve karabiberle her iki tarafını da iyice baharatlayın. Şankları tek tek una bulayıp fazla unu silkeleyin ve tabağa geri koyun.\r\nŞankları kızartma: Bir geniş dutch oven veya ağır bir pişirme tenceresinde, 1 yemek kaşığı tereyağını ve sıvı yağı orta-yüksek ateşte ısıtın. Yağ sıçramaya başladığında şankları ekleyin ve her iki tarafını 5 dakika kadar kızartın. Tüm şanklar sığmıyorsa, onları grup halinde kızartabilirsiniz. Yağ yanarsa, ateşi biraz kısın. Şankları büyük bir tabağa alın ve kenara koyun.\r\nAromatikler: Tencereye fazla yağı boşaltın ve yakalanmış yağ parçalarını silin. 2 yemek kaşığı tereyağını tencereye ekleyin ve orta ateşte eritin. Yağ köpürmeyi durdurduğunda, soğanı, havucu, kerevizi ve rezene ekleyin. Tuz ve karabiberle tatlandırın, karıştırarak 6 dakika kadar pişirin. Ardından sarımsak, portakal kabuğu, kekik ve defne yaprağını ekleyin ve 1-2 dakika daha pişirin.\r\nBrahma sıvısı: Şarap ekleyin, ateşi yüksek yapın ve kaynamaya bırakın. Şarabı yaklaşık yarıya kadar buharlaştırın, 5 dakika kadar kaynatın. Stok ve domatesi suyu ile ekleyin, kaynamaya devam ederek sıvıyı 1 su bardağına kadar indirin, yaklaşık 10 dakika.\r\nBrahma: Şankları tencereye yerleştirin ve kemik kısmı yukarı bakacak şekilde, üzerine biriken tüm suyu da dökün. Üzerine yağlı kağıt koyun ve kenarlarını katlayın. Üstünü iyice kapatıp, fırına verin. İlk 15 dakikada karışımın çok kaynamadığından emin olun. 40 dakikadan sonra şankları çevirin ve suyu üzerine dökün, yaklaşık 2 saat boyunca pişirin.\r\nGremolata: Şanklar pişerken, sarımsak, maydanoz ve limon kabuğunu küçük bir kasede karıştırın. Sıkıca kapatın ve soğuk bir yerde saklayın.\r\nBitirme: Şanklar kemikten düşecek şekilde yumuşadıysa, fırından çıkarın ve üzerine gremolatın yarısını serpin. Şankları yeniden fırına verin ve 15 dakika daha pişirin.\r\nSosu hazırlama: Tencereye bakın, eğer üstünde yağ tabakası varsa, onu bir kepçe ile alın. Sosu kontrol edin ve eğer çok zayıfsa, kaynar ateşte 5-10 dakika kaynatın. Sosu tatlandırmak için gremolat ekleyebilirsiniz.\r\nŞankları paylaştırma: Eğer şanklar büyükse, birini başına bir porsiyon olarak servis edin. Yavaşça dağılacaksa, daha küçük parçalara ayırarak servis yapın.\r\nServis: Şankları sıcak tabaklarda servis yapın ve risotto ile birlikte sunun. Gremolatanın geri kalanını serpin ve üstüne bolca sos ekleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wwuqvt1487345467.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=9GUTC2Qwrf0",
    "strIngredient1": "Dana Eti",
    "strIngredient2": "Un",
    "strIngredient3": "Zeytinyağı",
    "strIngredient4": "Tereyağı",
    "strIngredient5": "Soğan",
    "strIngredient6": "Havuç",
    "strIngredient7": "Kereviz",
    "strIngredient8": "Rezene",
    "strIngredient9": "Sarımsak",
    "strIngredient10": "Portakal Kabuğu",
    "strIngredient11": "Kekik",
    "strIngredient12": "Defne Yaprağı",
    "strIngredient13": "Kuru Beyaz Şarap",
    "strIngredient14": "Tavuk Suyu",
    "strIngredient15": "Domates",
    "strIngredient16": "Maydanoz",
    "strIngredient17": "Sarımsak",
    "strIngredient18": "Limon Kabuğu",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "4 etli şank",
    "strMeasure2": "½ su bardağı",
    "strMeasure3": "2 yemek kaşığı",
    "strMeasure4": "3 yemek kaşığı",
    "strMeasure5": "1 orta boy doğranmış",
    "strMeasure6": "1 doğranmış",
    "strMeasure7": "1 doğranmış",
    "strMeasure8": "1 baş doğranmış",
    "strMeasure9": "3 diş",
    "strMeasure10": "2 şerit",
    "strMeasure11": "1 ½ çay kaşığı",
    "strMeasure12": "1",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": "½ su bardağı",
    "strMeasure15": "1 su bardağı doğranmış ve suyu",
    "strMeasure16": "2 yemek kaşığı doğranmış",
    "strMeasure17": "1 tatlı kaşığı doğranmış",
    "strMeasure18": "1 tatlı kaşığı rendelenmiş",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.cookstr.com/Meat/Osso-Buco-alla-Milanese",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52943",
    "strMeal": "Oxtail with broad beans",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Jamaika",
    "strInstructions": "Oxtail'i soğan, taze soğan, sarımsak, zencefil, acı biber, soya sosu, kekik, tuz ve karabiberle karıştırın. Sıvı yağı büyük bir tavada orta yüksek ateşte ısıtın. Oxtail'i tavada her tarafı kahverengileşene kadar 10 dakika kadar pişirin. Sonra bir düdüklü tencereye koyun ve 375 ml su ekleyin. 25 dakika basınçta pişirin, sonra ısıyı kesip, üretici talimatlarına göre kapağını açın.\r\nFasulye ve pimento tanelerini ekleyin ve orta yüksek ateşte kaynamaya bırakın. Mısır nişastasını 2 yemek kaşığı suyla çözüp, kaynayan oxtail'in içine karıştırın. Sos koyulaşana kadar  birkaç dakika pişirin ve fasulyeler yumuşayana kadar pişirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1520083578.jpg",
    "strTags": "Ağır,Ana Yemek,Özel",
    "strYoutube": "https://www.youtube.com/watch?v=DIhxk-98Hz8",
    "strIngredient1": "Oxtail",
    "strIngredient2": "Soğan",
    "strIngredient3": "Taze Soğanlar",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Zencefil",
    "strIngredient6": "Scotch Bonnet",
    "strIngredient7": "Soya Sosu",
    "strIngredient8": "Taze Kekik",
    "strIngredient9": "Sıvı Yağ",
    "strIngredient10": "Su",
    "strIngredient11": "Fasulye",
    "strIngredient12": "Mısır Nişastası",
    "strIngredient13": "Su",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "450g",
    "strMeasure2": "1 doğranmış",
    "strMeasure3": "1",
    "strMeasure4": "2 diş doğranmış",
    "strMeasure5": "1 çay kaşığı",
    "strMeasure6": "1 doğranmış",
    "strMeasure7": "2 yemek kaşığı",
    "strMeasure8": "1 doğranmış",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "350 ml",
    "strMeasure11": "200g",
    "strMeasure12": "1 yemek kaşığı",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "http://allrecipes.co.uk/recipe/5392/jamaican-oxtail-with-broad-beans.aspx",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52837",
    "strMeal": "Pilchard Puttanesca",
    "strCategory": "Makarna",
    "strArea": "İtalyan",
    "strInstructions": "Makarnayı paketin talimatlarına göre haşlayın. Bir tavada zeytinyağını ısıtın, soğanı, sarımsağı ve biberi 3-4 dakika soteleyin. Domates salçasını ekleyip 1 dakika pişirin, ardından pilchard'ları sosuyla birlikte ekleyin. Balıkları bir tahta kaşıkla parçalayarak pişirin, sonra zeytinleri ekleyip birkaç dakika daha pişirin. Makarnayı süzüp tavaya ekleyin ve 2-3 yemek kaşığı pişirme suyunu ekleyin. Her şeyi iyice karıştırın, sonra tabaklara koyun ve üzerine Parmesan serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vvtvtr1511180578.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=wqZzLAPmr9k",
    "strIngredient1": "Makarna",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Kırmızı Biber",
    "strIngredient6": "Domates Salçası",
    "strIngredient7": "Pilchard (balina balığı)",
    "strIngredient8": "Siyah Zeytin",
    "strIngredient9": "Parmesan",
    "strMeasure1": "300g",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "1 ince doğranmış",
    "strMeasure4": "2 diş ezilmiş",
    "strMeasure5": "1",
    "strMeasure6": "1 yemek kaşığı",
    "strMeasure7": "425g",
    "strMeasure8": "70g",
    "strMeasure9": "Rendelenmiş",
    "strSource": "https://www.bbcgoodfood.com/recipes/pilchard-puttanesca"
  },
  {
    "idMeal": "52847",
    "strMeal": "Pork Cassoulet",
    "strCategory": "Domuz Eti",
    "strArea": "Fransız",
    "strInstructions": "Fırını 140C/120C fan/gaz 1'e ısıtın. Büyük bir fırın tepsisini yüksek ateşte ısıtın. Yağı ve doğranmış eti ekleyin, kenarları mühürlemek için birkaç dakika pişirin, eşit şekilde pişirmek için karıştırın. Ateşi kısın, doğranmış soğanı, bütün sarımsak dişlerini, havucu ve rezene tohumlarını ekleyin ve sebzeler yumuşayana kadar birkaç dakika pişirin. Kızılcık sirkesini ekleyin, tavada kalan et parçalarını kazıyın. Stok, domates salçası ve yarım taze kekik ve maydanozu ekleyin. Kaynamaya bırakın, 10 dakika kaynatın, sonra tuzlayın, üzerini kapatın ve fırına 2 saat koyun, son 1 saatte kapağı açın. Ara ara karıştırın ve 30 dakika kala fasulyeleri ekleyin. Fırından çıkarın ve ızgarayı ısıtın. Üzerine kalan otları ve ekmek kırıntılarını serpin, üzerine biraz yağ gezdirin ve 5-10 dakika kadar tekrar fırına koyun, ekmek kırıntıları altın rengi olana kadar pişirin. Yanında ekmek ve yeşil sebzelerle servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wxuvuv1511299147.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=MEdHMTD0VCA",
    "strIngredient1": "Kaz Yağı",
    "strIngredient2": "Domuz Eti",
    "strIngredient3": "Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Havuç",
    "strIngredient6": "Rezene Tohumu",
    "strIngredient7": "Kızılcık Sirkesi",
    "strIngredient8": "Sebze Suyu",
    "strIngredient9": "Domates Salçası",
    "strIngredient10": "Kekik",
    "strIngredient11": "Maydanoz",
    "strIngredient12": "Haricot Fasulyesi",
    "strIngredient13": "Ekmek Kırıntıları",
    "strIngredient14": "Yağ",
    "strIngredient15": "Ekmek",
    "strIngredient16": "Brokoli",
    "strMeasure1": "4 yemek kaşığı",
    "strMeasure2": "350g",
    "strMeasure3": "1 büyük",
    "strMeasure4": "10 diş",
    "strMeasure5": "1 ince dilimlenmiş",
    "strMeasure6": "1 tatlı kaşığı",
    "strMeasure7": "2 yemek kaşığı",
    "strMeasure8": "600ml",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "2 dal",
    "strMeasure11": "Bir avuç",
    "strMeasure12": "400g",
    "strMeasure13": "2 yemek kaşığı",
    "strMeasure14": "süslemek için",
    "strMeasure15": "servis için",
    "strMeasure16": "servis için",
    "strSource": "https://www.bbcgoodfood.com/recipes/jacks-pork-cassoulet"
  },
  {
    "idMeal": "52857",
    "strMeal": "Balkabağı Turtası",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Balkabağını büyük bir tencereye koyun, su ile örtün ve kaynamaya bırakın. Üstünü kapatın ve 15 dakika veya yumuşayana kadar kısık ateşte pişirin. Balkabağını süzün ve soğumaya bırakın.\nFırını 180C/160C fan/gaz 4'e ısıtın. Hamuru hafif unlanmış bir yüzeyde açın ve 22 cm'lik kelepçeli tart kalıbına yerleştirin. 15 dakika soğutun. Hamurun üzerine pişirme kağıdı ve pişirme boncuklarını koyun, ardından 15 dakika pişirin. Boncukları ve kağıdı çıkarın, tabanı soluk altın rengi ve bisküvi kıvamına gelene kadar 10 dakika daha pişirin. Fırından çıkarın ve hafifçe soğumaya bırakın.\nFırını 220C/200C fan/gaz 7'ye ısıtın. Soğuyan balkabağını bir süzgeçten geçirerek bir kaba alın. Ayrı bir kasede şekeri, tuzu, muskatı ve tarçının yarısını karıştırın. Yumurta, eritilmiş tereyağı ve sütü ekleyin, ardından bu karışımı balkabağı püresine ilave edin ve karıştırın. Karışımı tart hamurunun üzerine dökün ve 10 dakika pişirin, ardından sıcaklığı 180C/160C fan/gaz 4'e düşürün. 35-40 dakika daha pişirin, doldurma tamamen katılaşana kadar.\nSoğumaya bırakın, ardından turta kalıptan çıkarın. Kalan tarçın ve pudra şekerini karıştırın ve turta üzerine serpin. Soğutulmuş olarak servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/usuqtp1511385394.jpg",
    "strTags": "Cadılar Bayramı,Tart,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=hpapqEeb36k",
    "strIngredient1": "Balkabağı",
    "strIngredient2": "Kısa Hamur",
    "strIngredient3": "Un",
    "strIngredient4": "Toz Şeker",
    "strIngredient5": "Tuz",
    "strIngredient6": "Muskat",
    "strIngredient7": "Tarçın",
    "strIngredient8": "Yumurtalar",
    "strIngredient9": "Tereyağı",
    "strIngredient10": "Süt",
    "strIngredient11": "Pudra Şekeri",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "750g",
    "strMeasure2": "350g",
    "strMeasure3": "Serpiştirme",
    "strMeasure4": "140g",
    "strMeasure5": "½ çay kaşığı",
    "strMeasure6": "½ çay kaşığı",
    "strMeasure7": "1 tatlı kaşığı",
    "strMeasure8": "2 Yumurta, çırpılmış",
    "strMeasure9": "25g",
    "strMeasure10": "175g",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1742633/pumpkin-pie",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52861",
    "strMeal": "Fıstıklı Peynirli Kek",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "20 cm çapında kelepçeli kek kalıbını yağlayın ve streç filmle kaplayın, mümkün olduğunca düzgün yapmaya çalışın. Tereyağını bir tavada eritin. Bisküvileri bir torbada merdaneyle eziyet ederek ezin, sonra tereyağına karıştırarak iyice kaplanmasını sağlayın. Karışımı kalıbın tabanına sıkıca bastırın ve soğutun.\nJelatini suda bekletin, dolgu karışımını hazırlarken. Ricotta peynirini bir kaba alın, ardından fıstık ezmesi ve şurubu karıştırın. Ricotta biraz tane tane bir dokuya sahip olduğundan, daha pürüzsüz bir doku için bir el blenderi ile karıştırabilirsiniz.\nSuda bekleyen jelatini çıkarın ve suyunu sıkın. Bir tavada sütle birlikte eritin, jelatin tamamen çözülene kadar ısınmasına izin verin. Fıstıklı karışıma karıştırın, ardından bisküvi tabanının üzerine dökün. Soğuyana kadar buzdolabında bekletin.\nDondurmak için, kekin üzerinde streç film kaplayın ve kalıbı streç film ve folyo ile sarın.\nÇözüldükten sonra buzdolabında bir gece bekletin.\nServis yapmadan önce dikkatlice kalıptan çıkarın. Kremayı şekerle çırpın ve cheesecake'in üstüne sürün, üzerine fıstıklı kırıntılar serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=QSTsturcyL0",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Fıstık Ezmeli Kurabiyeler",
    "strIngredient3": "Jelatin Yaprakları",
    "strIngredient4": "Ricotta Peyniri",
    "strIngredient5": "Fıstık Ezmesi",
    "strIngredient6": "Altın Şurup",
    "strIngredient7": "Süt",
    "strIngredient8": "Çift Sütlü Krema",
    "strIngredient9": "Açık Kahverengi Şeker",
    "strIngredient10": "Fıstıklı Kırıntılar",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "175g",
    "strMeasure3": "5 yaprak",
    "strMeasure4": "500g",
    "strMeasure5": "175g",
    "strMeasure6": "175g",
    "strMeasure7": "150ml",
    "strMeasure8": "275ml",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "Kırılmış",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1759649/peanut-butter-cheesecake",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52862",
    "strMeal": "Şeftali ve Yaban Mersini Grunt",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "Fırını 190C/170C fan/gaz 5'e ısıtın. Geniş, sığ bir fırın kabını tereyağı ile yağlayın. Mısır nişastasını portakal kabuğu rendesi ve suyu ile karıştırın, sonra büyük bir tavaya koyun. Şeftalileri yarıya bölün, çekirdeklerini çıkarın ve dilimleyin, sonra tavanın içine ekleyin. Yavaşça kaynamaya bırakın, sos parlak ve koyulaşana kadar, yaklaşık 3-4 dakika karıştırarak pişirin. Ocağı kapatın, yaban mersinlerini ekleyin ve hazırladığınız kaba dökün.\nUnu bir karıştırma kabına koyun ve 50g tereyağını ekleyin. Tereyağını una yedirene kadar karıştırın, ardından şekerin yarısını ekleyin. Kalan şekeri tarçınla karıştırın ve kenara ayırın.\nSütü kuru karışıma ekleyin ve yumuşak bir hamur elde edene kadar karıştırın. Hafifçe unlanmış bir yüzeye dökün ve kısa bir süre yoğurun. 16 x 24 cm boyutlarında bir dikdörtgen şeklinde açın. Üzerine eritilmiş tereyağı sürün ve tarçınlı şekeri eşit şekilde serpin. Uzun kenardan yuvarlayın ve 12 dilime kesin. Bunları fırın kabının üzerine, ortası açık olacak şekilde yerleştirin.\n20-25 dakika pişirin, üstü çıtır ve altın rengini alana kadar. Sıcak servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ssxvup1511387476.jpg",
    "strTags": "Tatlı,Puding,Meyveli",
    "strYoutube": "https://www.youtube.com/watch?v=SNeO28BCpsc",
    "strIngredient1": "Mısır Nişastası",
    "strIngredient2": "Portakal",
    "strIngredient3": "Portakal Kabuğu",
    "strIngredient4": "Toz Şeker",
    "strIngredient5": "Şeftali",
    "strIngredient6": "Yaban Mersini",
    "strIngredient7": "Kabartma Unu",
    "strIngredient8": "Tereyağı",
    "strIngredient9": "Esmer Şeker",
    "strIngredient10": "Tarçın",
    "strIngredient11": "Süt",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 tatlı kaşığı",
    "strMeasure2": "2 portakalın suyu",
    "strMeasure3": "1 portakalın kabuğu",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "6 şeftali",
    "strMeasure6": "250g",
    "strMeasure7": "200g",
    "strMeasure8": "50g",
    "strMeasure9": "100g",
    "strMeasure10": "1 tatlı kaşığı",
    "strMeasure11": "6 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/1553651/peach-and-blueberry-grunt",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52922",
    "strMeal": "Karides ve Rezene Biski",
    "strDrinkAlternate": null,
    "strCategory": "Yan Yemek",
    "strArea": "Fransız",
    "strInstructions": "Karidesleri soyun, ardından kabukları büyük bir tavada yaklaşık 5 dakika boyunca yağda kızartın. Soğanı, rezene ve havuçları ekleyin ve sebzeler yumuşamaya başlayana kadar yaklaşık 10 dakika pişirin. Şarap ve brendi ekleyin, alkolün uçması için yaklaşık 1 dakika kaynatın, ardından domatesleri, et suyunu ve paprika ekleyin. Kapağını kapatıp 30 dakika kaynamaya bırakın. Bu arada karidesleri doğrayın.\r\nÇorbayı bir çubuk mikseri veya mutfak robotu ile olabildiğince ince bir şekilde pürüzsüz hale getirin, ardından bir süzgeçten geçirin. Süreç boyunca karışımı süzgeçten iyice geçirerek çorbaya kadifemsi bir doku kazandırın.\r\nTemiz bir tencereye geri dökün, karidesleri ekleyin ve 10 dakika pişirin, sonra tekrar pürüzsüz hale gelene kadar çırpın. Bu çorbayı bir gün önceden hazırlayıp soğutabilir veya 1 ay boyunca dondurabilirsiniz. Gece boyunca buzdolabında çözdürün. Servis yaparken, bir tavada kremayla nazikçe ısıtın. Süslemek isterseniz, 8 karidesi biraz tereyağında pişirin. Küçük kaselere koyun ve karidesler ve doğranmış rezene dallarıyla süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg",
    "strTags": "Çorba, Sıcak, Deniz Ürünleri, Kabuklu Deniz Ürünleri",
    "strYoutube": "https://www.youtube.com/watch?v=4thpMbDakgM",
    "strIngredient1": "Kaplan Karidesleri",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Soğan",
    "strIngredient4": "Rezene",
    "strIngredient5": "Havuç",
    "strIngredient6": "Kuru Beyaz Şarap",
    "strIngredient7": "Brendi",
    "strIngredient8": "Doğranmış Domates",
    "strIngredient9": "Balık Suyu",
    "strIngredient10": "Paprika",
    "strIngredient11": "Sıvı Krema",
    "strIngredient12": "Karides",
    "strIngredient13": "",
    "strMeasure1": "450g",
    "strMeasure2": "4 yemek kaşığı",
    "strMeasure3": "1 büyük",
    "strMeasure4": "1 büyük",
    "strMeasure5": "2 doğranmış",
    "strMeasure6": "150ml",
    "strMeasure7": "1 yemek kaşığı",
    "strMeasure8": "400g",
    "strMeasure9": "1L",
    "strMeasure10": "2 tutam",
    "strMeasure11": "150ml",
    "strMeasure12": "8",
    "strSource": "https://www.bbcgoodfood.com/recipes/71600/prawn-and-fennel-bisque",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52930",
    "strMeal": "Pate Chinois",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Etli",
    "strArea": "Kanada",
    "strInstructions": "Büyük bir tuzlu suda patatesleri çok yumuşayana kadar pişirin. Süzün.\r\nBir ezici ile, patatesleri en az 30 ml (2 yemek kaşığı) tereyağı ile iri şekilde ezin. Elektrikli bir mikserle sütle püre haline getirin. Tuz ve karabiber ile tatlandırın. Bir kenara koyun.\r\nFırın rafını ortada olacak şekilde yerleştirin ve fırını 190 °C (375 °F) ısıtın.\r\nBüyük bir tavada, kalan tereyağında soğanı kavurun. Kıymayı ekleyin ve altın rengini alana kadar pişirin. Tuz ve karabiber ile tatlandırın. Ocaktan alın.\r\nKıymayı 20 cm (8 inç) kare bir fırın kabının altına hafifçe bastırarak yerleştirin. Üzerine mısır ve ezilmiş patatesleri ekleyin. Paprika ve maydanoz ile serpin.\r\nYaklaşık 30 dakika pişirin. Sonra broilerda pişirmeye devam edin. 10 dakika soğumaya bırakın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yyrrxr1511816289.jpg",
    "strTags": "Ana Yemek",
    "strYoutube": "https://www.youtube.com/watch?v=QRFqnLkEv3I",
    "strIngredient1": "Patatesler",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Süt",
    "strIngredient4": "Kıyma",
    "strIngredient5": "Soğan",
    "strIngredient6": "Kremalı Mısır",
    "strIngredient7": "Paprika",
    "strIngredient8": "Maydanoz",
    "strIngredient9": "Tuz",
    "strIngredient10": "Karabiber",
    "strMeasure1": "4 su bardağı",
    "strMeasure2": "60ml",
    "strMeasure3": "½ su bardağı",
    "strMeasure4": "450g",
    "strMeasure5": "1 ince doğranmış",
    "strMeasure6": "500ml",
    "strMeasure7": "isteğe göre",
    "strMeasure8": "isteğe göre",
    "strMeasure9": "Bir tutam",
    "strMeasure10": "Bir tutam",
    "strSource": "https://www.ricardocuisine.com/en/recipes/5541-pate-chinois-shepherd--s-pie-",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52932",
    "strMeal": "Pouding Chomeur",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Kanada",
    "strInstructions": "Büyük bir kasede, elektrikli mikserle tereyağını ve şekeri iyice karıştırın.\r\nYumurtaları ve vanilyayı ekleyin ve karıştırın.\r\nBaşka bir kasede un ve kabartma tozunu karıştırın.\r\nUn karışımını ve sütü, tereyağlı karışıma sırayla ekleyin.\r\nYağlanmış 13x9 inçlik bir tepsiye dökün.\r\nMAPLE SOS.\r\nBüyük bir tencerede, şurup, esmer şeker, krema ve tereyağını kaynatın ve sürekli karıştırın.\r\nIsıyı azaltın ve sos biraz azalana kadar 2 dakika nazikçe pişirin.\r\nSosu kekin üzerine nazikçe dökün.\r\n325°F (160°C) sıcaklıkta yaklaşık 35 dakika pişirin ya da kek altın rengi olana kadar pişirin ve kürdanı batırdığınızda temiz çıkana kadar.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg",
    "strTags": "Puding",
    "strYoutube": "https://www.youtube.com/watch?v=WFvj71RZYPc",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Şeker",
    "strIngredient3": "Yumurtalar",
    "strIngredient4": "Vanilya Özütü",
    "strIngredient5": "Un",
    "strIngredient6": "Kabartma Tozu",
    "strIngredient7": "Süt",
    "strIngredient8": "Akçaağaç Şurubu",
    "strIngredient9": "Esmer Şeker",
    "strIngredient10": "Tekli Krema",
    "strIngredient11": "Tereyağı",
    "strMeasure1": "½ su bardağı",
    "strMeasure2": "1 su bardağı",
    "strMeasure3": "2",
    "strMeasure4": "1 çay kaşığı",
    "strMeasure5": "2 su bardağı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "1 ¼ su bardağı",
    "strMeasure8": "1 ½ su bardağı",
    "strMeasure9": "1 ½ su bardağı",
    "strMeasure10": "1 ½ su bardağı",
    "strMeasure11": "1/3 su bardağı",
    "strSource": "http://www.geniuskitchen.com/recipe/pouding-chomeur-poor-mans-pudding-with-maple-syrup-sauce-218797",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53039",
    "strMeal": "Piri-piri tavuk ve lahana salatası",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Portekiz",
    "strInstructions": "ADIM 1\nTüm marine malzemelerini küçük bir mutfak robotunda çekin. Marineyi tavuk üzerine sürün ve oda sıcaklığında 1 saat bekletin.\n\nADIM 2\nFırını 190°C/fan 170°C/gaz 5'te ısıtın. Tavukları bir fırın tepsisine yerleştirin ve 1 saat 20 dakika pişirin. Tavuk dinlendikten sonra üzerine gevşek bir folyo sarın ve 20 dakika dinlendiriniz. Tavuk dinlenirken, lahana salatası malzemelerini karıştırın ve tuzlayın. Tavukları salata, patates kızartması ve soslarla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/hglsbl1614346998.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=_RKwKjskopk",
    "strIngredient1": "Tavuk",
    "strIngredient2": "Kırmızı Biber",
    "strIngredient3": "Sarımsak",
    "strIngredient4": "Zencefil",
    "strIngredient5": "Kuru Kekik",
    "strIngredient6": "Kişniş",
    "strIngredient7": "Paprika",
    "strIngredient8": "Kırmızı Şarap Sirkesi",
    "strIngredient9": "Yağ",
    "strIngredient10": "Kırmızı Soğan",
    "strIngredient11": "Havuç",
    "strIngredient12": "Pancar",
    "strIngredient13": "Lahana",
    "strIngredient14": "Mayonez",
    "strIngredient15": "Yunan Yoğurdu",
    "strIngredient16": "Kırmızı Şarap Sirkesi",
    "strIngredient17": "Kimyon Tohumları",
    "strMeasure1": "1.5kg",
    "strMeasure2": "3 doğranmış",
    "strMeasure3": "2 diş",
    "strMeasure4": "1 tatlı kaşığı",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "1 tatlı kaşığı",
    "strMeasure7": "1 tatlı kaşığı",
    "strMeasure8": "2 yemek kaşığı",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "1 dilimlenmiş",
    "strMeasure11": "2",
    "strMeasure12": "1",
    "strMeasure13": "4 yaprak",
    "strMeasure14": "2 yemek kaşığı",
    "strMeasure15": "2 yemek kaşığı",
    "strMeasure16": "2 yemek kaşığı",
    "strMeasure17": "1 tatlı kaşığı",
    "strSource": "https://www.olivemagazine.com/recipes/family/piri-piri-chicken-and-winter-slaw/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53042",
    "strMeal": "Portekiz prego ekmeği ve yeşil piri-piri sosu",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Portekiz",
    "strInstructions": "ADIM 1\nBifteklerin üzerine sarımsağı sürün, sonra bir sandviç torbasına koyun, zeytinyağı, şarap sirkesi ve maydanoz saplarını ekleyin. Her şeyi karıştırıp, rulo merdanesiyle biftekleri birkaç kez dövün. 1-2 saat bekletin.\n\nADIM 2\nSosu hazırlamak için, tüm malzemeleri bir blenda koyun ve 1 yemek kaşığı su ile pürüzsüz bir hale gelene kadar karıştırın. Bu tarifin fazlasını hazırlayabilirsiniz, bir hafta boyunca hava geçirmez bir kavanozda saklayabilirsiniz.\n\nADIM 3\nYüksek ateşte bir ızgara veya tavayı ısıtın. Bifteklerden sarımsak ve maydanoz saplarını silin, iyice tuzlayın. Biftekleri her iki tarafta 2 dakika pişirin ve bir tabağa dinlenmeye alın. Ciabatta ekmeklerini tabağa koyun, kızarmış tarafı aşağıya gelecek şekilde, herhangi bir sıvıyı emmesi için.\n\nADIM 4\nBifteği dilimleyin, ekmeklerin arasına yeşil sos ve roka ile doldurun.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ewcikl1614348364.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=FbIKfcDEPLA",
    "strIngredient1": "Sarımsak",
    "strIngredient2": "Sığır Eti Filetosu",
    "strIngredient3": "Zeytinyağı",
    "strIngredient4": "Sirke",
    "strIngredient5": "Maydanoz",
    "strIngredient6": "Ciabatta Ekmeği",
    "strIngredient7": "Roka",
    "strIngredient8": "Fesleğen Yaprakları",
    "strIngredient9": "Maydanoz",
    "strIngredient10": "Jalapeno",
    "strIngredient11": "Sirke",
    "strIngredient12": "Yeşil Soğan",
    "strIngredient13": "Sarımsak",
    "strIngredient14": "Toz Şeker",
    "strMeasure1": "1 diş",
    "strMeasure2": "2 küçük",
    "strMeasure3": "2 yemek kaşığı",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "Yapraklar",
    "strMeasure6": "2",
    "strMeasure7": "2 avuç",
    "strMeasure8": "Küçük bir demet",
    "strMeasure9": "Küçük bir demet",
    "strMeasure10": "1",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "2 doğranmış",
    "strMeasure13": "1/2",
    "strMeasure14": "1/2 tatlı kaşığı",
    "strSource": "https://www.olivemagazine.com/recipes/meat-and-poultry/portuguese-prego-with-green-piri-piri/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53081",
    "strMeal": "Patates Salatası (Olivier Salatası)",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "Rus",
    "strInstructions": "Patatesleri ve havuçları küçük, eşit büyüklükte küplere doğrayın.\r\nBunları büyük bir tencereye koyun ve suyla doldurun.\r\nTuz ve sirke ekleyin. Orta yüksek ateşte kaynamaya bırakın, sonra ısıyı orta seviyeye indirip, patatesler pişene kadar, yaklaşık 15 dakika, pişirmeye devam edin. Patatesleri süzün ve oda sıcaklığına kadar soğumaya bırakın.\r\nBu arada, sosis ve turşuları küçük küplere doğrayın, yeşil soğanları doğrayın.\r\nHaşlanmış yumurtaları da küçük küplere doğrayın.\r\nTaze dereotu kullanıyorsanız, onları da doğrayın.\r\nBüyük bir kasede patates, havuç, sosis, turşu, bezelye ve yeşil soğanları karıştırın.\r\nMayonez ve dereotunu ekleyin ve iyice karıştırın.\r\nTuz ve karabiberle tatlandırın. Üzerini streç filmle kapatıp, en az 1 saat buzdolabında bekletin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ebvuir1699013665.jpg",
    "strTags": "salata",
    "strYoutube": "https://www.youtube.com/watch?v=RnsWwHcpKiY",
    "strIngredient1": "Patates",
    "strIngredient2": "Havuç",
    "strIngredient3": "Tuz",
    "strIngredient4": "Beyaz Şarap Sirkesi",
    "strIngredient5": "Yumurtalar",
    "strIngredient6": "Sosis",
    "strIngredient7": "Dereotu",
    "strIngredient8": "Bezelye",
    "strIngredient9": "Soğan",
    "strIngredient10": "Mayonez",
    "strMeasure1": "4",
    "strMeasure2": "3",
    "strMeasure3": "1 yemek kaşığı",
    "strMeasure4": "1/2 yemek kaşığı",
    "strMeasure5": "4",
    "strMeasure6": "200 gr",
    "strMeasure7": "115 gr",
    "strMeasure8": "1 kutu",
    "strMeasure9": "4",
    "strMeasure10": "1 su bardağı",
    "strSource": "https://www.sweetandsavorybyshinee.com/russian-potato-salad/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52783",
    "strMeal": "Fennel Sosisli Rigatoni",
    "strDrinkAlternate": null,
    "strCategory": "Kuzu Eti",
    "strArea": "İtalyan",
    "strInstructions": "Büyük bir tavada 1 yemek kaşığı yağı ısıtın. Sosisleri ekleyin ve orta-yüksek ateşte 10 dakika, sık sık karıştırarak, her tarafı altın rengi olana kadar pişirin. Sosisleri bir tabağa alın, sonra aynı tavaya soğan ve rezene ekleyin ve 15 dakika, arada bir karıştırarak, yumuşayana kadar pişirin; tava kuru hale gelirse, 1 çay kaşığı kadar ekstra yağ ekleyin. Paprika, sarımsak ve rezene tohumlarının yarısını ekleyin, 2 dakika daha pişirin, sonra şarabı dökün ve 30 saniye kaynatın, yarı yarıya azalmasını bekleyin. Domatesleri, şekeri, 100 ml suyu, kızartılmış sosisleri ve yarım çay kaşığı tuzu ekleyin, üzerini kapatın ve 30 dakika kısık ateşte pişirin; 10 dakika sonra kapağını açın ve sos koyulaşana kadar pişirin. Ocağı kapatın, zeytinyağlı zeytinleri ve kalan rezene tohumlarını ekleyin ve servis yapmadan önce bir kenara koyun.\r\nBüyük bir tencereye tuzlu su kaynatın, makarnayı ekleyin ve 12-14 dakika (veya paketin talimatlarına göre) pişirin, al dente olana kadar. Bu arada, sosu tekrar ısıtın. Makarnayı süzün, tencereye geri koyun, 1 yemek kaşığı yağ ekleyin, sonra kâselere bölüştürün.\r\nTüm pesto malzemelerini, fesleğen hariç, küçük bir mutfak robotuna koyun. 1 yemek kaşığı su ekleyin ve pürüzlü bir macun haline gelene kadar karıştırın. Fesleğeni ekleyin, sonra sadece karıştırana kadar çekin (pesto, fesleğen fazla karıştırılmazsa daha iyi bir dokuya sahip olur).\r\nSosun üzerine dökün ve bir kaşık pesto koyun. Üzerine doğranmış rezene dalı serpin, varsa hemen servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qtqvys1468573168.jpg",
    "strTags": "Pasta",
    "strYoutube": "https://www.youtube.com/watch?v=45dpOfESxr8",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "İtalyan rezene sosisleri",
    "strIngredient3": "Soğan",
    "strIngredient4": "Rezene",
    "strIngredient5": "Smoky paprika",
    "strIngredient6": "Sarımsak",
    "strIngredient7": "Rezene tohumu",
    "strIngredient8": "Kırmızı şarap",
    "strIngredient9": "Doğranmış domates",
    "strIngredient10": "Toz şeker",
    "strIngredient11": "Siyah zeytin",
    "strIngredient12": "Rigatoni",
    "strIngredient13": "Pecorino",
    "strIngredient14": "Havyar",
    "strIngredient15": "Sarımsak",
    "strIngredient16": "Zeytinyağı",
    "strIngredient17": "Fesleğen yaprakları",
    "strMeasure1": "2½ yemek kaşığı",
    "strMeasure2": "6, 1.5 cm kalınlığında dilimlenmiş",
    "strMeasure3": "1 büyük, soyulmuş ve doğranmış",
    "strMeasure4": "1, temizlenmiş ve iri doğranmış; dalgalarını garnitür olarak ayırın",
    "strMeasure5": "½ çay kaşığı",
    "strMeasure6": "1 diş, soyulmuş ve dilimlenmiş",
    "strMeasure7": "2 çay kaşığı, hafifçe kavrulmuş ve sonra nazikçe ezilmiş",
    "strMeasure8": "100 ml",
    "strMeasure9": "400 gr konserve",
    "strMeasure10": "½ çay kaşığı",
    "strMeasure11": "50 gr, uzunlamasına ikiye kesilmiş",
    "strMeasure12": "500 gr",
    "strMeasure13": "30 gr, iri kırılmış, 0.5 cm'lik parçalara ayrılmış",
    "strMeasure14": "1, yıkanmış ve kurulanmış",
    "strMeasure15": "1 diş, soyulmuş ve ezilmiş",
    "strMeasure16": "60 ml",
    "strMeasure17": "50 gr, koparılmış",
    "strSource": "http://www.ottolenghi.co.uk/recipes/meat/rigatoni-with-fennel-sausage-sauce-and-pecorino-and-anchovy-pesto-shop",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52809",
    "strMeal": "Recheado Masala Balığı",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Hindistan",
    "strInstructions": "Bütün baharatları, zencefili, sarımsağı, tamarind özü ve kashmiri biberleri, yağı hariç sirkeye batırın.\r\nŞeker ve tuz ekleyin.\r\nAyrıca zerdeçal ekleyin.\r\nTüm malzemeleri güzelce karıştırın ve 35-40 dakika boyunca marine edin.\r\nKarışımı yumuşak ve pürüzsüz olana kadar ezin. Gerekirse daha fazla sirke ekleyin ancak macunun kalın olması gerektiğini unutmayın, bu yüzden sirkeyi buna göre ekleyin. Eğer masala macunu ince olursa, balığa yapışmaz.\r\nBalığın ortasına yarıklar açın ve üst kısmına bazı kesikler yapın. Netlik için balığı aşağıdaki gibi görebilirsiniz.\r\nŞimdi macunu ortasına ve kesiklerin içine doldurun. Balığı tamamen bu macunla kaplayın. Balığı 30 dakika marine edin.\r\nBir tavaya yağ koyun, yağ iyice ısındığında dolgulu uskumruları az yağda kızartın.\r\nHer iki tarafı altın rengini alana kadar kızartın.\r\nRecheado uskumraları salata, lime dilimleri, pilav ve köri ile sıcak olarak servis yapın.\r\nNotlar:\r\n1. Masala macununun kalın olduğundan emin olun, aksi takdirde sonuç iyi olmaz.\r\n2. Eğer kashmiri biberini bulamıyorsanız, bedgi biberleri veya kashmiri kırmızı biber tozu kullanabilirsiniz.\r\n3. Beyaz sirke veya hindistancevizi sirke kullanabilirsiniz.\r\n4. Kalan macun buzdolabında saklanabilir.\r\n5. Tarçın genellikle et veya tavukla kullanıldığı için bu tarçını kullanmamayı tercih edebilirsiniz.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uwxusv1487344500.jpg",
    "strTags": "Balık, Baharatlı",
    "strYoutube": "https://www.youtube.com/watch?v=FXtCris37nE",
    "strIngredient1": "Uskumru",
    "strIngredient2": "Kırmızı Biber",
    "strIngredient3": "Zencefil",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Karabiber",
    "strIngredient6": "Kimyon",
    "strIngredient7": "Zerdeçal",
    "strIngredient8": "Tarçın çubuğu",
    "strIngredient9": "Karafili",
    "strIngredient10": "Kakule",
    "strIngredient11": "Şeker",
    "strIngredient12": "Tamarind topu",
    "strIngredient13": "Sirke",
    "strIngredient14": "Yağ",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "4",
    "strMeasure2": "18 kurutulmuş",
    "strMeasure3": "1 inç",
    "strMeasure4": "8 diş",
    "strMeasure5": "1.5 çay kaşığı",
    "strMeasure6": "1 çay kaşığı",
    "strMeasure7": "½ çay kaşığı",
    "strMeasure8": "",
    "strMeasure9": "4",
    "strMeasure10": "2",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "2 ceviz büyüklüğünde",
    "strMeasure13": "2.5 yemek kaşığı",
    "strMeasure14": "kızartma için",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "http://www.flavorsofmumbai.com/fish-recheado-masala-recipe/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52811",
    "strMeal": "Ribollita",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İtalyan",
    "strInstructions": "Orta ısıda büyük bir tencereye 2 yemek kaşığı yağı koyun. Isındığında, soğanı, havucu, kerevizi ve sarımsağı ekleyin; tuz ve karabiber serpin ve sebzeler yumuşayana kadar, ara ara karıştırarak 5-10 dakika pişirin.\r\nFırını 500 dereceye ısıtın. Fasulyeleri süzün; konserve ise iyice durulayın. Bunları tencereye ekleyin, domatesleri ve suyunu, bulyon ve kekik ile birlikte ekleyin. Kaynamaya bırakın, sonra ateşi kısın ve çorbanın hafifçe kaynamasını sağlayın; kapağı kapalı olarak 15-20 dakika kadar pişirin.\r\nRosemary ve kekik saplarını çıkartın ve karnıbaharı ekleyin. Tadına bakın ve tuzunu ayarlayın. Çorbanın üzerine ekmek dilimlerini koyun, üstü tamamen örtülecek şekilde ve minimum örtüşecek şekilde yerleştirin. Kırmızı soğan dilimlerini serpin, kalan 3 yemek kaşığı yağı gezdirin ve Parmesan peyniri serpin.\r\nTencereyi fırına koyun ve ekmek, soğanlar ve peynir kahverengileşene ve çıtır çıtır olana kadar 10-15 dakika pişirin. (Eğer tencereniz fırın ızgarasına uyuyorsa, üst kısmını burada da kızartabilirsiniz.) Çorbayı ve ekmekleri 4 kâseye paylaştırın ve servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xrrwpx1487347049.jpg",
    "strTags": "Vejetaryen",
    "strYoutube": "https://www.youtube.com/watch?v=BiQUYTBb6eQ",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Soğan",
    "strIngredient3": "Havuç",
    "strIngredient4": "Kereviz",
    "strIngredient5": "Sarımsak",
    "strIngredient6": "Cannellini Fasulyesi",
    "strIngredient7": "Konserve domates",
    "strIngredient8": "Su",
    "strIngredient9": "Rosemary",
    "strIngredient10": "Kekik",
    "strIngredient11": "Kale",
    "strIngredient12": "Tam Tahıllı Ekmek",
    "strIngredient13": "Kırmızı Soğan",
    "strIngredient14": "Parmesan",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "5 yemek kaşığı",
    "strMeasure2": "1 doğranmış",
    "strMeasure3": "1 doğranmış",
    "strMeasure4": "1 dal doğranmış",
    "strMeasure5": "1 yemek kaşığı doğranmış",
    "strMeasure6": "2 su bardağı",
    "strMeasure7": "1",
    "strMeasure8": "4 su bardağı",
    "strMeasure9": "1 taze dal",
    "strMeasure10": "1 taze dal",
    "strMeasure11": "1 pound doğranmış",
    "strMeasure12": "4 kalın dilim",
    "strMeasure13": "1 ince dilimlenmiş",
    "strMeasure14": "½ su bardağı taze rendelenmiş",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://cooking.nytimes.com/recipes/1016052-ribollita",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52941",
    "strMeal": "Kırmızı Fasulye Çorbası",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "Jamaika",
    "strInstructions": "Kuru böbrek fasulyelerini yıkayın ve durulayın, ardından derin bir kaseye su ekleyip üzerini örtün. Unutmayın, fasulyeler suda bekledikçe üç katına kadar büyüyecek, bu yüzden bol su ekleyin. Fasulyeleri en az 2 saat veya bir gece boyunca bekletin. Suda bekleme işlemi bittikten sonra suyu dökün.\n\nKasabınıza tuzlu domuz kuyruklarını 2 inçlik parçalara ayırmasını söyleyin, çünkü bunları normal bir mutfak bıçağıyla kesmek çok zor olacaktır. Yıkayıp bir tencereye su ekleyin ve kaynatın. 20 dakika kaynatın, ardından suyu süzüp tekrar durulayın ve kaynatmaya devam edin. Amaç, domuz kuyruklarının yumuşamasını sağlamak ve içinde bulunan tuzun büyük kısmını temizlemektir.\n\nÇorbayı yapmaya başlayın. Her şeyi tencereye koyun (un ve patates hariç), suyla kaplayın ve yüksek ateşte kaynamaya bırakın. Kaynamaya başladığında, üst kısmındaki köpükleri alın ve atın. Ateşi azaltın ve nazikçe kaynamaya devam edin, fasulyeler yumuşayana ve parçalanmaya başlayana kadar yaklaşık 1 saat 15 dakika pişirin.\n\nŞimdi patatesi (ve ekleyecekseniz, yams vb.) ve hindistancevizi sütünü ekleyin ve 15 dakika daha pişirin.\n\nŞimdi, spinner köftelerini yapmak için hamuru hazırlamaya başlayın. Unu ve suyu (isteğe göre biraz tuz ekleyebilirsiniz) karıştırın ve yumuşak/pürüzsüz bir hamur elde edene kadar yoğurun. 5 dakika dinlendirin, sonra her defasında bir yemek kaşığı kadar alıp avuçlarınız arasında sigara şekli verin.\n\nKöfteleri tencereye ekleyin, karıştırın ve 15 dakika daha kaynar halde pişirmeye devam edin.\n\nBu tarifte tuz eklemedim çünkü tuzlu domuz kuyruklarından kalan tuz bu yemeği yeterince tatlandıracaktır. Ancak tadına bakıp ihtiyaca göre tuz ekleyebilirsiniz. Zamanlama kısmını özetleyelim: Çorbanın temelini 1 saat 15 dakika pişirin veya fasulyeler yumuşayana kadar, sonra patatesi ekleyip 15 dakika pişirin, ardından köfteleri ekleyip 15 dakika daha pişirin. Bu çorba, soğudukça oldukça koyulaşacaktır.\n\nBu tarif, herhangi bir adaya ait geleneksel bir yemek olmasa da, Karayipler, Latin Amerika ve Afrika'da farklı versiyonlarına rastlanabilir. Bu çorbanın kocaman bir kasesi sizi rahatlatacak ve bazıları buna 'etnik yorgunluk' derler. Artakalanları kesinlikle dondurabilir ve başka bir gün tekrar ısıtarak yiyebilirsiniz.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg",
    "strTags": "Çorba,Yan Yemek",
    "strYoutube": "https://www.youtube.com/watch?v=1ogCfDXotMw",
    "strIngredient1": "Böbrek Fasulyesi",
    "strIngredient2": "Havuç",
    "strIngredient3": "Yeşil Soğan",
    "strIngredient4": "Kekik",
    "strIngredient5": "Soğan",
    "strIngredient6": "Karabiber",
    "strIngredient7": "Kırmızı Biber",
    "strIngredient8": "Sarımsak Dişi",
    "strIngredient9": "Yenibahar",
    "strIngredient10": "Sığır Eti",
    "strIngredient11": "Su",
    "strIngredient12": "Patates",
    "strIngredient13": "Beyaz Un",
    "strIngredient14": "Su",
    "strIngredient15": "Hindistancevizi Sütü",
    "strMeasure1": "2 su bardağı",
    "strMeasure2": "1 büyük",
    "strMeasure3": "2 doğranmış",
    "strMeasure4": "4 dal",
    "strMeasure5": "1 doğranmış",
    "strMeasure6": "1/2 çay kaşığı",
    "strMeasure7": "2 doğranmış",
    "strMeasure8": "4 Ezilmiş",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "2 lbs",
    "strMeasure11": "2L",
    "strMeasure12": "4",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": "1/4 su bardağı",
    "strMeasure15": "1 su bardağı",
    "strSource": "http://caribbeanpot.com/caribbean-red-peas-soup/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52942",
    "strMeal": "Fırınlanmış Rezene ve Patlıcanlı Paella",
    "strDrinkAlternate": null,
    "strCategory": "Vegan",
    "strArea": "İspanyol",
    "strInstructions": "1. Fırın tepsisine rezeneyi, patlıcanı, biberi ve kabakları koyun. Üzerine zeytinyağı ekleyin, tuz ve karabiber ile tatlandırın ve sebzeleri yağa bulayın. 20 dakika boyunca fırında pişirin, birkaç kez çevirin, sebzeler neredeyse tamamen pişene kadar ve altın rengini alana kadar.\n\n2. Bu arada, bir paella tavasını veya büyük bir tavayı düşük–orta ateşte ısıtın ve bir miktar zeytinyağı ekleyin. Soğanı 8–10 dakika kadar yumuşayana kadar soteleyin. Ateşi orta düzeye çıkarın ve pirinci, paprika ve safranı ekleyin. Pirinci kızartmaya başlamak için yaklaşık 1 dakika pişirin, sonra beyaz şarabı ekleyin. Şarabı yarı yarıya azaltana kadar pişirin, sonra stoğun üçte ikisini ekleyin. Düşük ateşte kaynamaya bırakın ve 10 dakika pişirin, birkaç kez karıştırın.\n\n3. Dondurulmuş bezelyeleri ekleyin, biraz tuz serpin, ardından fırınlanan sebzeleri nazikçe karıştırarak ekleyin. Kalan stoğu üzerine dökün, limon dilimlerini üstüne yerleştirin ve kapağını kapatın veya alüminyum folyo ile sarın. 10 dakika daha pişirin.\n\n4. Paella tavasının alt kısmında geleneksel kızarmış pirinç tabakasını elde etmek için ateşi yüksek yapın ve hafifçe çıtırdadığını duyana kadar pişirin. Ateşten alın ve 5 dakika dinlendirin, ardından maydanoz serpip servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
    "strTags": "Vegan,Paella",
    "strYoutube": "https://www.youtube.com/watch?v=H5SmjR-fxUs",
    "strIngredient1": "Baby Patlıcan",
    "strIngredient2": "Rezene",
    "strIngredient3": "Kırmızı Biber",
    "strIngredient4": "Kabak",
    "strIngredient5": "Soğan",
    "strIngredient6": "Paella Pirinci",
    "strIngredient7": "Paprika",
    "strIngredient8": "Safran",
    "strIngredient9": "Beyaz Şarap",
    "strIngredient10": "Sebze Stoku",
    "strIngredient11": "Dondurulmuş Bezelye",
    "strIngredient12": "Limon",
    "strIngredient13": "Maydanoz",
    "strIngredient14": "Tuz",
    "strIngredient15": "Karabiber",
    "strMeasure1": "6 küçük",
    "strMeasure2": "4 küçük",
    "strMeasure3": "1 ince dilimlenmiş",
    "strMeasure4": "1 orta boy",
    "strMeasure5": "1 ince doğranmış",
    "strMeasure6": "300g",
    "strMeasure7": "1 çay kaşığı",
    "strMeasure8": "bir tutam",
    "strMeasure9": "200ml",
    "strMeasure10": "700ml",
    "strMeasure11": "100g",
    "strMeasure12": "1 doğranmış",
    "strMeasure13": "Bir avuç",
    "strMeasure14": "bir tutam",
    "strMeasure15": "bir tutam",
    "strSource": "https://www.homestylemag.co.uk/recipe/517/main-courses/roast-fennel-and-aubergine-paella",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53020",
    "strMeal": "Rosół (Polonya Tavuk Çorbası)",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Polonya",
    "strInstructions": "Tavuğu büyük bir güveç tenceresine veya büyük bir çorba tenceresine ekleyin.\nÜzerini suyla kaplayın.\nKaynamaya getirin ve 2 ila 2.5 saat kaynatmaya devam edin, üstteki safsızlıkları alarak berrak bir et suyu elde edin.\nEğer tencereniz yeterince büyükse, sebzeleri ve baharatları son bir saat içinde ekleyin.\nTencereniz yeterince büyük değilse, et ve kemikler tencerenin tamamını dolduruyorsa, eti/kemikleri tam süre boyunca kaynatın, sonra çıkarın ve sebzeleri ve baharatları ayrı bir şekilde pişirin.\nBütün karışımı süzün.\nTavuğu kemiklerinden ayırın, eti büyük parçalara ayırın.\nHavucu dilimleyin.\nTavuğu ve havuçları et suyuna geri ekleyin.\nMakarna varsa, paket talimatlarına göre pişirin.\nMakarna kasesine ekleyin ve ardından sıcak çorbayı dökün.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/lx1kkj1593349302.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=AU60fxyxXGw",
    "strIngredient1": "Tavuk Bagajı",
    "strIngredient2": "Soğan",
    "strIngredient3": "Havuç",
    "strIngredient4": "Pırasa",
    "strIngredient5": "Kereviz",
    "strIngredient6": "Lahana",
    "strIngredient7": "Karabiber Tanesi",
    "strIngredient8": "Yenibahar",
    "strIngredient9": "Defne Yaprağı",
    "strIngredient10": "Maydanoz",
    "strIngredient11": "Dill",
    "strIngredient12": "Karabiber",
    "strIngredient13": "Tuz",
    "strMeasure1": "4 Doğranmış",
    "strMeasure2": "2 büyük",
    "strMeasure3": "5 doğranmış",
    "strMeasure4": "1 doğranmış",
    "strMeasure5": "1 küçük",
    "strMeasure6": "1/4",
    "strMeasure7": "1 bütün",
    "strMeasure8": "1 çay kaşığı",
    "strMeasure9": "2",
    "strMeasure10": "4 dal",
    "strMeasure11": "4 dal",
    "strMeasure12": "1 çay kaşığı",
    "strMeasure13": "1 yemek kaşığı",
    "strSource": "https://polishhousewife.com/rosol-polish-chicken-soup/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52770",
    "strMeal": "Spagetti Bolonez",
    "strDrinkAlternate": null,
    "strCategory": "Dana Eti",
    "strArea": "İtalyan",
    "strInstructions": "Büyük bir tavada soğanı ve yağı orta-yüksek ateşte 3-4 dakika kızartın. Sarımsağı ve kıymayı ekleyin ve her ikisi de kahverengileşene kadar kavurun. Mantarları ve baharatları ekleyin, birkaç dakika daha pişirin.\r\nDomatesleri, et suyu, domates salçası veya ketçap, Worcestershire sosu ve baharatları ekleyin. Kaynamaya başlayınca, ısıyı düşürün, üzerini kapatın ve 30 dakika kadar karıştırarak kısık ateşte pişirin.\r\nBu sırada, spagettiyi büyük bir tencerede tuzlu kaynar suda paket talimatlarına göre pişirin. İyi süzüp sıcak su ile yıkayın, tekrar tencereye koyup biraz zeytinyağı ekleyin ve ardından et sosunu karıştırın. Sıcak kaselere servis yapın ve üzerine parmesan peyniri serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/sutysw1468247559.jpg",
    "strTags": "Makarna,Ekmek",
    "strYoutube": "https://www.youtube.com/watch?v=-gF8d-fitkU",
    "strIngredient1": "soğan",
    "strIngredient2": "zeytinyağı",
    "strIngredient3": "sarımsak",
    "strIngredient4": "düşük yağlı kıyma",
    "strIngredient5": "mantar",
    "strIngredient6": "kuru kekik",
    "strIngredient7": "domates",
    "strIngredient8": "sıcak et suyu",
    "strIngredient9": "domates salçası",
    "strIngredient10": "Worcestershire sosu",
    "strIngredient11": "spagetti",
    "strIngredient12": "parmesan",
    "strIngredient13": null,
    "strIngredient14": null,
    "strIngredient15": null,
    "strIngredient16": null,
    "strIngredient17": null,
    "strIngredient18": null,
    "strIngredient19": null,
    "strIngredient20": null,
    "strMeasure1": "2",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "1 diş",
    "strMeasure4": "500g",
    "strMeasure5": "90g",
    "strMeasure6": "1 tatlı kaşığı",
    "strMeasure7": "400g kutu",
    "strMeasure8": "300ml",
    "strMeasure9": "1 yemek kaşığı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "350g",
    "strMeasure12": "Üstüne",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": null,
    "strMeasure17": null,
    "strMeasure18": null,
    "strMeasure19": null,
    "strMeasure20": null,
    "strSource": null,
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52771",
    "strMeal": "Acılı Arrabiata Penne",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İtalyan",
    "strInstructions": "Büyük bir tencereye suyu kaynatın. Kaynayan suya tuz ekleyin ve ardından makarnayı ekleyin. Paket talimatlarına göre yaklaşık 9 dakika pişirin.\r\nBüyük bir tavada, orta-yüksek ısınınca zeytinyağını ekleyin ve yağın parlamaya başlamasını bekleyin. Sarımsağı ekleyin ve kokusu çıkana kadar 1-2 dakika karıştırarak pişirin. Doğranmış domatesleri, kırmızı pul biberi, İtalyan baharatlarını ve tuz ve karabiberi ekleyin. Kaynamaya başlayınca 5 dakika pişirin. Ocağı kapatıp doğranmış fesleğeni ekleyin.\r\nMakarnayı süzüp sosun içine ekleyin. Parmigiano-Reggiano peyniri serperek ve daha fazla fesleğenle süsleyip sıcak servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg",
    "strTags": "Makarna,Köri",
    "strYoutube": "https://www.youtube.com/watch?v=1IszT_guI08",
    "strIngredient1": "penne rigate",
    "strIngredient2": "zeytinyağı",
    "strIngredient3": "sarımsak",
    "strIngredient4": "doğranmış domates",
    "strIngredient5": "kırmızı pul biber",
    "strIngredient6": "İtalyan baharatları",
    "strIngredient7": "fesleğen",
    "strIngredient8": "Parmigiano-Reggiano",
    "strIngredient9": "",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": null,
    "strMeasure1": "1 pound",
    "strMeasure2": "1/4 su bardağı",
    "strMeasure3": "3 diş",
    "strMeasure4": "1 kutu",
    "strMeasure5": "1/2 tatlı kaşığı",
    "strMeasure6": "1/2 tatlı kaşığı",
    "strMeasure7": "6 yaprak",
    "strMeasure8": "serpiştirme",
    "strMeasure9": "",
    "strMeasure10": "",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": null,
    "strMeasure17": null,
    "strMeasure18": null,
    "strMeasure19": null,
    "strMeasure20": null,
    "strSource": null,
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52784",
    "strMeal": "Fırınlanmış Kabaklı Dumanlı Mercimek Chili",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İngiliz",
    "strInstructions": "Öncelikle kabağı fırınlayın. İnce dilimlere ayırın, üzerine biraz yağ gezdirin ve deniz tuzu serpin. İstediğiniz takdirde üzerine taze adaçayı ekleyebilirsiniz. Kabağı 205°C'de (400°F) 20-30 dakika pişirin, arada bir çevirin ve yumuşayana kadar altın rengi olana kadar pişirin. Soğumasını bekleyin ve küp şeklinde doğrayın.\r\nBu sırada mercimekleri yıkayın ve üzerini geçecek kadar su ekleyin. Kaynamaya başlayınca ısısını düşürün ve kapağı açık şekilde 20-30 dakika kadar pişirin. Yumuşayınca süzün ve kenara koyun.\r\nMercimekler pişerken, orta büyüklükte bir tencerede 1 yemek kaşığı yağı düşük ısıda ısıtın. Soğanları ve pırasayı ekleyin ve 5 dakika kadar, yumuşamaya başlayana kadar pişirin. Ardından sarımsağı, kimyonu ve kişnişi ekleyin, birkaç dakika daha pişirin. Sonra kalan baharatları – paprika, tarçın, pul biber, kakao, Worcestershire sosu, tuz ve kekik ekleyin. Sonrasında doğranmış domatesleri, suyu veya et suyunu ve havuçları ekleyin. Kapağı kapalı şekilde 20 dakika kaynatın, sebzeler yumuşayana kadar ve karışım koyulaşana kadar pişirin. Ara ara karıştırıp sıvı eklemeyi unutmayın.\r\nMercimekleri ve doğranmış kabakları ekleyin. 10 dakika daha pişirin.\r\nJalapeño dilimleri, lime dilimleri, kişniş, yeşil soğanlar ve kaju sour cream ile servis yapın.\r\n\r\nSIMPLE CASHEW SOUR CREAM\r\n\r\n1 Su Bardağı Tuzsuz Çiğ Kajular\r\nBir tutam Deniz Tuzu\r\n1 çay kaşığı Elma Sirkesi\r\nSu\r\n\r\nBir tencereye su ekleyin ve kaynatın. Kaynar suyu kullanarak kajuları en az 4 saat boyunca ıslatın. Alternatif olarak soğuk suyla da bir gece boyunca bekletebilirsiniz, ancak ben daha hızlı bir yöntem olarak kaynar suyu tercih ediyorum.\r\nKajular ıslandıktan sonra süzüp yüksek hızda bir mikserle pürüzsüz bir kıvam alana kadar çırpın. Gerektiği kadar su ekleyin.\r\nBir tutam deniz tuzu ve sirke (veya limon suyu) ekleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/uwxqwy1483389553.jpg",
    "strTags": "Bakliyat",
    "strYoutube": "https://www.youtube.com/watch?v=pKmqawK2Tqs",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Soğan",
    "strIngredient3": "Pırasa",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Kimyon",
    "strIngredient6": "Kişniş",
    "strIngredient7": "Dumanlı Paprika",
    "strIngredient8": "Tarçın",
    "strIngredient9": "Pul Biber",
    "strIngredient10": "Kakao",
    "strIngredient11": "Kuru Kekik",
    "strIngredient12": "Doğranmış Domates",
    "strIngredient13": "Su",
    "strIngredient14": "Havuç",
    "strIngredient15": "Kahverengi Mercimek",
    "strIngredient16": "Deniz Tuzu",
    "strIngredient17": "Kabak",
    "strIngredient18": "Kajular",
    "strIngredient19": "Elma Sirkesi",
    "strIngredient20": "",
    "strMeasure1": "1 yemek kaşığı",
    "strMeasure2": "1",
    "strMeasure3": "1 doğranmış",
    "strMeasure4": "3 diş",
    "strMeasure5": "4 çay kaşığı",
    "strMeasure6": "2 çay kaşığı",
    "strMeasure7": "1 tatlı kaşığı",
    "strMeasure8": "1/2 tatlı kaşığı",
    "strMeasure9": "1 tatlı kaşığı",
    "strMeasure10": "1 tatlı kaşığı",
    "strMeasure11": "1/2 tatlı kaşığı",
    "strMeasure12": "1 kutu",
    "strMeasure13": "3 su bardağı",
    "strMeasure14": "3 doğranmış",
    "strMeasure15": "1 1/2 su bardağı",
    "strMeasure16": "1 tatlı kaşığı",
    "strMeasure17": "1 Küçük",
    "strMeasure18": "1 Su Bardağı",
    "strMeasure19": "1 tatlı kaşığı",
    "strMeasure20": "",
    "strSource": "http://www.wholeheartedeats.com/2016/11/smoky-lentil-chili-squash/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52793",
    "strMeal": "Sticky Toffee Pudding Ultimate",
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Hurmalardan çekirdekleri çıkarın ve küçük küçük doğrayın, bir kaba koyun, üzerine kaynar suyu dökün. Yaklaşık 30 dakika bekletin, soğuyup iyice şişene kadar, sonra biraz çatal ile ezin. Vanilya özütünü karıştırın. Yedi mini puding kabını (her biri yaklaşık 200 ml) yağlayın ve unlayın, sonra bir fırın tepsisine yerleştirin. Fırını 180°C'ye (fanlı 160°C) ısıtın.\r\nHurmlar ıslanırken, pudingleri hazırlayın. Un ve karbonatı karıştırın, yumurtaları ayrı bir kaba çırpın. Büyük bir kapta tereyağını ve şekeri birkaç dakika çırparak kremsi bir hale getirin (karışım şekerden dolayı taneli olacak). Yumurtaları azar azar ekleyin, her seferinde iyice çırpın. Kara pekmezi ekleyin, sonra büyük bir metal kaşıkla unu üçte birini, sonra sütü yarısını karıştırarak ekleyin, fazla çırpmamaya dikkat edin. Kalan un ve sütü ekleyin. Hurma karışımını puding hamuruna ekleyin. Karışım bu noktada biraz kesilmiş gibi görünebilir ve yumuşak, kalın bir hamur gibi olacak. Karışımı kabın içine eşit olarak dökün ve 20-25 dakika pişirin, kabarıp sertleşene kadar.\r\nBu arada, sos için şeker ve tereyağını orta büyüklükte bir tencereye koyun, yarım kremayı ekleyin. Orta ateşte kaynamaya getirin, şeker tamamen eriyene kadar karıştırın. Kara pekmezi ekleyin, ısısını biraz artırın ve karışımın 2-3 dakika boyunca kaynamasına izin verin, ara sıra karıştırarak yakmadığınızdan emin olun. Ocağı kapatın ve kalan kremayı ekleyin.\r\nPudingleri fırından çıkarın. Tencerelerde birkaç dakika bekleyin, sonra küçük bir spatula ile pudingleri kabın kenarlarından gevşetin ve ters çevirin. Şu anda sosla servis edebilirsiniz, ancak birkaç gün boyunca sosla kaplanmış halde bırakırsanız daha yapışkan olacaktır. Bunu yapmak için, sosun yarısını bir veya iki fırın kabına dökün. Pudingleri ters çevirin, kalan sosu üzerine dökün. Sosun bulaşmaması için üzerine gevşek bir folyo tentesi kapatın (soğutmanıza gerek yok).\r\nServis yapmadan önce, fırını 180°C'ye (fanlı 160°C) ısıtın. Pudingi 15-20 dakika veya sos kaynamaya başlayana kadar ısıtın. Sade olarak ya da krema veya muhallebi ile servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xrptpq1483909204.jpg",
    "strTags": "Puding,Tatlı,Kek,Süt Ürünü",
    "strYoutube": "https://www.youtube.com/watch?v=hKq6RbxJHBo",
    "strIngredient1": "Medjool hurması",
    "strIngredient2": "su",
    "strIngredient3": "vanilya özütü",
    "strIngredient4": "kendi kendine kabaran un",
    "strIngredient5": "kabartma tozu",
    "strIngredient6": "yumurta",
    "strIngredient7": "tereyağı",
    "strIngredient8": "demerara şekeri",
    "strIngredient9": "kara pekmez",
    "strIngredient10": "süt",
    "strIngredient11": "dondurma",
    "strIngredient12": "muskovado şekeri",
    "strIngredient13": "tereyağı",
    "strIngredient14": "krema",
    "strIngredient15": "kara pekmez",
    "strMeasure1": "225g",
    "strMeasure2": "175ml Kaynar",
    "strMeasure3": "1 tatlı kaşığı",
    "strMeasure4": "175g",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "2",
    "strMeasure7": "85g",
    "strMeasure8": "140g",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "100ml",
    "strMeasure11": "1 top",
    "strMeasure12": "175g",
    "strMeasure13": "50g",
    "strMeasure14": "225ml",
    "strMeasure15": "1 yemek kaşığı",
    "strSource": "https://www.youtube.com/watch?v=Wytv3bjqJII",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52797",
    "strMeal": "Baharatlı Kuzey Afrika Patates Salatası",
    "strCategory": "Vejetaryen",
    "strArea": "Fas",
    "strInstructions": "Patatesleri haşlayın - patatesleri soğuk suyla bir tencereye koyun ve kaynamaya getirin. 20 dakika kadar kaynatın veya patatesler yumuşayıncaya kadar pişirin. Pişip pişmediğini anlamanın yolu, bıçağınızı patatese batırıp kolayca geçip geçmediğine bakmaktır.\r\nHarissa baharatını, zeytinyağını, tuz ve karabiberi ve limon suyunu küçük bir kasede karıştırın.\r\nPatatesler piştikten sonra suyunu süzün ve patatesleri ikiye bölerek doğrayın.\r\nHarissa karışımını ve yeşil soğanları patateslere ekleyip karıştırın.\r\nBüyük bir salata kasesine roka serin.\r\nPatates karışımını üzerine koyun ve karıştırın.\r\nFeta peynirini, nane yapraklarını ekleyin ve üzerine çam fıstığı serpin.\r\nTuz ve karabiberi damak zevkinize göre ayarlayın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/urtwux1486983078.jpg",
    "strTags": "Vejetaryen,Baharatlı",
    "strYoutube": "https://www.youtube.com/watch?v=zxBzwJvTK4g",
    "strIngredient1": "Küçük Patatesler",
    "strIngredient2": "Harissa Baharatı",
    "strIngredient3": "zeytinyağı",
    "strIngredient4": "Limon",
    "strIngredient5": "Yeşil soğan",
    "strIngredient6": "Roka",
    "strIngredient7": "Feta peyniri",
    "strIngredient8": "Nane",
    "strIngredient9": "Çam fıstığı",
    "strIngredient10": "Tuz",
    "strIngredient11": "Karabiber",
    "strMeasure1": "650g/1lb 8 oz",
    "strMeasure2": "1 tatlı kaşığı",
    "strMeasure3": "2 tatlı kaşığı",
    "strMeasure4": "yarım limonun suyu",
    "strMeasure5": "4",
    "strMeasure6": "150g/6oz",
    "strMeasure7": "80g/3oz",
    "strMeasure8": "20 doğranmış",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "Bir tutam",
    "strMeasure11": "Bir tutam",
    "strSource": "",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52817",
    "strMeal": "Harissa Soslu, Nohutlu ve Kimyonlu Yoğurtlu Sote Patlıcan",
    "strCategory": "Vejetaryen",
    "strArea": "Amerikan",
    "strInstructions": "Yağı 12 inçlik bir tavada yüksek ateşte ısıtın. Patlıcanları ekleyin ve ısısını orta seviyeye düşürün. Patlıcanları çevirerek tuz ve karabiber serpin, her tarafı iyice kahverengileşene kadar pişirin. Patlıcanlar yumuşayıncaya kadar pişirmeye devam edin (kalın kısımları pişirmek için patlıcanları dik duracak şekilde yerleştirebilirsiniz), yaklaşık 20 dakika. Eğer patlıcanlar fazla duman çıkarmaya başlarsa, tavaya biraz su ekleyin.\r\nHarissa, nohut ve domatesleri karıştırın, sonra patlıcanların üzerine ekleyin. Domatesler patlayıp yumuşayana kadar 5 dakika daha pişirin. Tuz ve karabiber ile tatlandırın ve gerekirse su ekleyerek sos kıvamına getirin. Bu sırada yoğurdu ve kimyonu bir kasede karıştırın. Tuz ve karabiber ile tatlandırın.\r\nPatlıcan karışımını maydanoz ile süsleyin, üzerine ekstra zeytinyağı gezdirin ve yoğurtla birlikte servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/yqwtvu1487426027.jpg",
    "strTags": "Vejetaryen",
    "strYoutube": "https://www.youtube.com/watch?v=uYB-1xJp4lg",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Patlıcan",
    "strIngredient3": "Harissa",
    "strIngredient4": "Nohut",
    "strIngredient5": "Kiraz Domatesi",
    "strIngredient6": "Yunan Yoğurdu",
    "strIngredient7": "Kimyon",
    "strIngredient8": "Maydanoz",
    "strMeasure1": "4 yemek kaşığı",
    "strMeasure2": "6 küçük",
    "strMeasure3": "Yarım yemek kaşığı",
    "strMeasure4": "1 kutu",
    "strMeasure5": "2 bardak yarıya bölünmüş",
    "strMeasure6": "1 1/2 bardak",
    "strMeasure7": "1 yemek kaşığı",
    "strMeasure8": "½ bardak",
    "strSource": "http://www.seriouseats.com/2014/09/one-pot-wonders-stovetop-eggplant-harissa-chickpeas-cumin.html",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52823",
    "strMeal": "Somonlu Karidesli Risotto",
    "strCategory": "Deniz Ürünleri",
    "strArea": "İtalyan",
    "strInstructions": "Tereyağını kalın tabanlı bir tavada eritin ve soğanı renk almayacak şekilde yumuşayana kadar pişirin.\r\nPirinci ekleyin ve her taneleri tereyağında kaplanana kadar karıştırın.\r\nŞarabı ekleyin ve hafifçe karıştırarak çekene kadar pişirin.\r\nSıcak et suyunu azar azar ekleyin, her eklediğinizde karıştırın. Pirinç yumuşayıncaya kadar karıştırmaya devam edin.\r\nLimon suyu ve kabuğu ile tuz ve karabiberle tatlandırın. (Somondan gelen tuzlu tat yeterli olabilir, tuz eklemeyebilirsiniz.) Karıştırarak ısıtın.\r\nParmesan peynirini ve mevsim sebzelerini üzerine serpiştirin.\r\nSomonu ızgarada pişirin ve risottoların üzerine yerleştirin, karides ve kuşkonmazla birlikte servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xxrxux1503070723.jpg",
    "strTags": "Balık",
    "strYoutube": "https://www.youtube.com/watch?v=V2PMvBv52IE",
    "strIngredient1": "tereyağı",
    "strIngredient2": "soğan",
    "strIngredient3": "pirinç",
    "strIngredient4": "beyaz şarap",
    "strIngredient5": "sebze suyu",
    "strIngredient6": "limon",
    "strIngredient7": "Karides",
    "strIngredient8": "somon",
    "strIngredient9": "kuşkonmaz",
    "strIngredient10": "karabiber",
    "strIngredient11": "Parmesan",
    "strMeasure1": "50g",
    "strMeasure2": "1 ince doğranmış",
    "strMeasure3": "150g",
    "strMeasure4": "125ml",
    "strMeasure5": "1 litre sıcak",
    "strMeasure6": "1 limonun suyu ve kabuğu",
    "strMeasure7": "240g büyük",
    "strMeasure8": "150g",
    "strMeasure9": "100g haşlanmış kuşkonmaz",
    "strMeasure10": "öğütülmüş",
    "strMeasure11": "50g rendelenmiş",
    "strSource": "http://www.rangemaster.co.uk/rangemaster-owners/recipes-ideas-inspiration/recipes/mains/prawn-and-hot-smoked-salmon-risotto-with-asparagus",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52833",
    "strMeal": "Tuzlu Karamel Cheesecake",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Amerikan",
    "strInstructions": "1) Bisküvileri ve pretzel'ları bir mutfak robotunda doğrayın ve bisküvileri erimiş tereyağıyla karıştırın. Karışımı 8″/20cm derin yuvarlak kalıbın tabanına yayıp iyice bastırın. Kalan tarif için buzdolabında bekletin.\r\n\r\n2) Elektrikli mikser kullanarak krem peynir, vanilya ve pudra şekerini pürüzsüz olana kadar çırpın, sonra karameli ekleyin ve tekrar çırpın. Bu işlem birkaç dakika sürebilir, yarım hızda çırpmanızı öneririm.\r\n\r\n3) Çift kremayı ve deniz tuzunu ekleyin, karışım kalınlaşıp mousse kıvamına gelene kadar 2-3 dakika çırpmaya devam edin. Mikserinizin hızına göre bu işlem 5 dakika sürebilir, ancak sabırlı olmalısınız. Karışım tamamen kabarmalıdır, yoksa iyi bir şekilde katılaşmaz. Mikseri çok hızlı çırpmayın, yoksa karışım bozulur! Bisküvi tabanının üzerine yayın ve gece boyunca buzdolabında bekletin.\r\n\r\n4) Cheesecake'i kalıptan dikkatlice çıkarın ve üzerine süslemeler ekleyin – kalan karameli gezdirin, üzerine toffee popcorn ve pretzel ekleyin!",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xqrwyr1511133646.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=q5dQp3qpmI4",
    "strIngredient1": "Bisküvi",
    "strIngredient2": "Pretzel",
    "strIngredient3": "Tereyağı",
    "strIngredient4": "Krem Peynir",
    "strIngredient5": "Vanilya Özütü",
    "strIngredient6": "Pudra Şekeri",
    "strIngredient7": "Karamel",
    "strIngredient8": "Deniz Tuzu",
    "strIngredient9": "Çift Krem",
    "strIngredient10": "Karamel Sosu",
    "strIngredient11": "Toffee Popcorn",
    "strIngredient12": "Pretzel",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "250g",
    "strMeasure2": "75g",
    "strMeasure3": "135g",
    "strMeasure4": "450g",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "100g",
    "strMeasure7": "150g",
    "strMeasure8": "1 tatlı kaşığı",
    "strMeasure9": "300ml",
    "strMeasure10": "Süsleme için",
    "strMeasure11": "Üstüne ekle",
    "strMeasure12": "Üstüne ekle",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "http://www.janespatisserie.com/2015/11/09/no-bake-salted-caramel-cheesecake/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52836",
    "strMeal": "Deniz Ürünleri Fideuà",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "İspanyol",
    "strInstructions": "Kettle'ı kaynatın. Midyeleri bir süzgece boşaltın ve soğuk su altında yıkayın. Kırık kabukları olanları atın. Her birini muslukla taparak kapalı olanları seçin – açık kalanları atın. Eğer kabuklarda barnaklar ya da ipli sakallı kısımlar varsa, bir çatal bıçağı ile temizleyip kabukları iyice yıkayın. Soğuk, nemli bir bezle örtülüp hazır olana kadar bekletin. Karidesin vücut kısmındaki kabuklarını soyun – başlarını ve kuyruklarını bırakın. Sırtını kesin ve kirli iç organlarını çıkarın. Hazırlanana kadar soğutun.\r\nSaffronu küçük bir bardağa koyun, üzerine 50 ml kaynar suyu dökün ve 10 dakika bekletin. Eğer vermikelli kullanıyorsanız, bunları bir kasede 1 cm uzunluğunda parçalara ayırın.\r\nBir büyük tavada 3 cm derinliğinde ya da 40 cm'lik bir paella tavasında zeytinyağını ısıtın. Soğanı ekleyin ve 5 dakika kadar karıştırarak pişirin. Sarımsağı ekleyin ve 1 dakika daha pişirin, sonra vermikelliyi ekleyin ve ara sıra karıştırarak 5 dakika kadar pişirin, vermikelli kahverengileşene kadar. Paprikayı karıştırın.\r\nOrta ateşte monkfish, kalamar ve saffronu suyu ile birlikte ekleyin, iyi bir şekilde baharatlayın. Malzemeleri tavada düzgün bir şekilde yayarak üzerine sıcak stok ekleyin ve domatesleri serpin. Kaynamaya bırakın, sonra tavayı sıkıca kapatın (veya folyo ile). Isıyı orta seviyeye getirin ve 6 dakika pişirin.\r\nKapağını açın ve kuru üst tabakayı karıştırın. Midyeleri makarnaların içine yerleştirerek, kapakları altta kalacak şekilde ve dik durmasını sağlayın. Karidesleri üstüne yerleştirin, tekrar sıkıca kapatın ve 6 dakika daha veya midyeler açılana kadar, karidesler pembeleşene kadar ve makarna pişene kadar pişirin. Kalan sıvıyı pişirmeyi bitirebilmek için 2-3 dakika daha bekletin (makarnaların yapışmaması için biraz sıvı bırakın). 2-3 dakika bekledikten sonra limon suyunu sıkın ve limon dilimlerini üzerine ekleyin. Servis yapmadan önce maydanoz serpin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wqqvyq1511179730.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=itsFEc8W468",
    "strIngredient1": "Midye",
    "strIngredient2": "Karides",
    "strIngredient3": "Safran",
    "strIngredient4": "Vermikelli",
    "strIngredient5": "Zeytinyağı",
    "strIngredient6": "Soğan",
    "strIngredient7": "Sarımsak",
    "strIngredient8": "Paprika",
    "strIngredient9": "Monkfish",
    "strIngredient10": "Bebek Kalamar",
    "strIngredient11": "Balık Stoku",
    "strIngredient12": "Domates",
    "strIngredient13": "Limon",
    "strIngredient14": "Maydanoz",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "400g",
    "strMeasure2": "8",
    "strMeasure3": "2 tutam",
    "strMeasure4": "350g",
    "strMeasure5": "5 yemek kaşığı",
    "strMeasure6": "1 büyük",
    "strMeasure7": "3 diş",
    "strMeasure8": "2 yemek kaşığı",
    "strMeasure9": "1 kuyruk",
    "strMeasure10": "4",
    "strMeasure11": "650ml",
    "strMeasure12": "2 büyük",
    "strMeasure13": "1 limonun suyu",
    "strMeasure14": "Süsleme",
    "strSource": "https://www.bbcgoodfood.com/recipes/seafood-fideua-paella",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52849",
    "strMeal": "Ispanak & Ricotta Cannelloni",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "İtalyan",
    "strInstructions": "Öncelikle domates sosunu yapın. Büyük bir tavada zeytinyağını ısıtın ve sarımsağı 1 dakika pişirin. Şeker, sirke, domatesler ve baharatları ekleyin ve 20 dakika boyunca karıştırarak pişirin, koyulaşana kadar. Fesleğeni ekleyin ve sosu 2 ya da daha fazla fırın kabına paylaştırın (aşağıda dondurma ipuçlarına bakın). Bir kenara koyun. Mascarpone'yi sütle çırpın ve bir kenara koyun.\r\n\r\nIspanakları büyük bir süzgece koyun ve üzerine kaynar su dökün, sonra soğutmaya bırakın. Soğuduktan sonra fazla suyu sıkın. Ispanakları doğrayıp büyük bir kaseye koyun, üzerine 100g Parmesan ve ricotta ekleyin. Tuz, biber ve muskatla tatlandırın.\r\n\r\nFırını 200°C'ye (fanlı fırında 180°C) ya da gazlı fırında 6 numaraya ayarlayın. Bir krema torbası veya plastik gıda torbası kullanarak dolguyu cannelloni borularına sıkın. Boruları, domates sosunun üzerine yan yana dizin ve mascarpone sosunu üzerine dökün. Parmesan ve mozzarella ile süsleyin. Şimdi cannelloni'yi dondurabilirsiniz ya da pişirip sonra dondurabilirsiniz. 30-35 dakika pişirin, üstü altın rengi olup kabarmalı. Fırından çıkarın ve 5 dakika bekleyin, sonra servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/wspuvp1511303478.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=rYGaEJjyLQA",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Sarımsak",
    "strIngredient3": "Toz Şeker",
    "strIngredient4": "Kırmızı Şarap Sirkesi",
    "strIngredient5": "Doğranmış Domates",
    "strIngredient6": "Fesleğen Yaprakları",
    "strIngredient7": "Mascarpone",
    "strIngredient8": "Süt",
    "strIngredient9": "Parmesan",
    "strIngredient10": "Mozzarella",
    "strIngredient11": "Ispanak",
    "strIngredient12": "Parmesan",
    "strIngredient13": "Ricotta",
    "strIngredient14": "Muskat",
    "strIngredient15": "Cannelloni Fasulyesi",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "3 yemek kaşığı",
    "strMeasure2": "8 diş doğranmış",
    "strMeasure3": "3 yemek kaşığı",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "3 kutu 400g",
    "strMeasure6": "Bir dal",
    "strMeasure7": "2 kutu",
    "strMeasure8": "3 yemek kaşığı",
    "strMeasure9": "85g",
    "strMeasure10": "2 dilimlenmiş",
    "strMeasure11": "1kg",
    "strMeasure12": "100g",
    "strMeasure13": "3 kutu",
    "strMeasure14": "Bir tutam",
    "strMeasure15": "400g",
    "strSource": "https://www.bbcgoodfood.com/recipes/531632/spinach-and-ricotta-cannelloni",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52881",
    "strMeal": "Biftek ve Böbrekli Turta",
    "strDrinkAlternate": null,
    "strCategory": "Sığır Eti",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 220C/425F/Gaz 7'ye ısıtın.\r\nBüyük bir tavada sebze yağını ısıtın ve bifteği her iki tarafı kahverengi olana kadar kızartın. (Bunu parti parti yapmanız gerekebilir.) Kenara alın, ardından böbrekleri aynı tavada her iki tarafını kahverengi yapana kadar kızartın. Soğanları ekleyin ve 3-4 dakika pişirin.\r\nBifteği tavaya geri koyun, üzerine un serpin ve et ve soğanları kaplayın.\r\nTavaya et suyu ekleyin, iyi karıştırın ve kaynamaya getirin.\r\nIsıyı düşürün ve 1½ saat boyunca kapağı açık olarak kısık ateşte pişirin. Eğer sıvı fazla buharlaşırsa, daha fazla et suyu ekleyin.\r\nOcaktan alın. Tuz, karabiber ve Worcestershire sosu ekleyin ve tamamen soğumasını bekleyin. Pişmiş et karışımını bir turta tabağına koyun.\r\nHamuru 5mm/¼ inç kalınlığında ve kullandığınız tabaktan 5cm/2 inç daha büyük olacak şekilde açın.\r\nBir merdane kullanarak hamuru kaldırın ve turta tabağının üzerine yerleştirin. Kenarları kesin ve parmaklarınızla kıvırarak şekil verin.\r\nYüzeyine çırpılmış yumurta karışımını sürün ve altın rengi ve kabarmış olana kadar 30-40 dakika pişirin.\r\nKremalı patates püresi ve buharda pişirilmiş sebzelerle birlikte servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qysyss1511558054.jpg",
    "strTags": "Turta",
    "strYoutube": "https://www.youtube.com/watch?v=oTw5tPt4KmA",
    "strIngredient1": "Yufka Hamuru",
    "strIngredient2": "Yumurta Beyazı",
    "strIngredient3": "Yumurta Sarısı",
    "strIngredient4": "Sebze Yağı",
    "strIngredient5": "Biftek",
    "strIngredient6": "Kuzu Böbreği",
    "strIngredient7": "Soğan",
    "strIngredient8": "Un",
    "strIngredient9": "Biftek Suyu",
    "strIngredient10": "Tuz",
    "strIngredient11": "Karabiber",
    "strIngredient12": "Worcestershire Sosu",
    "strIngredient13": null,
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "300g",
    "strMeasure2": "Çırpılmış",
    "strMeasure3": "Çırpılmış",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "70 ml",
    "strMeasure6": "200g",
    "strMeasure7": "2 doğranmış",
    "strMeasure8": "30g",
    "strMeasure9": "85 ml",
    "strMeasure10": "bir tutam",
    "strMeasure11": "bir tutam",
    "strMeasure12": "Bir damla",
    "strSource": "https://www.bbc.co.uk/food/recipes/steakandkidneypie_73308",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52883",
    "strMeal": "Yapışkan Toffee Puding",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 180C/160C Fan/Gaz 4'e ısıtın. Geniş, sığ bir 1.7 litre/3 pintlik fırın kabını yağlayın.\r\nTereyağı, şeker, yumurtalar, un, kabartma tozu, karbonat ve pekmezi bir karıştırma kabına koyun. Elektrikli el çırpıcısı kullanarak yaklaşık 30 saniye veya karışana kadar çırpın. Sütü yavaşça ekleyin ve tekrar pürüzsüz olana kadar çırpın. Hazırlanan kabın içine dökün. 35-40 dakika kadar veya iyice kabarıp ortası elastik olana kadar pişirin.\r\nSosu yapmak için, tüm malzemeleri bir tavaya koyun ve şeker eriyip tereyağı eriyene kadar kısık ateşte karıştırın. Bir dakika kaynamaya bırakın.\r\nServis yapmak için, sosun yarısını pudingin üzerine dökün. Kremalı ya da dondurmalı servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xqqqtu1511637379.jpg",
    "strTags": "Puding,Kek,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=Wytv3bjqJII",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Muscovado Şekeri",
    "strIngredient3": "Yumurtalar",
    "strIngredient4": "Kendiliğinden Kabaran Un",
    "strIngredient5": "Kabartma Tozu",
    "strIngredient6": "Karbonat",
    "strIngredient7": "Siyah Pekmez",
    "strIngredient8": "Süt",
    "strIngredient9": "Çift Krema",
    "strIngredient10": "Tereyağı",
    "strIngredient11": "Muscovado Şekeri",
    "strIngredient12": "Siyah Pekmez",
    "strIngredient13": "Çift Krema",
    "strIngredient14": "Vanilya Özütü",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "100g",
    "strMeasure2": "175g",
    "strMeasure3": "2 büyük",
    "strMeasure4": "225g",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "1 tatlı kaşığı",
    "strMeasure7": "3 yemek kaşığı",
    "strMeasure8": "275ml",
    "strMeasure9": "servis için",
    "strMeasure10": "100g",
    "strMeasure11": "125g",
    "strMeasure12": "1 yemek kaşığı",
    "strMeasure13": "300ml",
    "strMeasure14": "1 tatlı kaşığı",
    "strSource": "https://www.bbc.co.uk/food/recipes/marys_sticky_toffee_41970",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52886",
    "strMeal": "Spotted Dick",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Un ve tuzu bir kaba koyun. Suet, kuşüzümü, şeker, limon ve portakal kabuğu rendesini ekleyin.\r\n150 ml sütü ekleyin ve gerektikçe daha fazla süt ekleyerek karıştırarak hamur haline getirin.\r\nYaklaşık 20 cm uzunluğunda kalın bir rulo şekline getirin. Büyük bir fırın kağıdına yerleştirin. Hamurun kabarmasına izin verecek şekilde gevşek sarın ve uçlarını bir ip ile bağlayın, sanki bir yılbaşı patlağı gibi.\r\nBüyük bir tencere üzerine bir buharlayıcı yerleştirin, pudingi buharlayıcıya ekleyin, üzerini kapatın ve 1,5 saat buharda pişirin. Ara sıra tencereye su eklemeyi unutmayın.\r\nBuharlandıktan sonra pudingi çıkarın ve bir süre soğumaya bırakın. Fırın kağıdını açın. Dilimleyerek custard ile birlikte servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/xqvyqr1511638875.jpg",
    "strTags": "Meyveli,Puding,Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=fu15XOF-ros",
    "strIngredient1": "Kendiliğinden Kabaran Un",
    "strIngredient2": "Tuz",
    "strIngredient3": "Suet",
    "strIngredient4": "Kuşüzümü",
    "strIngredient5": "Toz Şeker",
    "strIngredient6": "Limon",
    "strIngredient7": "Portakal",
    "strIngredient8": "Süt",
    "strIngredient9": "Custard",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "250g",
    "strMeasure2": "bir tutam",
    "strMeasure3": "125g",
    "strMeasure4": "175g",
    "strMeasure5": "80g",
    "strMeasure6": "1 limon kabuğu rendesi",
    "strMeasure7": "1 portakal kabuğu rendesi",
    "strMeasure8": "150ml",
    "strMeasure9": "servis için",
    "strMeasure10": "",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/2686661/spotted-dick",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52935",
    "strMeal": "Steak Diane",
    "strDrinkAlternate": null,
    "strCategory": "Dana Et",
    "strArea": "Fransız",
    "strInstructions": "Orta-yüksek ateşte 30 cm'lik bir tavada yağı ısıtın. Steakleri tuz ve karabiberle baharatlayın ve tavaya ekleyin; her iki tarafı da kahverengiye dönene kadar pişirin, orta-az pişmiş için yaklaşık 4-5 dakika. Steakleri bir tabağa alın ve kenara koyun.\r\nTavayı yüksek ateşe geri koyun, stoğu ekleyin; yaklaşık 10 dakika boyunca 1⁄2 su bardağına kadar buharlaşana kadar pişirin. Bir kaba dökün ve kenara koyun. Tavayı tekrar ısıtın, tereyağını ekleyin; sarımsak ve arpacık soğanlarını ekleyin, karıştırarak 2 dakika kadar pişirin. Mantarları ekleyin ve karıştırarak pişirin, mantarlar su salıp buharlaştığında ve kahverengileşmeye başladığında yaklaşık 2 dakika daha pişirin. Brandy ekleyin ve bir çakmakla alevlendirin; alev söndüğünde pişirmeye devam edin. Ayırdığınız stoğu, krema, Dijon hardalı, Worcestershire sosu ve acı sosu ekleyin, ardından steakleri tekrar tavaya koyun; 4 dakika boyunca pişirip sosu kalınlaştırın. Steakleri tabaklara alın ve sosun içine maydanoz ve frenk soğanı ekleyip karıştırın; sosu steaklerin üzerine dökün ve servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vussxq1511882648.jpg",
    "strTags": "RomantikYemek, Pahalı, Et, AnaYemek, Peynirli",
    "strYoutube": "https://www.youtube.com/watch?v=9rWZNHkrsNg",
    "strIngredient1": "Kanola Yağı",
    "strIngredient2": "Dana Filetosu",
    "strIngredient3": "Dana Suyu",
    "strIngredient4": "Tereyağı",
    "strIngredient5": "Sarımsak",
    "strIngredient6": "Arpacık Soğanı",
    "strIngredient7": "Mantar",
    "strIngredient8": "Brendi",
    "strIngredient9": "Ağır Krema",
    "strIngredient10": "Dijon Hardalı",
    "strIngredient11": "Worcestershire Sosu",
    "strIngredient12": "Tabasco Sosu",
    "strIngredient13": "Maydanoz",
    "strIngredient14": "Frenk Soğanı",
    "strIngredient15": "Tuz",
    "strIngredient16": "Karabiber",
    "strMeasure1": "2 yemek kaşığı",
    "strMeasure2": "4 parça",
    "strMeasure3": "1 1/2 su bardağı",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "2 diş doğranmış",
    "strMeasure6": "1 orta boy ince doğranmış",
    "strMeasure7": "4 oz",
    "strMeasure8": "¼ su bardağı",
    "strMeasure9": "¼ su bardağı",
    "strMeasure10": "1 yemek kaşığı",
    "strMeasure11": "1 yemek kaşığı",
    "strMeasure12": "Bir tutam",
    "strMeasure13": "1 yemek kaşığı doğranmış",
    "strMeasure14": "1 yemek kaşığı doğranmış",
    "strMeasure15": "damak tadına göre",
    "strMeasure16": "damak tadına göre",
    "strSource": "https://www.saveur.com/article/Recipes/Classic-Steak-Diane",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52936",
    "strMeal": "Tuzlu Balık ve Ackee",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Jamaika",
    "strInstructions": "Tuzlu balık için, tuzlu morina balığını bir gece önceden suya koyun ve birkaç kez suyu değiştirin.\r\nSüzün, ardından balığı büyük bir tencerede taze suyla kaynatın. Tekrar süzün, yeni su ekleyin ve tekrar kaynatın.\r\nYaklaşık beş dakika kadar kaynatın veya balık tamamen pişene kadar. Sonra balığı süzün ve büyük parçalara ayırın. Deri ve kemikleri atın.\r\nDumplingler için, un ve kuzu etiyle bir tutam tuz ve 250 ml suyu karıştırarak bir hamur yapın.\r\nHamuru streç filme sarın ve buzdolabında dinlendirin.\r\nAckee konservesini açın, suyunu süzün ve yıkayın, sonra kenara koyun.\r\nBir tavada bir yemek kaşığı zeytinyağını ısıtın ve soğanı yumuşayana kadar, fakat kahverengileşmeden pişirin.\r\nBaharatları, tuzu, acı sosu ve dilimlenmiş biberleri ekleyin ve biberler yumuşayana kadar pişirmeye devam edin.\r\nDoğranmış domatesleri ekleyin, ardından tuzlu balığı ve karıştırın. Son olarak, ackee'yi çok dikkatli bir şekilde ekleyin ve kaynamaya bırakın.\r\nYemek servise hazır olmadan hemen önce, bir tavada yaklaşık 1 cm sıvı yağ ısıtın ve kızgın olana kadar pişirin.\r\nDumpling hamurunu ceviz büyüklüğünde toplar haline getirin ve altın rengi olana kadar kızartın. (Dikkat: sıcak yağ tehlikeli olabilir. Tavanın başından ayrılmayın.)\r\nDumplingleri kağıt havluyla süzün ve tuzlu balık ve ackee ile birlikte servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/vytypy1511883765.jpg",
    "strTags": "Özellik",
    "strYoutube": "https://www.youtube.com/watch?v=nbfNyZbdn2I",
    "strIngredient1": "Tuzlu Morina Balığı",
    "strIngredient2": "Ackee",
    "strIngredient3": "Soğan",
    "strIngredient4": "Paprika",
    "strIngredient5": "Köri Tozu",
    "strIngredient6": "Jerusalem Enginarı",
    "strIngredient7": "Acı Sos",
    "strIngredient8": "Kırmızı Biber",
    "strIngredient9": "Sarı Biber",
    "strIngredient10": "Domates",
    "strIngredient11": "Tuz",
    "strIngredient12": "Karabiber",
    "strIngredient13": "Kabartma Tozu",
    "strIngredient14": "Süet",
    "strIngredient15": "Tuz",
    "strIngredient16": "Zeytinyağı",
    "strMeasure1": "450g",
    "strMeasure2": "400g",
    "strMeasure3": "1 doğranmış",
    "strMeasure4": "1 tatlı kaşığı",
    "strMeasure5": "2 tatlı kaşığı",
    "strMeasure6": "2 tatlı kaşığı",
    "strMeasure7": "1 tatlı kaşığı",
    "strMeasure8": "1 dilimlenmiş",
    "strMeasure9": "1 dilimlenmiş",
    "strMeasure10": "200g",
    "strMeasure11": "damak tadına göre",
    "strMeasure12": "damak tadına göre",
    "strMeasure13": "250g",
    "strMeasure14": "30g",
    "strMeasure15": "bir tutam",
    "strMeasure16": "kızartmak için",
    "strSource": "https://www.bbc.co.uk/food/recipes/saltfish__ackee_with_64803",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52949",
    "strMeal": "Tatlı ve Ekşi Domuz Eti",
    "strDrinkAlternate": null,
    "strCategory": "Domuz Eti",
    "strArea": "Çin",
    "strInstructions": "Hazırlık\r\n1. Yumurtayı bir kaba kırın. Yumurta beyazı ve sarısını ayırın.\r\nTatlı ve Ekşi Domuz Eti\r\n2. Domuz etini şeritler halinde kesin.\r\n3. Marine için tuz, bir tatlı kaşığı nişasta, iki tatlı kaşığı soya sosu ve bir yumurta beyazı ekleyin.\r\n4. Domuz etini yaklaşık 20 dakika marine edin.\r\n5. Kalan nişastayı bir kaba koyun. Biraz su ve sirke ekleyin ve nişastalı bir sos hazırlayın.\r\nTatlı ve Ekşi Domuz Eti\r\nPişirme Talimatları\r\n1. Wok tavaya yemeklik yağ ekleyin ve 190°C'ye kadar ısıtın (375°F). Marine edilmiş domuz etini ekleyin ve kahverengileşene kadar kızartın. Pişmiş eti wok'tan alın ve tabağa koyun.\r\n2. Tavada biraz yağ bırakın. Domates sosu ve beyaz şekeri ekleyin ve yağ ve sos tamamen birleşene kadar ısıtın.\r\n3. Tavaya biraz su ekleyin ve tatlı ekşi sosu iyice ısıttıktan sonra domuz etini ekleyin.\r\n4. Nişastalı sosu ekleyin. Tüm malzemeleri karıştırarak, domuz eti ve sos iyice karışana kadar pişirin.\r\n5. Bir tabakta servis yapın ve dekorasyon için kişniş ekleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1529442316.jpg",
    "strTags": "Tatlı",
    "strYoutube": "https://www.youtube.com/watch?v=mdaBIhgEAMo",
    "strIngredient1": "Domuz Eti",
    "strIngredient2": "Yumurta",
    "strIngredient3": "Su",
    "strIngredient4": "Tuz",
    "strIngredient5": "Şeker",
    "strIngredient6": "Soya Sosu",
    "strIngredient7": "Nişasta",
    "strIngredient8": "Domates Püresi",
    "strIngredient9": "Sirke",
    "strIngredient10": "Kişniş",
    "strMeasure1": "200g",
    "strMeasure2": "1",
    "strMeasure3": "Bir kaç damla",
    "strMeasure4": "1/2 tatlı kaşığı",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "10g",
    "strMeasure7": "10g",
    "strMeasure8": "30g",
    "strMeasure9": "10g",
    "strMeasure10": "Bir kaç damla",
    "strSource": "https://www.chinahighlights.com/travelguide/chinese-food/cooking/sweet-sour-pork.htm",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52950",
    "strMeal": "Szechuan Dana Et",
    "strDrinkAlternate": null,
    "strCategory": "Dana Et",
    "strArea": "Çin",
    "strInstructions": "ADIM 1 - DANA ETİ MARİNELİYOR\r\nBir kaba dana etini, tuz, susam yağı, beyaz biber, yumurta beyazı, 2 yemek kaşığı mısır nişastası ve 1 yemek kaşığı yağı ekleyin.\r\nADIM 2 - SOTELEME\r\nİlk olarak, dana etini 2 yemek kaşığı yağ ile altın rengi olana kadar pişirin.\r\nDana etini kenara alın.\r\nBir wok'ta 1 yemek kaşığı yağ, doğranmış zencefil, doğranmış sarımsak ekleyin ve birkaç saniye karıştırarak soteleyin.\r\nSonra tüm sebzeleri ekleyin ve şeri şarap ve 1 su bardağı suyu ekleyin.\r\nSosu hazırlamak için, istiridye sosu, acı biber sosu ve şekeri ekleyin.\r\nPişmiş dana etini ve 1 yemek kaşığı soya sosunu ekleyin.\r\nSosun kıvamını artırmak için, 1 yemek kaşığı mısır nişastası ve 2 yemek kaşığı suyu karıştırıp, karışımı wok'a ekleyin ve karıştırarak pişirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=SQGZqZYz7Ms",
    "strIngredient1": "Dana Et",
    "strIngredient2": "Tuz",
    "strIngredient3": "Susam Yağı",
    "strIngredient4": "Karabiber",
    "strIngredient5": "Yumurta Beyazı",
    "strIngredient6": "Nişasta",
    "strIngredient7": "Yağ",
    "strIngredient8": "Zencefil",
    "strIngredient9": "Sarımsak",
    "strIngredient10": "Soğan",
    "strIngredient11": "Havuç",
    "strIngredient12": "Yeşil Biber",
    "strIngredient13": "Kereviz",
    "strIngredient14": "Mantar",
    "strIngredient15": "Şarap",
    "strIngredient16": "Su",
    "strIngredient17": "İstiridye Sosu",
    "strIngredient18": "Acı Sos",
    "strIngredient19": "Şeker",
    "strIngredient20": "Soya Sosu",
    "strMeasure1": "1/2 lb",
    "strMeasure2": "1/2 tatlı kaşığı",
    "strMeasure3": "1 tatlı kaşığı",
    "strMeasure4": "Bir tutam",
    "strMeasure5": "1",
    "strMeasure6": "3 yemek kaşığı",
    "strMeasure7": "4 yemek kaşığı",
    "strMeasure8": "1 tatlı kaşığı",
    "strMeasure9": "1 tatlı kaşığı",
    "strMeasure10": "3/4 su bardağı",
    "strMeasure11": "1/2 su bardağı",
    "strMeasure12": "3/4 su bardağı",
    "strMeasure13": "1 su bardağı",
    "strMeasure14": "1 su bardağı",
    "strMeasure15": "1 yemek kaşığı",
    "strMeasure16": "1 su bardağı",
    "strMeasure17": "1 yemek kaşığı",
    "strMeasure18": "1/2 tatlı kaşığı",
    "strMeasure19": "1 tatlı kaşığı",
    "strMeasure20": "1 yemek kaşığı",
    "strSource": "https://sueandgambo.com/pages/szechuan-beef",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },

  {
    "idMeal": "52953",
    "strMeal": "Karidesli Chow Fun",
    "strCategory": "Deniz Ürünleri",
    "strArea": "Çin",
    "strInstructions": "ADIM 1 - PIRINÇ NOODLELARINI ISLATIN\nPirinç noodlelarını yumuşayana kadar gece boyunca ıslatın.\nADIM 2 - PIRINÇ NOODLELARINI HAŞLAYIN\nNoodleları 10-15 dakika haşlayın ve ardından soğuk su ile durulayarak pişme sürecini durdurun.\nADIM 3 - KARİDESİ MARİNE EDİN\nBir kaseye karidesleri, yumurtayı, 1 tutam beyaz biberi, 1 tatlı kaşığı susam yağı, 1 yemek kaşığı mısır nişastasını ve 1 yemek kaşığı yağı ekleyin.\nKarıştırarak iyice karıştırın.\nADIM 4 - SOTE EDİN\nBir wok tavaya 2 yemek kaşığı yağ ekleyin, karidesleri ekleyin ve altın rengi olana kadar soteleyin.\nKaridesleri bir kenara koyun.\nAynı wok tavaya 1 yemek kaşığı yağ ekleyin, ardından doğranmış sarımsak, zencefil ve tüm sebzeleri ekleyin.\nNoodleları wok tavaya ekleyin.\nArdından sherry yemeklik şarap, istiridye sosu, şeker, sirke, susam yağı, 1 tutam beyaz biber ve soya sosu ekleyin.\nKaridesleri geri ekleyin.\nSosu koyulaştırmak için bir kaseye 1 yemek kaşığı mısır nişastası ve 2 yemek kaşığı suyu çırpın ve yavaşça sote karışımına ekleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1529445434.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=wzaTcpoFEaY",
    "strSource": "https://sueandgambo.com/pages/shrimp-chow-fun",
    "strIngredient1": "Pirinç Noodleları",
    "strIngredient2": "Karides",
    "strIngredient3": "Yumurta",
    "strIngredient4": "Biber",
    "strIngredient5": "Susam Yağı",
    "strIngredient6": "Mısır Nişastası",
    "strIngredient7": "Yağ",
    "strIngredient8": "Doğranmış Sarımsak",
    "strIngredient9": "Zencefil",
    "strIngredient10": "Soğan",
    "strIngredient11": "Fasulye Filizleri",
    "strIngredient12": "Yeşil Soğanlar",
    "strIngredient13": "Yemeklik Şarap",
    "strIngredient14": "İstiridye Sosu",
    "strIngredient15": "Şeker",
    "strIngredient16": "Sirke",
    "strIngredient17": "Soya Sosu",
    "strMeasure1": "1/2 paket",
    "strMeasure2": "8 oz",
    "strMeasure3": "1/2",
    "strMeasure4": "Bir tutam",
    "strMeasure5": "2 çay kaşığı",
    "strMeasure6": "2 yemek kaşığı",
    "strMeasure7": "4 yemek kaşığı",
    "strMeasure8": "1 tatlı kaşığı",
    "strMeasure9": "1 tatlı kaşığı",
    "strMeasure10": "1/2 su bardağı",
    "strMeasure11": "1 su bardağı",
    "strMeasure12": "1/2 su bardağı",
    "strMeasure13": "1 yemek kaşığı",
    "strMeasure14": "1 yemek kaşığı",
    "strMeasure15": "1/2 yemek kaşığı",
    "strMeasure16": "1/2 yemek kaşığı",
    "strMeasure17": "1 yemek kaşığı"
  },
  {
    "idMeal": "52960",
    "strMeal": "Somonlu Avokado Salatası",
    "strCategory": "Deniz Ürünleri",
    "strArea": "İngiliz",
    "strInstructions": "Somonu baharatlayın ve yağ ile ovun. Sos malzemelerini karıştırın. Avokadoları ortadan ikiye kesin, çekirdeklerini çıkarın, kabuklarını soyun ve dilimleyin. Salatayı, avokadoyu ve salatalığı dörde ayırıp dilimleyin. Salatayı, avokadoyu ve salatalığı dört tabağa bölün ve sosun yarısını üzerine gezdirin.\nBir tavada ısıtın. Somonu ekleyin ve her iki tarafını 3-4 dakika kızartın, içi hala nemli olmalı. Her tabağa bir somon filetosu koyun ve kalan sosu üzerine gezdirin. Sıcak servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1549542994.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=FJiu2S0Xap0",
    "strSource": "https://www.bbcgoodfood.com/recipes/4521/salmon-avocado-and-cucumber-salad",
    "strIngredient1": "Somon",
    "strIngredient2": "Avokado",
    "strIngredient3": "Salatalık",
    "strIngredient4": "Ispanak",
    "strIngredient5": "Nane",
    "strIngredient6": "Limon",
    "strIngredient7": "Bal",
    "strIngredient8": "Zeytinyağı",
    "strMeasure1": "400g",
    "strMeasure2": "3",
    "strMeasure3": "1",
    "strMeasure4": "400g",
    "strMeasure5": "4 yemek kaşığı",
    "strMeasure6": "1 limonun kabuğu ve suyu",
    "strMeasure7": "2 çay kaşığı",
    "strMeasure8": "3 yemek kaşığı"
  },
  {
    "idMeal": "52962",
    "strMeal": "Somonlu Yumurta Benedict",
    "strCategory": "Kahvaltı",
    "strArea": "Amerikan",
    "strInstructions": "İlk olarak Hollandaise sosunu yapın. Limon suyu ve sirkeyi küçük bir kaba koyun, yumurta sarılarını ekleyin ve bir balon çırpıcı ile hafif ve köpüklü olana kadar çırpın. Kaseyi kaynar su dolu bir tencerenin üzerine yerleştirin ve karışım koyulaşana kadar çırpın. Yağı yavaşça eklerken sürekli çırpın, karışım ayrılmaya başlarsa bir kaç dakika ara verin. Baharatlayın ve sıcak tutun.\nYumurtaları haşlamak için büyük bir tencerede suyu kaynatın ve sirkeyi ekleyin. Isıyı düşürün ve suyu hafif kaynatmaya bırakın. Suya bir çırpma hareketi yaparak yumurtaları teker teker ekleyin. Her birini yaklaşık 4 dakika pişirin, sonra delikli bir kaşıkla çıkarın.\nEnglish muffinleri hafifçe kızartın ve tereyağı sürün, ardından her yarım muffin üzerine somon dilimleri koyun. Üzerine bir yumurta koyun, Hollandaise sosu dökün ve doğranmış frenk soğanı ile süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1550440197.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=Woiiet4vQ58",
    "strSource": "https://www.bbcgoodfood.com/recipes/73606/eggs-benedict-with-smoked-salmon-and-chives",
    "strIngredient1": "Yumurtalar",
    "strIngredient2": "Beyaz Şarap Sirkesi",
    "strIngredient3": "English Muffin",
    "strIngredient4": "Tereyağı",
    "strIngredient5": "Füme Somon",
    "strIngredient6": "Limon Suyu",
    "strIngredient7": "Beyaz Şarap Sirkesi",
    "strIngredient8": "Yumurta Sarıları",
    "strIngredient9": "Tuzsuz Tereyağı",
    "strMeasure1": "4",
    "strMeasure2": "2 yemek kaşığı",
    "strMeasure3": "2",
    "strMeasure4": "Servis için",
    "strMeasure5": "8 dilim",
    "strMeasure6": "2 çay kaşığı",
    "strMeasure7": "2 çay kaşığı",
    "strMeasure8": "3 yumurta sarısı",
    "strMeasure9": "125g"
  },
  {
    "idMeal": "52963",
    "strMeal": "Şakşuka",
    "strCategory": "Vejetaryen",
    "strArea": "Mısır",
    "strInstructions": "Bir tavada yağı ısıtın, soğanı, acı biberi, sarımsağı ve kişniş saplarını 5 dakika yumuşayana kadar pişirin. Domates ve şekeri ekleyin, sonra 8-10 dakika kaynatın ve koyulaşıncaya kadar pişirin. 1 ay kadar dondurulabilir.\nBüyük bir kaşık ile sosta 4 çukurluk yer açın, her birine bir yumurta kırın. Tavanın üzerini kapatın, düşük ısıda 6-8 dakika kadar pişirin, yumurtalar istediğiniz kıvama geldiğinde tavanın altını kapatın. Üzerine kişniş yaprakları serpin ve kabuklu ekmekle servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/g373701551450225.jpg",
    "strYoutube": "https://www.youtube.com/watch?v=C-3_jYrfdBU",
    "strSource": "https://www.bbcgoodfood.com/recipes/7573/spicy-tomato-baked-eggs",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Kırmızı Soğan",
    "strIngredient3": "Kırmızı Biber",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Kişniş",
    "strIngredient6": "Kiraz Domates",
    "strIngredient7": "Toz Şeker",
    "strIngredient8": "Yumurtalar",
    "strIngredient9": "Feta Peyniri",
    "strMeasure1": "1 yemek kaşığı",
    "strMeasure2": "2 doğranmış",
    "strMeasure3": "1 ince doğranmış",
    "strMeasure4": "1 diş",
    "strMeasure5": "Doğranmış",
    "strMeasure6": "800g",
    "strMeasure7": "1 yemek kaşığı",
    "strMeasure8": "4",
    "strMeasure9": "Serpiştirilmiş"
  },

  {
    "idMeal": "52964",
    "strMeal": "Füme Morina Balıklı Kedgeree",
    "strDrinkAlternate": null,
    "strCategory": "Kahvaltı",
    "strArea": "Hindistan",
    "strInstructions": "Büyük bir tencerede 50g tereyağını eritin, 1 ince doğranmış orta boy soğanı ekleyin ve orta ateşte 5 dakika kadar yumuşayana kadar pişirin, ancak kahverengileşmemeli.\r\n\r\n3 adet kabuklu kakule, ¼ çay kaşığı zerdeçal, 1 küçük tarçın çubuğu ve 2 defne yaprağını ekleyin, sonra 1 dakika pişirin.\r\n\r\n450g basmati pirinci ekleyin ve tüm pirinç baharatlı tereyağına iyice bulanıncaya kadar karıştırın.\r\n\r\n1 litre tavuk veya balık suyu ekleyin, ½ çay kaşığı tuz koyun ve kaynamaya bırakın, bir kez karıştırın ve pirinç tencerenin dibine yapışmasın diye dikkatlice karıştırın. Üzerini sıkıca kapatın, ateşi kısın ve 12 dakika boyunca çok düşük ısıda pişirin.\r\n\r\nBu arada, büyük bir tavada suyu kaynatın. 750g morina balığı filetolarını ekleyin ve 4 dakika kadar kaynatın, balık piştiğinde bir tabağa alın ve soğumasını bekleyin.\r\n\r\n3 yumurtayı 8 dakika haşlayın.\r\n\r\nBalığı didikleyin, derisini ve kemiklerini atın. Yumurtaları süzün, hafifçe soğutun ve doğrayın.\r\n\r\nPirincin üzerini açın ve defne yapraklarını, tarçın çubuğunu ve kakuleyi isterseniz çıkarın. Balığı ve doğranmış yumurtayı nazikçe karıştırın, tekrar kapatın ve 2-3 dakika kadar ısıtın.\r\n\r\nSon olarak, 3 yemek kaşığı doğranmış taze maydanozu neredeyse tamamını karıştırın ve tuz ve karabiber ile tatlandırın. Kalan maydanozu serpin ve 1 limon dilimleriyle süsleyerek servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
    "strTags": "Brunch,Fish,Fusion",
    "strYoutube": "https://www.youtube.com/watch?v=QqdzDCWS4gQ",
    "strIngredient1": "Tereyağı",
    "strIngredient2": "Soğan",
    "strIngredient3": "Kakule",
    "strIngredient4": "Zerdeçal",
    "strIngredient5": "Tarçın Çubuğu",
    "strIngredient6": "Defne Yaprağı",
    "strIngredient7": "Basmati Pirinci",
    "strIngredient8": "Tavuk Suyu",
    "strIngredient9": "Füme Morina",
    "strIngredient10": "Yumurta",
    "strIngredient11": "Maydanoz",
    "strIngredient12": "Limon",
    "strMeasure1": "50g",
    "strMeasure2": "1 doğranmış",
    "strMeasure3": "3 Kabuk",
    "strMeasure4": "1/4 çay kaşığı",
    "strMeasure5": "1 küçük",
    "strMeasure6": "Taze dal",
    "strMeasure7": "450g",
    "strMeasure8": "1 Litre",
    "strMeasure9": "750g",
    "strMeasure10": "3",
    "strMeasure11": "3 yemek kaşığı doğranmış",
    "strMeasure12": "1 doğranmış",
    "strSource": "https://www.bbcgoodfood.com/recipes/2256/smoked-haddock-kedgeree"
  },
  {
    "idMeal": "52980",
    "strMeal": "Stamppot",
    "strDrinkAlternate": null,
    "strCategory": "Domuz Eti",
    "strArea": "Hollanda",
    "strInstructions": "Patatesleri yıkayıp soyun ve eşit pişmesi için benzer büyüklükte parçalara ayırın.\r\n\r\nBüyük bir çorba tenceresinde, patatesleri ve defne yapraklarını tuzlu suda 20 dakika kaynatın. Defne yapraklarını atın.\r\n\r\nHazır kesilmiş kıvırcık kara lahana kullanmıyorsanız, kara lahanayı soğuk su altında iyice yıkayın. Sert sapları ve kahverengi yaprakları atın. Keskin bir bıçakla kara lahanayı ince ince doğrayın.\r\n\r\nŞallotları soyup doğrayın.\r\n\r\nBir tavada 1 yemek kaşığı tereyağını eritin ve şallotları birkaç dakika soteleyin, ardından kara lahanayı ve 2 yemek kaşığı suyu ekleyin. Baharatlayın ve yaklaşık 10 dakika, yumuşayana kadar pişirin.\r\n\r\nSütü ocakta veya mikrodalgada ısıtın.\r\n\r\nPatatesleri süzün, mutfak havlusu ile kurulayın ve patates ezici veya ricer kullanarak ezin. Sıcak sütü ve kalan tereyağını hızlıca ekleyin. Muskat, tuz ve karabiberle tatlandırın.\r\n\r\nPişmiş kara lahanayı pişmiş patates karışımına karıştırın.\r\n\r\nDumanlı sosis dilimleriyle üstünü süsleyin ve sıcak olarak en sevdiğiniz hardal veya sos ile servis yapın.\r\n\r\nAfiyet olsun!",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/hyarod1565090529.jpg",
    "strTags": "Savory,Kahvaltı",
    "strYoutube": "https://www.youtube.com/watch?v=hTrSXryX31A",
    "strIngredient1": "Patates",
    "strIngredient2": "Defne Yaprağı",
    "strIngredient3": "Şallot",
    "strIngredient4": "Tereyağı",
    "strIngredient5": "Kara Lahana",
    "strIngredient6": "Sosis",
    "strIngredient7": "Süt",
    "strIngredient8": "Muskat",
    "strIngredient9": "Tuz",
    "strIngredient10": "Karabiber",
    "strMeasure1": "1.5kg",
    "strMeasure2": "2 yaprak",
    "strMeasure3": "2",
    "strMeasure4": "3 yemek kaşığı",
    "strMeasure5": "750g",
    "strMeasure6": "2",
    "strMeasure7": "500ml",
    "strMeasure8": "Rendelenmiş",
    "strMeasure9": "Bir tutam",
    "strMeasure10": "Bir tutam",
    "strSource": "https://www.thespruceeats.com/stamppot-with-curly-kale-and-rookworst-1128837"
  },
  {
    "idMeal": "52981",
    "strMeal": "Snert (Hollanda Bezelye Çorbası)",
    "strDrinkAlternate": null,
    "strCategory": "Yan Yemek",
    "strArea": "Hollanda",
    "strInstructions": "Malzemeleri hazırlayın.\r\n\r\nBüyük bir çorba tenceresinde, suyu, bezelyeleri, domuz pastırması veya bacon, domuz pirzola ve bulyon küpünü kaynatın. Isıyı düşürüp kısık ateşte 45 dakika pişirin, ara ara karıştırın ve oluşan köpüğü alın.\r\n\r\nDomuz pirzolasını çıkarın, kemiklerini ayırın ve eti ince dilimler halinde kesin. Kenara alın.\r\n\r\nÇorbayı kaynatmaya devam edin ve ardından kereviz, havuç, patates, soğan, pırasa ve keleriği ekleyin. Tekrar kaynamaya bırakın, ateşi kısıp 30 dakika boyunca pişirin. Malzemeler tencerenin dibine yapışmaya başlarsa biraz su ekleyin.\r\n\r\nSosisleri son 15 dakikada ekleyin. Sebzeler yumuşadığında, pastırma ve dumanlı sosisleri çıkarın, ince dilimleyin ve kenara alın.\r\n\r\nPürüzsüz bir kıvam tercih ediyorsanız, çorbayı el mikseri ile püre yapın. Tuz ve karabiberle tatlandırın. Etleri tekrar çorbaya ekleyin ve bazı sosis dilimlerini ayırın.\r\n\r\nÇorbayı ısıtılmış kaselere veya tabaklara dökün, üstüne sosis dilimleri ve doğranmış kereviz yaprağı serpiştirerek servis yapın.\r\n\r\nAfiyet olsun!",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/9ptx0a1565090843.jpg",
    "strTags": "Çorba,Kek",
    "strYoutube": "https://www.youtube.com/watch?v=5YV0sJLtLt8",
    "strIngredient1": "Su",
    "strIngredient2": "Bezelye",
    "strIngredient3": "Domuz Eti",
    "strIngredient4": "Sebze Bulyon Küpü",
    "strIngredient5": "Kereviz",
    "strIngredient6": "Havuç",
    "strIngredient7": "Patates",
    "strIngredient8": "Soğan",
    "strIngredient9": "Pırasa",
    "strIngredient10": "Keleriği",
    "strIngredient11": "Sosis",
    "strMeasure1": "2L",
    "strMeasure2": "300g",
    "strMeasure3": "100g",
    "strMeasure4": "1",
    "strMeasure5": "2",
    "strMeasure6": "2",
    "strMeasure7": "1 büyük",
    "strMeasure8": "1 küçük",
    "strMeasure9": "1 küçük",
    "strMeasure10": "1 su bardağı",
    "strMeasure11": "1 pound",
    "strSource": "https://www.thespruceeats.com/traditional-dutch-split-pea-soup-1129011"
  },
  {
    "idMeal": "52992",
    "strMeal": "Soya Glazeli Et Köfteleri, Wasabi Püreli Patates ve Fırınlanmış Havuçlar",
    "strDrinkAlternate": null,
    "strCategory": "Dana Eti",
    "strArea": "Amerikan",
    "strInstructions": "1. Fırını 425 dereceye ısıtın. Tüm sebzeleri yıkayıp kurulayın. Patatesleri 1/2 inçlik parçalar halinde doğrayın. Havuçları, 1/2 inç kalınlığında dilimleyin ve diyagonal şekilde kesin. Taze soğanları ince ince doğrayın, beyazlarını yeşillerinden ayırın; beyazlarını ince doğrayın. Sarımsakları soyup ince doğrayın.\r\n\r\n2. Orta boy bir kaseye, ekmek dilimini 2 yemek kaşığı su (4 yemek kaşığı su 4 porsiyon için) ile ıslatın; ellerinizle eziyerek püre haline getirin. İçine dana etini, sriracha sosu, soğan beyazlarını, sarımsağın yarısını, tuzu (biz 3/4 çay kaşığı tuz kullandık; 4 porsiyon için 1 1/2 çay kaşığı) ve karabiberi ekleyin. Karışımdan 1 inç yüksekliğinde iki köfte (4 porsiyon için dört köfte) yapın ve bir fırın tepsisine yerleştirin. Havuçları aynı tepsinin boş tarafına, biraz yağ, tuz ve karabiberle karıştırarak yerleştirin. (4 porsiyon için, köfteleri tüm tepsiye yayıp havuçları ikinci bir tepsiye ekleyin.) 20 dakika pişirin (bu sırada köfteleri glazürleyeceğiz).\r\n\r\n3. Bu arada, patatesleri orta boy bir tencereye koyun ve üzerini 2 inç kadar geçecek şekilde tuzlu su ekleyin. Kaynamaya başlayınca, çok yumuşayıncaya kadar 12-15 dakika pişirin. 1/2 su bardağı patates haşlama suyu ayırın, sonra süzün. Patatesler pişerken, küçük bir kasede soya sosu, sarımsak tozu, 1/4 su bardağı ketçap (4 porsiyon için 1/2 su bardağı) ve 2 çay kaşığı şeker (4 porsiyon için 4 çay kaşığı) karıştırın.\r\n\r\n4. Köfteler ve havuçlar 20 dakika piştikten sonra fırından çıkarın. Köftelerin üzerine ketçap glazürünün yarısını dökün (geri kalanını servis için ayırın); fırına geri koyun ve havuçlar kahverengi ve yumuşayıncaya kadar, köfteler tamamen pişene kadar, glazürün yapışkan hale gelmesi için 4-5 dakika daha pişirin.\r\n\r\n5. Bu sırada, kalan 2 yemek kaşığı tereyağını (4 porsiyon için 4 yemek kaşığı) patatesleri pişirdiğiniz tencerede orta ateşte eritin. Kalan sarımsağı ekleyin ve 30 saniye kadar kokusu çıkana kadar pişirin. Patatesleri ve 1/4 çay kaşığı wasabi ekleyin. Rezerv edilen patates haşlama suyunu azar azar ekleyerek püre haline getirin, gerekirse tuz ve karabiberle tatlandırın. (Eğer daha acı seviyorsanız daha fazla wasabi ekleyebilirsiniz!)\r\n\r\n6. Köfteleri, püreyi ve fırınlanmış havuçları tabaklara yerleştirin. Üzerine soğan yeşilleri serpin ve geri kalan ketçap glazürüyle birlikte servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/o2wb6p1581005243.jpg",
    "strTags": null,
    "strYoutube": "",
    "strIngredient1": "Patates",
    "strIngredient2": "Havuç",
    "strIngredient3": "Taze Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Ekmek",
    "strIngredient6": "Sarımsak Tozu",
    "strIngredient7": "Soya Sosu",
    "strIngredient8": "Kıyma",
    "strIngredient9": "Sebze Yağı",
    "strIngredient10": "Şeker",
    "strIngredient11": "Tereyağı",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "5",
    "strMeasure2": "12 ons",
    "strMeasure3": "1",
    "strMeasure4": "2 diş",
    "strMeasure5": "1 dilim",
    "strMeasure6": "1",
    "strMeasure7": "2",
    "strMeasure8": "1",
    "strMeasure9": "1 tatlı kaşığı",
    "strMeasure10": "2 çay kaşığı",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52994",
    "strMeal": "Tavada Elmalı Domuz Pirzolası, Fırınlanmış Tatlı Patates ve Kabak",
    "strDrinkAlternate": null,
    "strCategory": "Domuz Eti",
    "strArea": "Amerikan",
    "strInstructions": "2 porsiyon için\r\n\r\n1. Fırın raflarını üst ve orta konumlara ayarlayın ve fırını 450 dereceye ısıtın. Tüm sebzeleri yıkayıp kurulayın. Tatlı patatesleri 1/2 inçlik parçalara ayırın. Bir fırın tepsisine yerleştirip üzerine yağ, tuz ve karabiber ekleyin. Üst rafta 12 dakika pişirin (kabakları bu sırada pişireceğiz).\r\n\r\n2. Bu sırada, elmayı ikiye kesip çekirdeklerini çıkarın, ince dilimler halinde kesin. Sarımsağı soyup ince doğrayın. Limonu dörde bölün. Kabakları boyuna ikiye kesip, çapraz olarak 1/2 inç kalınlığında dilimlere ayırın. Diğer fırın tepsisine yerleştirip üzerine yağ ve tuz ekleyin. Bir kenarda bekletin.\r\n\r\n3. Domuz pirzolalarını kağıt havluyla kurulayın ve her tarafını tuz ve karabiberle baharatlayın. Orta yüksek ateşte büyük bir tavada bir miktar yağ ısıtın. Pirzolaları ekleyip, her iki tarafını 4-5 dakika pişirin. Ocağı kapatıp, pirzolaları bir tabağa alın.\r\n\r\n4. Tatlı patatesler 12 dakika piştikten sonra, kabakları orta rafta pişirin ve her iki sebze de kahverengi ve yumuşayıncaya kadar 12-15 dakika daha pişirin.\r\n\r\n5. Bu sırada, aynı tavada 1 yemek kaşığı tereyağını (2 yemek kaşığı 4 porsiyon için) orta yüksek ateşte eritin. Elmayı ekleyip tuz ve karabiberle tatlandırın. Tavada oluşan kahverengi parçaları karıştırarak, elmalar hafif yumuşayana kadar 2-3 dakika pişirin. Sarımsağı ekleyip kokusu çıkana kadar 30 saniye pişirin. 1/2 su bardağı su (4 porsiyon için 3/4 su bardağı), bulyon konsantresi ve 1 1/2 çay kaşığı şeker (4 porsiyon için 3 çay kaşığı) ekleyin. Sos koyulaşana kadar 3-5 dakika pişirin. Tuz ve karabiberle tatlandırın.\r\n\r\n6. Elmalı karışımı ocağı kapatarak, 1 yemek kaşığı tereyağını (4 porsiyon için 2 yemek kaşığı) ve limon suyunu ekleyin. Domuz pirzolasını, kabakları ve tatlı patatesleri tabaklara yerleştirin. Üzerine elmalı sosu dökün. Kabakları limon suyuyla sıkarak servis edin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/h3ijwo1581013377.jpg",
    "strTags": null,
    "strYoutube": "",
    "strIngredient1": "Patates",
    "strIngredient2": "Elma",
    "strIngredient3": "Sarımsak",
    "strIngredient4": "Limon",
    "strIngredient5": "Domuz Eti",
    "strIngredient6": "Kabak",
    "strIngredient7": "Tavuk Suyu",
    "strIngredient8": "Sebze Yağı",
    "strIngredient9": "Şeker",
    "strIngredient10": "Tereyağı",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2",
    "strMeasure2": "1",
    "strMeasure3": "2 diş",
    "strMeasure4": "1",
    "strMeasure5": "2",
    "strMeasure6": "1",
    "strMeasure7": "1",
    "strMeasure8": "1 yemek kaşığı",
    "strMeasure9": "1 1/2 çay kaşığı",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },

  {
    "idMeal": "53028",
    "strMeal": "Shawarma",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Mısır",
    "strInstructions": "Marine malzemelerini büyük bir ziplock torbasında (veya kasede) karıştırın.\r\nTavuğu ekleyin ve her parçasının kaplandığından emin olmak için ellerinizle karıştırın. Ziplock torbası kullanıyorsanız, torbayı kapatın ve torbanın içinde masaj yaparak her bir tavuk parçasına baharatı yaymak pratik olacaktır.\r\nBir gece veya 24 saate kadar marine edin.\r\nYoğurt Sosu malzemelerini bir kasede karıştırın. Üstünü kapatın ve soğutucuya koyun (soğutucuda 3 gün boyunca saklanabilir).\r\nIzgara/BBQ'yu (veya büyük bir ağır tabanlı tava) orta yüksek ısıda ısıtın. Yağ kullanmanıza gerek yoktur çünkü marinada zaten yağ vardır ve tavuk butları yağlıdır. Ama endişeleniyorsanız, ızgaranızı/tavanızı yağlayabilirsiniz. (Fırınlama için notlar için bakınız)\r\nTavuğu ızgaraya yerleştirin ve ilk tarafını 4-5 dakika kadar güzelce karamelize olana kadar pişirin, sonra diğer tarafı 3-4 dakika pişirin (2. taraf daha az zaman alır).\r\nTavuğu ızgaradan çıkarın ve üzerine folyo örtün. 5 dakika dinlendirin.\r\nSUNUM İÇİN\r\nTavuğu dilimleyin ve düz bir tabağa yerleştirin, yanına yassı ekmek, salata ve yoğurt sosu koyun.\r\nBir dürüm yapmak için bir parça yassı ekmek alın ve üzerine yoğurt sosu sürün. Biraz marul ve domates ile tavuk shawarma koyun. Sarın ve keyfini çıkarın!",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/kcv6hj1598733479.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=3lxUIeKDgic",
    "strIngredient1": "Tavuk Butları",
    "strIngredient2": "Kişniş",
    "strIngredient3": "Kimyon",
    "strIngredient4": "Karabiber",
    "strIngredient5": "Pul Biber",
    "strIngredient6": "Paprika",
    "strIngredient7": "Limon Suyu",
    "strIngredient8": "Zeytinyağı",
    "strIngredient9": "Yunan Yoğurdu",
    "strIngredient10": "Sarımsak Dişi",
    "strIngredient11": "Kimyon",
    "strIngredient12": "Limon Suyu",
    "strIngredient13": "Marul",
    "strIngredient14": "Domates",
    "strIngredient15": "Pita Ekmeği",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 kg",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "1 yemek kaşığı",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "1 tatlı kaşığı",
    "strMeasure6": "2 tatlı kaşığı",
    "strMeasure7": "2 yemek kaşığı",
    "strMeasure8": "3 yemek kaşığı",
    "strMeasure9": "1 su bardağı",
    "strMeasure10": "1 diş",
    "strMeasure11": "1 tatlı kaşığı",
    "strMeasure12": "Bir kaç damla",
    "strMeasure13": "Dilime",
    "strMeasure14": "Dilime",
    "strMeasure15": "6",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.recipetineats.com/chicken-sharwama-middle-eastern/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53040",
    "strMeal": "Soğanlı ve karidesli empanadas",
    "strDrinkAlternate": null,
    "strCategory": "Deniz Ürünleri",
    "strArea": "Portekiz",
    "strInstructions": "ADIM 1\r\n\r\nHamuru yapmak için, tereyağını una yedirin ve ardından yumurta beyazı ile yumurtanın yarısını (geri kalanını saklayın), sirkeyi, bir tutam tuzu ve soğuk suyu ekleyin. Yumuşak bir hamur elde edene kadar yoğurun ve ardından 30 dakika dinlendirin.\r\n\r\nADIM 2\r\n\r\nFırını 180°C'ye (fanlı 160°C) ısıtın. Yeşil uçlarını kesin ve geri kalanını ince ince doğrayın. Bir tavada biraz yağ ısıtın ve soğanları yavaşça, kahverengileşmeden pişirin. Chili ve sarımsağı ekleyin, karıştırın ve ardından karidesleri ekleyin ve opak olana kadar pişirin. İyi bir şekilde tuzlayın. Karidesleri çıkarın ve suları kaynamaya bırakın, ardından karidesleri geri ekleyin.\r\n\r\nADIM 3\r\n\r\nEmpanada hamurunu sekiz topa ayırın ve unlu bir yüzeyde ince daireler açın. Hamurun bir yarısına karışımı koyun, üzerine feta peyniri serpin ve diğer yarısını üzerine kapatın. Kenarları kesin ve ardından hamuru sıkıca kapatmak için katlayıp kıvırın, empanadayı yağlı bir fırın tepsisine yerleştirin (yanlamasına veya açılmamış kenarında bir Cornish pastası gibi). Kalan hamur ve karışımla işlemi tekrarlayın. Kalan yumurta sarısını suyla karıştırın ve empanadaların üstüne sürün.\r\n\r\nADIM 4\r\n\r\n30 dakika veya altın rengini alıp kenarları hafifçe gevrekleşene kadar pişirin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=Q24haJU-1dI",
    "strIngredient1": "Spring Soğanı",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Kırmızı Chili",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Karides",
    "strIngredient6": "Feta Peyniri",
    "strIngredient7": "Tereyağı",
    "strIngredient8": "Beyaz Un",
    "strIngredient9": "Yumurta",
    "strIngredient10": "Beyaz Sirke",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 demet",
    "strMeasure2": "Bir tutam",
    "strMeasure3": "1 ince doğranmış",
    "strMeasure4": "1 diş",
    "strMeasure5": "350g",
    "strMeasure6": "75g",
    "strMeasure7": "15g",
    "strMeasure8": "250g",
    "strMeasure9": "1 ayırılmış",
    "strMeasure10": "1/2 tatlı kaşığı",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.olivemagazine.com/recipes/fish-and-seafood/spring-onion-and-prawn-empanadas/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53054",
    "strMeal": "Seri muka kuih",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "Malezya",
    "strInstructions": "Yapışkan pirinci su ile en az 1,5 saat boyunca bekletin. Süzün.\r\n9 inçlik yuvarlak veya kare bir kek kalıbı hazırlayın ve pişirme spreyi ile sıvayın ya da plastik örtü ile kaplayın.\r\nSütlü hindistancevizi, su, tuz ve pirinci karıştırın. Karışımı kalıba dökün ve pandandan yapılan düğümleri ekleyin.\r\n30 dakika buharda pişirin.\r\n30 dakika sonra pirinci karıştırın ve pandan düğümlerini çıkarın. Ardından, yağlı bir spatula ile buharda pişirilmiş pirinci düzleştirin. Pirinçte hiçbir boşluk, hava kabarcığı veya açıklık olmadığından emin olun, özellikle kenarlarda.\r\nBaşka 10 dakika buharda pişirin.\r\n\r\nPandandan elde edilen suyu, hindistancevizi sütünü, un, mısır nişastası ve şekeri karıştırın. İyi bir şekilde karıştırın.\r\nYumurtaları ekleyin ve iyice çırpın, ardından bir metal kaseye veya tencereye süzün.\r\nPandandan karışımını kaynayan suyun üzerine (benmari usulü) yerleştirin.\r\nSürekli karıştırarak ve karıştırarak 15 dakika kadar pişirin, ardından karışım koyulaşmaya başlar.\r\nPandandan sosu pirinç tabakasının üzerine dökün, biraz vurun (hava kabarcıkları için) ve 30 dakika buharda pişirmeye devam edin.\r\nKuih Seri Muka'yı buharda pişirdikten sonra tamamen soğumaya bırakın ve dikdörtgen veya elmas şeklinde kesin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/6ut2og1619790195.jpg",
    "strTags": null,
    "strYoutube": "https://www.youtube.com/watch?v=_NJtCfqgaBo",
    "strIngredient1": "Pirinç",
    "strIngredient2": "Hindistancevizi Sütü",
    "strIngredient3": "Su",
    "strIngredient4": "Tuz",
    "strIngredient5": "Mısır Nişastası",
    "strIngredient6": "Un",
    "strIngredient7": "Yumurtalar",
    "strIngredient8": "Hindistancevizi Kreması",
    "strIngredient9": "Şeker",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "400g",
    "strMeasure2": "150ml",
    "strMeasure3": "100ml",
    "strMeasure4": "1 tatlı kaşığı",
    "strMeasure5": "5 yemek kaşığı",
    "strMeasure6": "3 yemek kaşığı",
    "strMeasure7": "3",
    "strMeasure8": "200ml",
    "strMeasure9": "140g",
    "strMeasure10": " ",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://makan.ch/recipe/kuih-seri-muka/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "53067",
    "strMeal": "Kinoa ve Siyah Fasulye ile Doldurulmuş Biberler",
    "strDrinkAlternate": null,
    "strCategory": "Vejetaryen",
    "strArea": "Meksika",
    "strInstructions": "1. Fırınınızı 375°F'ye (190°C) önceden ısıtın. 9x13 inçlik bir fırın kabını veya benzer büyüklükte bir güveç kabını hafifçe yağlayın.\r\n2. Biber yarımlarını kesilmiş tarafları yukarı bakacak şekilde hazırlanmış fırın kabına yerleştirin. 15-20 dakika veya hafifçe yumuşayana kadar pişirin.\r\n3. Biberler pişerken, iç harcını hazırlayın. Büyük bir tavada, zeytinyağını orta ateşte ısıtın. Doğranmış soğanı ekleyin ve yumuşayana kadar 3-4 dakika pişirin. Sarımsağı ekleyin ve hoş kokulu.\r\n4. Pişmiş kinoa, siyah fasulye, mısır, doğranmış domates, öğütülmüş kimyon, acı biber tozu, füme kırmızı biber, tuz ve karabiberi karıştırın. 5-7 dakika, iyice ısınana kadar pişirin. Tavayı ocaktan alın ve kullanıyorsanız 1 su bardağı rendelenmiş peyniri karıştırın.\r\n5. Biberleri fırından çıkarın ve her biber yarısını dikkatlice kinoa ve siyah fasulye karışımıyla doldurun. Kullanıyorsanız doldurulmuş biberlerin üzerine kalan 1/2 su bardağı rendelenmiş peynir koyun.\r\n6. Doldurulmuş biberleri tekrar fırına koyun ve peynir eriyene ve biberler yumuşayana kadar 15-20 dakika daha pişirin.\r\n7. Fırından çıkarın ve servis etmeden önce doldurulmuş biberlerin 5 dakika soğumasını bekleyin. Taze doğranmış kişnişle süsleyin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/b66myb1683207208.jpg",
    "strTags": null,
    "strYoutube": "",
    "strIngredient1": "Yeşil Biber",
    "strIngredient2": "Zeytinyağı",
    "strIngredient3": "Soğan",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Kinoa",
    "strIngredient6": "Siyah Fasulye",
    "strIngredient7": "Tatlı Mısır",
    "strIngredient8": "Küp Domates",
    "strIngredient9": "Kimyon",
    "strIngredient10": "Acı Biber Tozu",
    "strIngredient11": "Füme Kırmızı Biber",
    "strIngredient12": "Tuz",
    "strIngredient13": "Biber",
    "strIngredient14": "Rendelenmiş Meksika Peyniri",
    "strIngredient15": "Kişniş",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "4 bütün",
    "strMeasure2": "1 yemek kaşığı",
    "strMeasure3": "1 küçük ince doğranmış",
    "strMeasure4": "2 diş kıyılmış",
    "strMeasure5": "1 su bardağı",
    "strMeasure6": "1 kutu ",
    "strMeasure7": "1 su bardağı ",
    "strMeasure8": "1 kutu ",
    "strMeasure9": "1 çay kaşığı",
    "strMeasure10": "½ çay kaşığı",
    "strMeasure11": "½ çay kaşığı",
    "strMeasure12": "Tadına bakmak için",
    "strMeasure13": "Tadına bakmak için",
    "strMeasure14": "1 1/2 su bardağı ",
    "strMeasure15": "Doğranmış",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },

  {
    "idMeal": "52806",
    "strMeal": "Tandoori Tavuk",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Hindistan",
    "strInstructions": "Limon suyunu, paprika ve kırmızı soğanları büyük, sığ bir kaba karıştırın. Her tavuk budu üzerine üç kez kesik atın, ardından limonlu karışıma bulayıp 10 dakika bekletin.\r\nTüm marinad malzemelerini karıştırın ve tavukların üzerine dökün. Karıştırın, ardından üzerini kapatıp en az 1 saat buzdolabında bekletin. Bu işlemi 1 gün önceden de yapabilirsiniz.\r\nIzgarayı ısıtın. Tavukları bir fırın tel rafına yerleştirip üzerine biraz yağ sürün ve her iki tarafı da hafifçe yanmış ve tamamen pişene kadar her tarafı 8 dakika kadar ızgaralayın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/qptpvt1487339892.jpg",
    "strTags": "Baharatlı, Et",
    "strYoutube": "https://www.youtube.com/watch?v=-CKvt1KNU74",
    "strIngredient1": "Limonlar",
    "strIngredient2": "Paprika",
    "strIngredient3": "Kırmızı soğanlar",
    "strIngredient4": "Tavuk butları",
    "strIngredient5": "Sebze yağı",
    "strIngredient6": "Yunan yoğurdu",
    "strIngredient7": "Zencefil",
    "strIngredient8": "Sarımsak dişi",
    "strIngredient9": "Garam masala",
    "strIngredient10": "Kimyon",
    "strIngredient11": "Chili tozu",
    "strIngredient12": "Zerdeçal",
    "strMeasure1": "2 Limon Suyu",
    "strMeasure2": "4 çay kaşığı",
    "strMeasure3": "2 ince doğranmış",
    "strMeasure4": "16 deri yüzü",
    "strMeasure5": "Fırçalamak için",
    "strMeasure6": "300ml",
    "strMeasure7": "Büyük parça",
    "strMeasure8": "4 diş",
    "strMeasure9": "¾ çay kaşığı",
    "strMeasure10": "¾ çay kaşığı",
    "strMeasure11": "½ çay kaşığı",
    "strMeasure12": "¼ çay kaşığı",
    "strSource": "http://www.bbcgoodfood.com/recipes/1660651/tandoori-chicken",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52814",
    "strMeal": "Tay Yeşil Köri",
    "strDrinkAlternate": null,
    "strCategory": "Tavuk",
    "strArea": "Tayland",
    "strInstructions": "Patatesleri kaynar suya koyun ve 5 dakika pişirin. Ardından fasulyeleri ekleyin ve 3 dakika daha pişirin, bu süre içinde her ikisi de tam pişmiş ama fazla yumuşamamış olmalı. Süzüp bir kenara koyun.\r\nBüyük bir wok veya tavada, yağı çok sıcak olacak şekilde ısıtın, sonra sarımsakları ekleyin ve altın rengini alana kadar birkaç saniye pişirin. Çok kararmamasına dikkat edin, aksi takdirde tadı bozulur. Köri ezmesini ekleyip birkaç saniye karıştırarak baharatları pişirin ve tüm lezzetleri salın.\r\nHindistancevizi sütünü ekleyin ve kaynamaya bırakın.\r\nBalık sosunu ve şekeri ekledikten sonra tavuk parçalarını ekleyin. Isıyı kısıp, tavuklar pişene kadar yaklaşık 8 dakika kapağı kapalı olarak pişirin.\r\nPatatesleri ve fasulyeleri ekleyin ve sıcak hindistancevizi sütünde ısıtın, sonra taze lime yapraklarını (veya lime kabuğu rendesini) ekleyerek asidik bir tat katın. Fesleğen yapraklarını ekleyin, fakat çok fazla pişirmeyin çünkü renklerini kaybederler. Lime dilimleriyle süsleyin ve hemen pilavla servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg",
    "strTags": "Köri, Hafif",
    "strYoutube": "https://www.youtube.com/watch?v=LIbKVpBQKJI",
    "strIngredient1": "Patates",
    "strIngredient2": "Yeşil fasulye",
    "strIngredient3": "Ayçiçek yağı",
    "strIngredient4": "Sarımsak",
    "strIngredient5": "Tay yeşil köri ezmesi",
    "strIngredient6": "Hindistancevizi sütü",
    "strIngredient7": "Tay balık sosu",
    "strIngredient8": "Şeker",
    "strIngredient9": "Tavuk",
    "strIngredient10": "Lime",
    "strIngredient11": "Fesleğen",
    "strIngredient12": "Pilav",
    "strMeasure1": "225g yeni",
    "strMeasure2": "100g",
    "strMeasure3": "1 yemek kaşığı",
    "strMeasure4": "1 diş",
    "strMeasure5": "4 çay kaşığı",
    "strMeasure6": "400ml",
    "strMeasure7": "2 çay kaşığı",
    "strMeasure8": "1 çay kaşığı",
    "strMeasure9": "450g kemiksiz",
    "strMeasure10": "2 taze lime yaprağı",
    "strMeasure11": "Bir avuç",
    "strMeasure12": "Haşlanmış",
    "strSource": "http://www.bbcgoodfood.com/recipes/3235/thai-green-chicken-curry",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52845",
    "strMeal": "Hindi Köftesi",
    "strDrinkAlternate": null,
    "strCategory": "Çeşitli",
    "strArea": "İngiliz",
    "strInstructions": "Fırını 180C/160C fan/gaz 4'te ısıtın. Büyük bir tavada yağı ısıtın ve soğanı 8-10 dakika kadar, yumuşayana kadar pişirin. Sarımsak, Worcestershire sosu ve 2 çay kaşığı domates salçasını ekleyin, karıştırarak birleşmesini sağlayın. Soğuması için bir kenara koyun.\r\n\r\nHindi kıyması, yumurta, galeta unu ve soğutulmuş soğan karışımını büyük bir kaseye koyun ve iyice baharatlayın. Her şeyi karıştırarak birleşmesini sağlayın, sonra dikdörtgen bir köfte şeklinde şekillendirip büyük bir fırın tepsisine yerleştirin. Üzerine 2 yemek kaşığı barbekü sosu sürün ve 30 dakika pişirin.\r\n\r\nBu arada, 1 kutu fasulyeyi süzün, sonra her iki kutuyu da büyük bir kaseye dökün. Kalan barbekü sosunu ve domates salçasını ekleyin. Baharatlayın ve bir kenara koyun.\r\n\r\nKöftenin ilk pişirme süresi tamamlandığında, fasulyeleri etrafına serpiştirin ve 15 dakika daha pişirin, köfte tamamen pişene kadar ve fasulyeler iyice ısınıncaya kadar. Üzerine maydanoz serpiştirip, köfteyi dilimleyerek servis yapın.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/ypuxtw1511297463.jpg",
    "strTags": "Alkol İçeren",
    "strYoutube": "https://www.youtube.com/watch?v=mTvlmY4vCug",
    "strIngredient1": "Zeytinyağı",
    "strIngredient2": "Soğan",
    "strIngredient3": "Sarımsak",
    "strIngredient4": "Worcestershire Sosu",
    "strIngredient5": "Domates Salçası",
    "strIngredient6": "Hindi Kıyma",
    "strIngredient7": "Yumurta",
    "strIngredient8": "Galeta Unu",
    "strIngredient9": "Barbekü Sosu",
    "strIngredient10": "Cannellini Fasulyesi",
    "strIngredient11": "Maydanoz",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 yemek kaşığı",
    "strMeasure2": "1 büyük",
    "strMeasure3": "1 diş soyulmuş ve ezilmiş",
    "strMeasure4": "2 yemek kaşığı",
    "strMeasure5": "3 çay kaşığı",
    "strMeasure6": "500g",
    "strMeasure7": "1 büyük",
    "strMeasure8": "85g",
    "strMeasure9": "2 yemek kaşığı",
    "strMeasure10": "800g",
    "strMeasure11": "2 yemek kaşığı",
    "strMeasure12": "",
    "strMeasure13": "",
    "strMeasure14": "",
    "strMeasure15": "",
    "strMeasure16": "",
    "strMeasure17": "",
    "strMeasure18": "",
    "strMeasure19": "",
    "strMeasure20": "",
    "strSource": "https://www.bbcgoodfood.com/recipes/turkey-meatloaf",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52977",
    "strMeal": "Çorba",
    "strDrinkAlternate": null,
    "strCategory": "Side",
    "strArea": "Türkiye",
    "strInstructions": "Mercimeklerinizi yabancı maddelerden arındırın, 2 veya 3 kez yıkayın, suyunu süzün ve bir kenara koyun. Uyarı: Bu, mercimeklerinizi muhtemelen daha sonra parçalamak zorunda kalacağınız katı bir bloğa dönüştürecektir\r\nOrta-yüksek ateşte büyük bir tencerede zeytinyağını ve soğanı bir tutam tuzla yaklaşık 3 dakika soteleyin, ardından havuçları ekleyin ve 3 dakika daha pişirin.\r\nDomates salçasını ekleyin ve yaklaşık 1 dakika karıştırın. Şimdi kimyon, kırmızı toz biber, nane, kekik, karabiber ve kırmızı biberi olabildiğince çabuk ekleyin ve baharatların çiçek açması için 10 saniye karıştırın. Kendinizi tebrik edin Eviniz şimdi ne kadar harika kokuyor.\r\nHemen mercimekleri, suyu, suyu ve tuzu ekleyin. Çorbayı (hafifçe) kaynatın.\r\nKaynadıktan sonra, ateşi orta-düşük seviyeye düşürün, tencereyi yarıya kadar kapatın ve mercimekler dağılana ve havuçlar tamamen pişene kadar 15-20 dakika pişirin.\r\nÇorba piştikten ve mercimekler yumuşadıktan sonra, çorbayı bir blenderda karıştırın veya istediğiniz kıvama gelene kadar el blenderi kullanın. Baharatları tadın ve gerekirse daha fazla tuz ekleyin.\r\nEzilmiş krakerler, yırtılmış ekmek veya biraz ekstra kalınlık katmak için başka bir şeyle servis edin. Geleneksel bir koyulaştırıcı da kullanabilirsiniz (mısır nişastası veya un gibi), ancak biraz doku ve tuzluluk için kraker eklemeyi tercih ediyorum. Harika artıkları yapar, buzdolabında yaklaşık bir hafta kadar tazeliğini korur.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/58oia61564916529.jpg",
    "strTags": "Çorba",
    "strYoutube": "https://www.youtube.com/watch?v=VVnZd8A84z4",
    "strIngredient1": "Mercimek",
    "strIngredient2": "Soğan",
    "strIngredient3": "Havuç",
    "strIngredient4": "Domates Püresi",
    "strIngredient5": "Kimyon",
    "strIngredient6": "Paprika",
    "strIngredient7": "Nane",
    "strIngredient8": "Kekik",
    "strIngredient9": "Karabiber",
    "strIngredient10": "Kırmızı Biber Pulları",
    "strIngredient11": "Sebze Suyu",
    "strIngredient12": "Su",
    "strIngredient13": "Deniz Tuzu",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "1 su bardağı ",
    "strMeasure2": "1 büyük",
    "strMeasure3": "1 büyük",
    "strMeasure4": "1 yemek kaşığı",
    "strMeasure5": "2 çay kaşığı",
    "strMeasure6": "1 çay kaşığı ",
    "strMeasure7": "1/2 çay kaşığı",
    "strMeasure8": "1/2 çay kaşığı",
    "strMeasure9": "1/4 çay kaşığı",
    "strMeasure10": "1/4 çay kaşığı",
    "strMeasure11": "4 su bardağı ",
    "strMeasure12": "1 su bardağı ",
    "strMeasure13": "Bir tutam",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://findingtimeforcooking.com/main-dishes/red-lentil-soup-corba/",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52978",
    "strMeal": "Kumpir",
    "strDrinkAlternate": null,
    "strCategory": "Yan",
    "strArea": "Türkiye",
    "strInstructions": "Türkiye'de kumpir sipariş ederseniz, standart iç harcı önce patatese ezilmiş bol tereyağı, ardından peynirdir. Daha sonra gönlünüzce işaret edebileceğiniz bir dizi başka sos vardır - tatlı mısır, zeytin, salam, lahana salatası, Rus salatası, her türlü - ve sunulan seçeneklerden çok heyecanlandığınız için aşırı doldurulmuş bir patatesle ayrılırsınız.\r\n\r\n150 gr peyniri rendeleyin (kabaca - istediğiniz kadar kullanabilirsiniz).\r\nBir soğanı ve bir tatlı kırmızı biberi incecik doğrayın.\r\nBu malzemeleri iyi bir tuz ve karabiber serpin, pul biber (isteğe bağlı).",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/mlchx21564916997.jpg",
    "strTags": "SideDish",
    "strYoutube": "https://www.youtube.com/watch?v=IEDEtZ4UVtI",
    "strIngredient1": "Patates",
    "strIngredient2": "Tereyağı",
    "strIngredient3": "Peynir",
    "strIngredient4": "Soğan",
    "strIngredient5": "Kırmızı Biber",
    "strIngredient6": "Kırmızı Biber Pulları",
    "strIngredient7": "",
    "strIngredient8": "",
    "strIngredient9": "",
    "strIngredient10": "",
    "strIngredient11": "",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "2 büyük",
    "strMeasure2": "2 yemek kaşığı",
    "strMeasure3": "150g",
    "strMeasure4": "1 büyük",
    "strMeasure5": "1 büyük",
    "strMeasure6": "Sıkıştırma",
    "strMeasure7": " ",
    "strMeasure8": " ",
    "strMeasure9": " ",
    "strMeasure10": " ",
    "strMeasure11": " ",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "http://www.turkeysforlife.com/2013/10/firinda-kumpir-turkish-street-food.html",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  },
  {
    "idMeal": "52988",
    "strMeal": "Klasik Noel pudingi",
    "strDrinkAlternate": null,
    "strCategory": "Tatlı",
    "strArea": "İngiliz",
    "strInstructions": "Puding için her şeyi hazırlayın. Bademleri iri doğrayın. Pişirme elmalarını soyun, çekirdeklerini çıkarın ve doğrayın. Bıçağınızı bileyin ve şekerlenmiş kabuğu doğrayın. (Bademleri ve elmaları bir mutfak robotunda doğrayabilirsiniz, ancak soyma işlemi elle yapılmalıdır.) Hindistan cevizinin dörtte üçünü rendeleyin (çok fazla gibi geliyor ama doğru).\r\n\r\nBademleri, elmaları, şekerlenmiş kabuğu, hindistan cevizini, kuru üzümleri, unu, galeta ununu, açık muscovado şekerini, yumurtaları ve 2 yemek kaşığı brendi veya konyağı büyük bir kasede karıştırın.\r\n\r\n Tereyağını ambalajına koyun, dörtte birini rendeleyin ve sonra her şeyi karıştırın. Tüm tereyağı rendelenene kadar tekrarlayın, sonra 3-4 dakika karıştırın - karışım her karıştırmadan sonra hafifçe azaldığında hazırdır. Aileden de karıştırmasını isteyin ve herkesin bir dilek tutmasını sağlayın. \r\n\r\nİki adet 1,2 litrelik kabı cömertçe tereyağıyla yağlayın ve her birinin altına bir daire şeklinde fırın kağıdı koyun. Puding karışımını doldurun. Çift kat fırın kağıdıyla örtün, genişlemesine izin vermek için kıvırın, sonra iple bağlayın (bağlarken kağıdı lastik bantla yerinde tutun). Fazla kağıdı kesin. \r\n\r\nŞimdi her kabı büyük bir folyo tabakasının üzerine koyun ve kenarlarını üste getirin, sonra üstüne başka bir folyo tabakası koyun ve altına getirerek çift paket yapın (bu pudingleri su geçirmez hale getirir). Daha fazla iple bağlayın ve tavaya kolayca girip çıkarmak için bir sap yapın. Pudingi doğru şekilde nasıl bağlayacağınızı görmek için videomuzu izleyin.\r\n\r\nPudingleri 8 saat kaynatın veya fırında buharlayın, gerekirse su ekleyin. Tavalardan çıkarın ve bir gece soğumaya bırakın. Soğuduğunda, dağınık ambalajları çıkarın ve yeni pişirme kağıdına, folyoya ve ipe tekrar sarın. Noel'e kadar serin ve kuru bir yerde saklayın. \r\n\r\nBrendi tereyağını yapmak için, tereyağını portakal kabuğu rendesi ve pudra şekeriyle krema haline getirin. Yavaş yavaş brendi veya konyak ve kıyılmış zencefil sapını çırpın. Küçük bir kaseye koyun, üstünü çatalla güzelce delin ve donması için buzdolabına koyun. Tereyağı buzdolabında bir hafta dayanır veya altı haftaya kadar dondurulabilir. \r\n\r\nNoel Günü'nde, 1 saat kaynatın veya fırında buharlayın. Ambalajını açın ve ters çevirin. Alevlendirmek için, küçük bir tavada 3-4 yemek kaşığı brendiyi ısıtın, pudingin üzerine dökün ve ateşe verin.",
    "strMealThumb": "https://www.themealdb.com/images/media/meals/1d85821576790598.jpg",
    "strTags": "Noel",
    "strYoutube": "https://www.youtube.com/watch?v=Pb_lJxL1vtk",
    "strIngredient1": "Badem",
    "strIngredient2": "Bramley Elmaları",
    "strIngredient3": "Şekerlenmiş Kabuk",
    "strIngredient4": "Hindistan Cevizi",
    "strIngredient5": "Kuru Üzüm",
    "strIngredient6": "Düz Un",
    "strIngredient7": "Ekmek kırıntıları",
    "strIngredient8": "Muscovado Şekeri",
    "strIngredient9": "Yumurtalar",
    "strIngredient10": "Brendi",
    "strIngredient11": "Tereyağı",
    "strIngredient12": "",
    "strIngredient13": "",
    "strIngredient14": "",
    "strIngredient15": "",
    "strIngredient16": "",
    "strIngredient17": "",
    "strIngredient18": "",
    "strIngredient19": "",
    "strIngredient20": "",
    "strMeasure1": "50g",
    "strMeasure2": "2 büyük",
    "strMeasure3": "200g",
    "strMeasure4": "1 bütün",
    "strMeasure5": "1kg",
    "strMeasure6": "140g",
    "strMeasure7": "100g ",
    "strMeasure8": "100g ",
    "strMeasure9": "3 Büyük",
    "strMeasure10": "2 yemek kaşığı",
    "strMeasure11": "250g",
    "strMeasure12": " ",
    "strMeasure13": " ",
    "strMeasure14": " ",
    "strMeasure15": " ",
    "strMeasure16": " ",
    "strMeasure17": " ",
    "strMeasure18": " ",
    "strMeasure19": " ",
    "strMeasure20": " ",
    "strSource": "https://www.bbcgoodfood.com/recipes/classic-christmas-pudding",
    "strImageSource": null,
    "strCreativeCommonsConfirmed": null,
    "dateModified": null
  }
]
